{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. All patients with relapsed or high risk acute lymphoblastic or myeloblastic leukaemia planned for haemopoietic stem cell transplantation 2. Cooperative paediatric individuals and young adults (5-24-years-old) not requiring general anaesthesia or sedation for the purpose of MRI 3. Able to lie flat throughout the scan  Exclusion Criteria:  1. Non cooperative patients 2. Ferromagnetic implants, contraindicating MRI 3. Claustrophobia 4. Unable to lie flat throughout the scan 5. Uncertain histological diagnosis 6. Musculoskeletal disorders 7. Metabolic disorders 8. Lack of signed parental consent and patient's verbal approval", "description": "This is a pilot cancer imaging study investigating change in the apparent diffusion coefficient (ADC) at a single time point post-transplantation in patients. The treatment is bone marrow transplant as per standard patient care, without change for trial purposes.  Its main aim is to evaluate the engraftment of bone marrow after transplantation performing functional Magnetic Resonance Imaging (MRI) of the lumbar spine and pelvis at baseline and after 2-3 weeks after the transplantation (according to the appearances of raised white blood cells).This will enhance the understanding of bone marrow features on imaging at engraftment and improve the management of children/young adults who suffer acute leukaemia.  Following allogenic haemopoietic stem cell transplantation, changes in bone marrow apparent diffusion coefficient (ADC) are measurable at the point of engraftment and in conjunction with peripheral blood counts may provide a future biomarker of successful clinical outcome.", "title": "Quantitative Magnetic Resonance Imaging of Bone Marrow in a Paediatric Population With Leukaemia (PUMA)", "url": "https://ClinicalTrials.gov/show/NCT03466944", "enrollment": "12", "max_age": "24.0", "study_type": "OBSERVATIONAL", "sampling_method": "PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT03466944", "locations": ["United Kingdom"], "min_age": "5.0", "outcome_measures": ["The change in ADC following bone marrow transplantation at the point of engraftment in paediatric patients with leukaemia.; 8 months", "The change in ADC following bone marrow transplantation at the point of engraftment in paediatric patients with leukaemia.; 8 months"], "phases": ["NA"], "start_date": "2018-03-05", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  Inclusion criteria for trial entry  * Diagnosis of acute myeloid leukaemia (AML) /high risk Myelodysplastic syndrome (MDS) (\\>10% blasts in the bone marrow)/isolated myeloid sarcoma (MS) (either de novo or secondary). * Age \\<18 years at trial entry. * No prior chemotherapy or biological therapy for AML/high risk MDS/isolated MS other than that permitted in the protocol. * Normal cardiac function defined as fractional shortening ≥28% or ejection fraction ≥55%. * Fit for protocol chemotherapy. * Documented negative pregnancy test for female patients of childbearing potential. * Patient agrees to use effective contraception (patients of child bearing potential). * Written informed consent from the patient and/or parent/legal guardian.  Inclusion criteria for participation in the gemtuzumab ozogamicin dose finding study:  Centres must be formally activated in order to be take part in the embedded dose escalation study. Please contact the trial office for further information.  * Patient meets the inclusion criteria for trial entry. * Age:    * ≥12 months for the major dose finding study   * ≥ 12 weeks and \\<12 months for the minor dose finding study * Normal renal function defined as calculated creatinine clearance ≥90ml/min/1.73m2. * Normal hepatic function defined as total bilirubin ≤2.5 upper limit of normal (ULN) for age unless it is caused by leukaemic involvement or Gilbert's syndrome or similar disorder. * Alanine transaminase (ALT) or aspartate transaminase (AST) ≤10 x ULN for age. * Written informed consent from the patient and/or parent/legal guardian.  Inclusion criteria for treatment with gemtuzumab ozogamicin for patients not participating in the gemtuzumab ozogamicin dose finding study or R2.  * Patient meets the inclusion criteria for trial entry (section 4.1.1) * Age:    * ≥12 months   * ≥ 12 weeks   * ≥28 days and \\<12 weeks (patients will receive a maximum of one dose of gemtuzumab ozogamicin) * Normal renal function, defined as calculated creatinine clearance ≥90 ml/min/1.73m2 * Normal hepatic function, defined as total bilirubin ≤2.5 upper limit of normal (ULN) for age and not due to leukaemic involvement or Gilbert's syndrome or similar disorder * ALT or AST ≤10 x ULN for age * Written informed consent from the patient and/or parent/legal guardian  Inclusion criteria for participation in R2.(once open to randomisation in the applicable age group)  • Patient meets the inclusion criteria for trial entry  Patient age:  * ≥12 months * ≥12 weeks (once R2 open in patients aged ≥12 weeks and \\<12 months) * Normal renal function defined as calculated creatinine clearance ≥90ml/min/1.73m2. * Normal hepatic function defined as total bilirubin ≤2.5 ULN for age and not due to leukaemic involvement or Gilbert's syndrome or similar disorder. * ALT or AST ≤10 x ULN for age. * Written informed consent from the patient and/or parent/legal guardian.  Inclusion criteria for participation in R3.  * Patient meets the inclusion criteria for trial entry * Induction treatment as per MyeChild 01 protocol or treated with 2 courses of mitoxantrone \\& cytarabine off trial. * Minimal residual disease (MRD) response (performed in MyeChild 01 centralised laboratories, see national MyeChild 01 Laboratory Manual):    * Patients with good risk cytogenetics/molecular genetics and a MRD level \\<0.1% by flow after course 2, or a decrease in transcript levels of \\>3 logs after course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring or   * Patients with intermediate risk cytogenetics/molecular genetics with a MRD level \\<0.1% by flow after course 1 and course 2, or a decrease in transcript levels of \\>3 logs after course 1 and course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring. * Written informed consent from the patient and/or parent/legal guardian.  Inclusion criteria for participation in R4.  * Patient meets the inclusion criteria for trial entry * Induction treatment as per MyeChild 01 protocol or treated with 1 or 2 courses of mitoxantrone \\& cytarabine ± treatment intensification with fludarabine, cytarabine \\& idarubicin (FLA-Ida) off trial. * Patient is in complete remission (CR) or CR with incomplete blood count recovery (CRi) defined as \\<5% blasts confirmed by flow cytometry/ molecular/FISH in a bone marrow aspirate taken within 6 weeks prior to randomisation to R4. * Patient meets one of the following criteria and is a candidate for HSCT as per the protocol:    * High risk after course 1 (all patients with poor risk cytogenetics and patients with intermediate risk cytogenetics who fail to achieve CR/CRi).   * Intermediate risk cytogenetics with MRD \\>0.1% after course 1 and 2 measured by flow. If no flow MRD marker of sufficient sensitivity is identified, a molecular MRD marker with a sensitivity of \\>0.1% may be used.   * Good risk cytogenetics with flow MRD \\>0.1% confirmed by a decrease in molecular MRD of \\<3 logs or rising transcript levels after course 3 despite treatment intensification (FLA-Ida) and after discussion with the Clinical Co-ordinators. * Availability of a 9-10/10 human leukocyte antigen (HLA) matched family or unrelated donor or 5-8/8 matched cord blood unit with an adequate cell dose as defined by the protocol section 17.1. * Written informed consent from the patient and/or parent/legal guardian.  Exclusion Criteria:  Exclusion criteria for all randomisations  * Acute Promyelocytic Leukaemia. * Myeloid Leukaemia of Down Syndrome. * Blast crisis of chronic myeloid leukaemia. * Relapsed or refractory AML. * Bone marrow failure syndromes. * Prior anthracycline exposure which would inhibit the delivery of study anthracyclines. * Concurrent treatment or administration of any other experimental drug or with any other biological therapy for AML/high risk MDS/isolated MS. * Pregnant or lactating females.", "description": "The main purpose of this study is :  1. To establish which number of doses of gemtuzumab ozogamicin (up to a maximum of 3 doses) is tolerated and can be safety delivered in combination with cytarabine plus mitoxantrone or liposomal daunorubicin in induction 2. To compare mitoxantrone (anthracenedione) \\& cytarabine with liposomal daunorubicin (anthracycline) \\& cytarabine as induction therapy. (Randomisation 1 (R1) closed early to recruitment on 8th September 2017, due to liposomal daunorubicin manufacturing issues resulting in unavailability of the drug.) 3. To compare a single dose of gemtuzumab ozogamicin with the optimum tolerated number of doses of gemtuzumab ozogamicin (identified by the dose-finding study) when combined with induction chemotherapy. 4. To compare two consolidation regimens: high dose cytarabine (HD Ara-C) and fludarabine \\& cytarabine (FLA) in standard risk patients. 5. To compare the toxicity and effectiveness of two haemopoietic stem cell transplant (HSCT) conditioning regimens of different intensity: conventional myeloablative conditioning (MAC) with busulfan/cyclophosphamide and reduced intensity conditioning (RIC) with fludarabine/busulfan.", "title": "International Randomised Phase III Clinical Trial in Children With Acute Myeloid Leukaemia - Incorporating an Embedded Dose Finding Study for Gemtuzumab Ozogamicin in Combination With Induction Chemotherapy", "url": "https://ClinicalTrials.gov/show/NCT02724163", "enrollment": "700", "max_age": "17.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT02724163", "locations": ["France", "New Zealand", "United Kingdom", "Australia", "Switzerland", "Ireland"], "min_age": 0, "outcome_measures": ["Incidence of dose limiting toxicities (DLTs).; Incidence of DLTs will be evaluated up to day 45 post course 1 and course 2 of induction chemotherapy.", "Event Free Survival (EFS).; Event free survival (EFS) will be evaluated as the time from randomisation one to the first event, up to 16 years.", "Event Free Survival (EFS).; Event free survival (EFS) will be evaluated as the time from randomisation two to the first event, up to 16 years..", "Relapse free survival (RFS).; Relapse free survival (RFS) will be evaluated as the time of randomisation three to the first relapse or death from any cause, up to 16 years.", "Early treatment related adverse reactions.; Early treatment related adverse reactions will be evaluated at day 100 post-transplant.", "Relapse free survival (RFS).; Relapse free survival (RFS) will be evaluated as the time of randomisation four to the first relapse or death from any cause, up to 16 years.", "Relapse free survival (RFS).; Relapse free survival (RFS) will be evaluated as the time of randomisation three to the first relapse or death from any cause, up to 16 years.", "Event Free Survival (EFS).; Event free survival (EFS) will be evaluated as the time from randomisation one to the first event, up to 16 years.", "Relapse free survival (RFS).; Relapse free survival (RFS) will be evaluated as the time of randomisation four to the first relapse or death from any cause, up to 16 years.", "Incidence of dose limiting toxicities (DLTs).; Incidence of DLTs will be evaluated up to day 45 post course 1 and course 2 of induction chemotherapy.", "Event Free Survival (EFS).; Event free survival (EFS) will be evaluated as the time from randomisation two to the first event, up to 16 years..", "Early treatment related adverse reactions.; Early treatment related adverse reactions will be evaluated at day 100 post-transplant."], "phases": ["PHASE3"], "status": "RECRUITING", "start_date": "2016-04"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Age of at least 18 years * Clinical diagnosis of CLL/SLL that meets published diagnostic criteria (Hallek 2008) * Willing and able to provide informed consent * Willing and able to provide blood sample at time of enrollment  Exclusion Criteria:  * Diagnosis of other B-cell malignancies", "description": "Brief Summary: The purpose of the OFICE registry is to characterize and describe the CLL patients' population from the Finistere area and evaluates the association between different patient characteristics, prognosis and treatment patterns.  Detailed Description: OFICE is a single center, prospective, observational registry of CLL patients designed to provide a general description of the CLL patients' population from the Finistere area, France. The registry will also provide information on the association of cytogenetic and immunophenotypic characteristics with disease progression, as well as treatment patterns and healthcare resource utilization. These data will be accessible and beneficial for researchers and physicians and will help guide clinical practice and future clinical or fundamental studies.", "title": "none", "url": "https://ClinicalTrials.gov/show/NCT03294980", "enrollment": "3000", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT03294980", "locations": ["France"], "min_age": "18.0", "outcome_measures": ["Prevalence; Year 0 (Y)", "Prevalence; Year 0 (Y)"], "phases": ["NA"], "start_date": "2015-11", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  Participant must be 18 years of age inclusive  Participants with confirmed diagnosis of relapsed or primary refractory acute myeloid leukemia (AML), according to World Health Organization (WHO) classification, including:  * Participants with relapsed AML after allogeneic stem cells transplantation, including those who have received donor lymphocyte infusions, * Isolated central nervous system (CNS) or extramedullary disease, * At least 1 prior line of therapy which includes chemotherapy, hypomethylating agents, venetoclax or targeted therapy.  Participants with a weight ≥42 kg.  Exclusion Criteria:  * Second primary malignancy that requires active therapy. Adjuvant hormonal therapy is allowed. * Known acquired immunodeficiency syndrome (AIDS-related illnesses) or human immunodeficiency virus (HIV) disease requiring antiretroviral treatment, or having active hepatitis B or C infection, or symptomatic severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection. * Pregnant or breast-feeding women, female participants of childbearing potential, and male participants with female partners of childbearing potential who are not willing to avoid pregnancy by using a highly effective method of contraception (2 barrier method or 1 barrier method with a spermicide, intrauterine device, or hormonal contraception with inhibition of ovulation, for 2 weeks prior to the first dose of SAR445419, during treatment, and 6 months after the last dose of fludarabine). A woman is considered of childbearing potential, i.e., fertile, following menarche and until becoming postmenopausal unless permanently sterile. * History of solid organ transplant, including corneal transplant. * Receiving at the time of first SAR445419 administration corticosteroid as a concomitant medication with corticosteroid dose \\>10 mg/day of oral prednisone or the equivalent, except steroid inhaler, nasal spray, or ophthalmic solution * Known contraindication to any of the non-investigational medicinal products (NIMPs) (fludarabine, cytarabine, acetaminophen and diphenhydramine). * Concurrent treatment with other investigational drugs  The above information is not intended to contain all considerations relevant to a potential participation in a clinical trial.", "description": "This is a single group, Phase 1, single-arm, dose escalation study to determine the candidate dose(s), and evaluate safety, tolerability, and preliminary anti-tumor activity of SAR445419 administered after fludarabine and cytarabine conditioning for the treatment of relapsed or refractory acute myeloid leukemia (R/R AML). Adult participants with R/R AML will be eligible for treatment.  The study is intended to assess the candidate dose(s) by the occurrence of dose-limiting toxicity (DLT) from start of chemotherapy until 28 days after the first administration of SAR445419.  The duration of the study for a participant will include:  * Screening period up to 21 days prior to initiating chemotherapy, * Treatment period of 5 days chemotherapy followed by SAR445419 administered for 2 weeks and end of treatment visit 56 days after first SAR445419 administration, * Survival follow-up period up to 1 year after the last participant has started treatment with SAR445419.", "title": "A Phase I, Single-arm, Open Label, Dose Escalation, Multicenter Study of Off-the-shelf Natural Killer (NK) Cells (SAR445419) in Participants With Relapsed or Refractory Acute Myeloid Leukemia (R/R AML)", "url": "https://ClinicalTrials.gov/show/NCT05712278", "enrollment": "12", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05712278", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Incidence of dose-limiting (DLT) toxicity; from Day 1 to Day 28", "Incidence of DLT from start of chemotherapy; From Day -6 to Day 28", "Incidence of dose-limiting (DLT) toxicity; from Day 1 to Day 28", "Incidence of DLT from start of chemotherapy; From Day -6 to Day 28"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2023-06-16"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * patients with ph-positive chronic myeloid leukemia in the chronic phase before treatment and taking tyrosine kinase inhibitors of I and II generations (imatinib, nilotinib, bosutinib); * availability of informed consent of the patient to participate in the study.  Exclusion Criteria:  * history of acute cerebrovascular accident; * previous myocardial infarction in anamnesis; * the presence of diabetes mellitus type I and II; * the presence of chronic kidney disease C1-C5 stages; * the presence of coronary heart disease with its clinical manifestations (II-IV functional class); * the presence of hypertension III degree; * the presence of atherosclerotic lesions of peripheral arteries according to the color duplex sonography data of the arteries of the upper and lower extremities; * atrial fibrillation and flutter; * the presence of other oncological diseases; * inflammatory diseases in the acute stage; * the presence of mutations, in which the appointment of tyrosine kinase inhibitors of the I or II generation is not indicated (resistance to tyrosine kinase inhibitors drugs) * refusal of the patient from examination.", "description": "The study will study the state of the endothelium in patients with chronic myeloid leukemia during therapy with the II generation tyrosine kinase inhibitor bosutinib. Patients will be divided into groups receiving nilotinib 800mg/day, bosutinib 500mg/day, and imatinib 600mg/day. A comprehensive examination of patients will be carried out, including a clinical examination, a study of biochemical markers of endothelial damage and the functional state of the vascular wall. An algorithm will be developed for assessing the state of endothelial function in patients with ph-positive chronic myeloid leukemia in the chronic phase when using the second-generation tyrosine kinase inhibitor bosutinib.", "title": "Condition Vasoregulation Function Endothelium in Patients With Chronic Myeloid Leukemia (CML) Getting Tyrosine Kinase Inhibitor (TKI) II Generation Bosutinib", "url": "https://ClinicalTrials.gov/show/NCT05682924", "enrollment": "105", "max_age": "60.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05682924", "locations": ["Russian Federation"], "min_age": "40.0", "outcome_measures": ["Evaluation of type of microcirculation.; 3 months", "Evaluation of type of microcirculation.; 3 months"], "phases": ["NA"], "start_date": "2022-10-01", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  Patients with ALL (except for patients with B-ALL) who fulfil the following criteria:  * age at diagnosis ≤ 18 years. Age at HSCT ≤ 21 years * indication for allogeneic HSCT * complete remission (CR) before HSCT * written consent of the parents (legal guardian) and, if necessary, the minor patient via \"Informed Consent Form\" * no pregnancy * no secondary malignancy * no previous HSCT * HSCT is performed in a study participating centre  Exclusion Criteria:  * patients who do not fulfil the inclusion criteria * Non Hodgkin-Lymphoma * the whole protocol or essential parts are declined either by patient himself/herself or the respective legal guardian * no consent is given for saving and propagation of anonymous medical data for study reasons * severe concomitant disease that does not allow treatment according to the protocol at the investigator's discretion (e.g. malformation syndromes, cardiac malformations, metabolic disorders) * Karnofsky / Lansky score \\< 50% * subjects unwilling or unable to comply with the study procedures", "description": "The ALL SCTped 2012 FORUM is a multinational, multi-centre, controlled, prospective phase III study for the therapy and therapy optimisation for children and adolescents with ALL in complete morphological remission (CR, less than 5% bone marrow blasts, no blasts in cerebrospinal fluid, no other extramedullary leukemia), who have an indication for HSCT with a myeloablative conditioning regimen.  The stratification of patients in first and following remissions according to the individual transplantation modalities rests upon an indication for allogeneic HSCT and the availability of a suitable donor within the individual transplantation groups.", "title": "Allogeneic Stem Cell Transplantation for Children and Adolescents With Acute Lymphoblastic Leukaemia", "url": "https://ClinicalTrials.gov/show/NCT01949129", "enrollment": "1000", "max_age": "18.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT01949129", "locations": ["New Zealand", "Poland", "Denmark", "Austria", "Chile", "Australia", "Hungary", "Czechia", "France", "Turkey", "Argentina", "Mexico", "Sweden", "Slovakia", "Belgium", "Slovenia", "Switzerland", "Germany", "Canada", "Norway", "Finland", "Croatia", "Malaysia", "Greece", "Italy", "Romania", "Belarus", "Netherlands", "Spain", "Saudi Arabia", "Israel"], "outcome_measures": ["Overall Survival (OS) Stratum 1a (randomisation TBI+ chemo-conditioning vs. chemo-conditioning only); first: 18 months after inclusion of first patient, afterwards annually up to 10 years", "Event free survival (EFS) Stratum 2 (mismatched donor transplantation); first: 18 months after inclusion of first patient, afterwards annually up to 10 years", "Overall Survival (OS), Stratum 1b: MSD/MD without randomisation; first: 18 months after inclusion of first patient, afterwards annually up to 10 years", "Overall Survival (OS) Stratum 1a (randomisation TBI+ chemo-conditioning vs. chemo-conditioning only); first: 18 months after inclusion of first patient, afterwards annually up to 10 years", "Overall Survival (OS), Stratum 1b: MSD/MD without randomisation; first: 18 months after inclusion of first patient, afterwards annually up to 10 years", "Event free survival (EFS) Stratum 2 (mismatched donor transplantation); first: 18 months after inclusion of first patient, afterwards annually up to 10 years"], "min_age": "0.08333333333333333", "phases": ["PHASE2", "PHASE3"], "start_date": "2013-04", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Relapsed or refractory acute leukemia and has exhausted, or is ineligible for, available therapeutic options * Acute leukemia harboring histone-lysine N-methyltransferase 2A (KMT2A) or nucleophosmin 1 gene (NPM1) alterations * Pretreatment clinical laboratory values meeting the following criteria: (a) Hematology: white blood cell (WBC) count less than or equal to (\\<=) 30 \\* 10\\^9/liter (L) (hydroxyurea may be used to lower WBC count at screening and during study; (b) Chemistry: Aspartate aminotransferase (AST) and alanine aminotransferase (ALT) \\<=2.5 \\* upper limit of normal (ULN), total serum bilirubin \\<= 1.5 \\* ULN (participants with elevated bilirubinemia, such as Gilbert's syndrome, may enroll if conjugated bilirubin is within clinically acceptable range) and renal function; Estimated or measured glomerular filtration rate greater than or equal to (\\>=) 60 milliliter per minute (mL/min)/1.73 meter square (m\\^2) per four variable modified diet in renal disease (MDRD) equation * Eastern Cooperative Oncology Group (ECOG) performance status grade of 0, 1, or 2 * A woman of childbearing potential must have a negative highly sensitive serum beta-human chorionic gonadotropin at screening and within 48 hours prior to the first dose of study treatment * A male must agree to all the following during the study and for 90 days after the last dose of study treatment: A male must agree to all the following during the study and for 90 days after the last dose of study treatment: (a) wear a condom when engaging in any activity that allows for passage of ejaculate to another person; (b) not to donate sperm or freeze for future use for the purpose of reproduction. In addition, the participant should be advised of the benefit for a female partner to use a highly effective method of contraception as condom may break or leak  Exclusion Criteria:  * Acute promyelocytic leukemia according to World Health Organization (WHO) 2016 criteria * Active central nervous system (CNS) disease * Prior solid organ transplantation * QTc according to Fridericia's formula (QTcF) for males \\>= 450 millisecond (msec) or for females \\>= 470 msec. Participants with a family history of Long QT syndrome are excluded * Exclusion criteria related to stem cell transplant: a. Willing and able to undergo allogeneic stem cell transplant (if clinically indicated); b. Received prior treatment with allogenic bone marrow or stem cell transplant \\<=3 months before the first dose of study treatment; c. Has evidence of graft versus host disease; d. Received donor lymphocyte infusion \\<=1 month before the first dose of study treatment; e. Requires immunosuppressant therapy (exception: daily doses \\<=10 milligrams (mg) prednisone or equivalent are allowed for adrenal replacement) * Chemotherapy, targeted therapy, immunotherapy, or radiotherapy within 4 weeks or 5 half-lives (whichever is shorter) before the planned first dose of study treatment", "description": "The purpose of this study is to determine the recommended Phase 2 dose(s) (RP2D\\[s\\]) of JNJ-75276617 in Part 1 (Dose Escalation) and to determine safety and tolerability at the RP2D(s) in Part 2 (Dose Expansion).", "title": "A First in Human Study of the Menin-KMT2A (MLL1) Inhibitor JNJ-75276617 in Participants With Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04811560", "enrollment": "110", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04811560", "locations": ["France", "United States", "United Kingdom", "Australia", "Spain"], "min_age": "18.0", "outcome_measures": ["Number of Participants with Adverse Events (AEs) as a Measure of Safety and Tolerability; Up to 2 years and 10 months", "Number of Participants with AEs by Severity; Up to 2 years and 10 months", "Part 1: Percentage of Participants with Dose-Limiting Toxicity (DLT); Up to 28 days Cycle 1", "Number of Participants with AEs by Severity; Up to 2 years and 10 months", "Part 1: Percentage of Participants with Dose-Limiting Toxicity (DLT); Up to 28 days Cycle 1", "Number of Participants with Adverse Events (AEs) as a Measure of Safety and Tolerability; Up to 2 years and 10 months"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2021-05-19"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Documented diagnosis of     * MDS according to WHO/FAB classification that meets IRSS-R classification of low or intermediate risk disease; and a diagnosed as denovo or secondary MDS (MDS-RS eligible if refractory to or declined luspatercept therapy) OR    * Dysplastic (nonproliferative) CMML with WBC \\< 13.0/microL) 2. No disease-modifying therapy (HMA, hydrea) within 2 months of starting study 3. Age ≥ 18 years of age 4. ECOG ≤ 3 5. Negative for IDH2 mutation by NGS or multiplex PCR (SNaPshot) 6. Has symptomatic anemia defined as hemoglobin \\< 10.5 g/dL with any of the following.     * Tachypnea    * Shortness of breath    * Fatigue    * Malaise    * Worsening of cardiovascular function    * Asthenia    * Dyspnea on exertion    * Angina    * Other subject symptoms the subject reports as being associated with being anemic. 7. Stated willingness to comply with all study procedures and availability for the duration of the study 8. Ability to take oral medication and be willing to adhere to the medication regimen. 9. Females of reproductive potential need to either commit to true abstinence from heterosexual contact or agree to use, and be able to comply with highly effective contraception without interruption, 28 days prior to starting enasidenib, during the study therapy, and for 30 days after last dose of enasidenib 10. For males of reproductive potential: agreement to use of condoms 11. Adequate organ function defined as:      * Hepatic function: total bilirubin \\<1.5 x ULN (unless attributable to Gilbert's disease), AST or ALT \\< 3x ULN     * Renal function: creatinine clearance \\> 30 mL/minute, calculated by Cockcroft-Gault formula 12. Ability to understand and the willingness to sign the IRB approved informed consent document. 13. Women of childbearing potential must have negative urine or serum pregnancy test  Exclusion Criteria:  1. Use of concurrent other erythropoietic agents (including epoetin, darbepoetin), G-CSF within 30 days of study enrollment 2. Less than 3 months of life expectancy 3. Significant cardiac disease (NYHA Class IV congestive heart failure, or unstable angina or myocardial infarction within the last 6 months 4. Harbor IDH2 somatic mutations by NGS or PCR 5. Pregnant or breast feeding 6. Any uncontrolled bacterial, fungal, viral or other infection. 7. No known HIV+ or active hepatitis B or C infection, defined as positive viral load for HBV or HCV or a positive surface antigen (HBsAg) test for hepatitis B. 8. Have other causes of anemia: deficiencies in iron, B12, folate; nutritional deficiencies related to gastric surgery, anorexia nervosa, excessive zinc supplementation; gastrointestinal bleed. If nutritional deficiencies can be corrected, potential subject can be rescreened and enrolled if nutritionally replete and still meets eligibility criteria. 9. Any other medical history, including laboratory results, deemed by the Principal Investigator likely to interfere with their participation in the study, or to interfere with the interpretation of the results 10. Pregnant or breast feeding", "description": "This is a phase 1b/2, open-label, single arm study to evaluate if enasidenib is safe and effective in improving anemia and decreasing transfusion needs in subjects diagnosed with lower risk myelodysplastic syndrome (MDS) or nonproliferative chronic myelomonocytic leukemia (CMML) without a mutation in isocitrate dehydrogenase type 2 (IDH2 wildtype). Other objectives include assessment of improvements in platelet production and characterization of the mechanism of action of enasidenib in enhancing endogenous erythropoiesis.", "title": "A Phase Ib/II, Single Center, Open-Label, Safety and Efficacy Study to Improve Anemia in Subjects on Enasidenib With Lower Risk Myelodysplastic Syndrome and Non-proliferative Chronic Myelomonocytic Leukemia Without an IDH2 Mutation", "url": "https://ClinicalTrials.gov/show/NCT05282459", "enrollment": "48", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05282459", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Clinical Response: Hematological Improvement - Erythroid (HI-E); 16 weeks", "Related Adverse Events; 12 months", "Time to Hematological Improvement - Erythroid (HI-E); 16 weeks.", "Duration of Hematological Improvement - Erythroid (HI-E); 16 weeks.", "Clinical Response: Hematological Improvement - Platelets (HI-P); 8 weeks", "Clinical Response: Hematological Improvement - Neutrophils (HI-N); 8 weeks", "Red Blood Cell (RBC) transfusion independence (RBC TI); 12 months"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2022-01-12"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Patients aged ≥ 15 and ≤ 65 years. 2. Patients diagnosed with ALAL according to 5th edition of WHO Acute Leukaemias of Ambiguous Lineage diagnosis standard. 3. New diagnosed patients. 4. ECOG performance status score less than 3. 5. Expected survival time #3 months. 6. Patients without serious heart, lung, liver, or kidney disease. 7. Ability to understand and voluntarily provide informed consent.  Exclusion Criteria:  1. Patients who are allergic to the study drug or drugs with similar chemical structures. 2. Pregnant or lactating women, and women of childbearing age who do not want to practice effective methods of contraception. 3. Active infection. 4. Active bleeding. 5. Patients with new thrombosis, embolism, cerebral hemorrhage, or other diseases or a medical history within one year before enrollment. 6. Patients with mental disorders or other conditions whereby informed consent cannot be obtained and where the requirements of the study treatment and procedures cannot be met. 7. Liver function abnormalities (total bilirubin \\> 1.5 times the upper limit of the normal range, ALT/AST \\> 2.5 times the upper limit of the normal range or patients with liver involvement whose ALT/AST \\> 1.5 times the upper limit of the normal range), or renal anomalies (serum creatinine \\> 1.5 times the upper limit of the normal value). 8. Patients with a history of clinically significant QTc interval prolongation (male \\> 450 ms; female \\> 470 ms), ventricular heart tachycardia and atrial fibrillation, II-degree heart block, myocardial infarction attack within one year before enrollment, and congestive heart failure, and patients with coronary heart disease who have clinical symptoms and requiring drug treatment. 9. Surgery on the main organs within the past six weeks. 10. Drug abuse or long-term alcohol abuse that would affect the evaluation results. 11. Patients who have received organ transplants (excepting bone marrow transplantation). 12. Patients not suitable for the study according to the investigator's assessment.", "description": "The prognosis of acute leukaemias of ambiguous lineage is poor. The effect of chemotherapy regimen and hematopoietic stem cell transplantation are still unclear. Therefore, we will explore new therapy to improve the remission rate of acute leukaemias of ambiguous lineage. Venetoclax can significantly improve the remission rate and prolong PFS and OS. At present, venetoclax combined with azacitidine or decitabine has become the preferred treatment regimen for elderly AML patients. It also shows a high response rate in relapsed/refractory AML or MDS patients. There are few clinical studies on the treatment of ALAL. The purpose of this study is to explore the efficacy and safety of venetoclax combined with azacitidine in the treatment of newly diagnosed ALAL patients.", "title": "A Multicenter Prospective Clinical Study of Venetoclax Combined With Azactidine in the Treatment of Acute Leukaemias of Ambiguous Lineage", "url": "https://ClinicalTrials.gov/show/NCT05901974", "enrollment": "22", "max_age": "65.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05901974", "locations": ["China"], "min_age": "15.0", "outcome_measures": ["Overall Response Rate (ORR); At the end of Cycle 1 (each cycle is 28 days)", "Complete Remission Rate (CRR); At the end of Cycle 1 (each cycle is 28 days)", "Overall Response Rate (ORR); At the end of Cycle 1 (each cycle is 28 days)", "Complete Remission Rate (CRR); At the end of Cycle 1 (each cycle is 28 days)"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2021-07-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  - Participant must be at least 1 year old at the time the trial participant or legal guardian signs the informed consent form and will be assigned as follows:  * Adult arm: aged at least 12 years old. * Pediatric arm: aged 1 to 17 years old.  For participants of the Escalation Part only:  - Adult and Pediatric Arms: Confirmed diagnosis of primary or secondary AML \\[any subtype except acute promyelocytic leukemia (APL) and juvenile myelomonocytic leukemia (JMML)\\] according to World Health Organization (WHO) 2022 classification. Participants with AML must meet one of the following criteria, a), b), c) or d) and are limited to those with no available (or are ineligible) therapy with known clinical benefit.  a) Primary Induction Failure (PIF) AML, defined as disease refractory to one of the following, i or ii.  i) An intensive induction attempt, per institution. Induction attempts include high-dose and/or standard-dose cytarabine ± an anthracyclines/anthracenedione ± an anti-metabolite, with or without growth factor or targeted therapy containing regimens.  Examples include but are not limited to:  * One cycle of high dose cytarabine (HiDAC) containing regimen * One cycle of liposomal cytarabine and daunorubicin * Two cycles of standard dose cytarabine containing regimen  ii) For adults who are age 75 years or older, or who have comorbidities that preclude use of intensive induction chemotherapy; PIF is defined as AML refractory to one of the following less intensive regimens, 1 or 2: 1. 4 cycles of hypomethylating agents (HMA) or 2. 2 cycles HMA + venetoclax  b) Early relapse (ER) AML, defined as AML in relapse with CR duration \\< 6 months on prior induction treatment  c) Leukemia in first or higher relapse  d) For participants aged 1 to 17 years old, primary induction failure is defined as disease refractory after two cycles of induction therapy.  * Adult arm only: Confirmed diagnosis of cluster of differentiation 123 (CD123) + HR-MDS, with a Revised International Prognostic Scoring System (IPSS-R) risk category of intermediate or higher and are limited to those with no available (or are ineligible) therapy with known clinical benefit.    * Not eligible for induction therapy and having completed ≥2 cycles of any of the following: hypomethylating agent (eg, 5 azacitidine or decitabine) and/or venetoclax, chemotherapy, or targeted agents.   * Not eligible for autologous stem cell transplant (ASCT) and having completed ≥1 course of induction therapy. * Adult and Pediatric arms and escalation part only: Confirmed diagnosis of CD123+ B-ALL without extramedullary lesions that have no available (or are ineligible) therapy with known clinical benefit.  For Participants in the Expansion Part Only (Adults only):  * For participants in Cohort A: Participants meeting inclusion criteria for AML participants that have been primary refractory (PIF) to prior induction treatment or who have had ER occurring 6 months or less after an initial remission on prior induction treatment. * For participants in Cohort B: Participants meeting inclusion criteria for AML participants that have had late relapse (LR), occurring more than 6 months after an initial remission on prior induction treatment. * Body weight at least 10 kg. * Pediatric arm and escalation part only: Confirmed diagnosis of BPDCN according to World Health Organization (WHO) 2022 classification, who have relapsed or refractory disease with no available (or are ineligible) therapy with known clinical benefit. * Pediatric arm and expansion part only: For participants in Cohort C: Participants with AML who have relapsed according to inclusion criteria for AML or have recurrent disease resistant or intolerant to available therapies.  Exclusion Criteria:  * Eastern Cooperative Oncology Group (ECOG) performance status \\>2 (≥18 years-old). Karnovsky Scale (16-17 years-old) \\<50% or Lansky Scale (\\<16 years-old) \\<50%. * Ongoing or recent (within 5 years) evidence of significant autoimmune disease that requires or required treatment with systemic immunosuppressive treatments, which may suggest a risk for immune-related adverse events. The following are not exclusionary: vitiligo, childhood asthma that has resolved, residual hypothyroidism that required only hormone replacement or psoriasis that does not require systemic treatment. * History of an invasive malignancy that requires active therapy (adjuvant hormonal therapy is allowed) other than the one treated in this study, with the exception of resected/ablated basal or squamous-cell carcinoma of the skin or carcinoma in situ of the cervix, or other local tumors considered cured by local treatment. * Evidence of active central nervous system leukemia at the time of enrollment as evidenced by cytology or pathology. Except for participants aged 1 to 17 years, central nervous system 1 disease (CNS1) and CNS2 disease are allowed. * Known acquired immunodeficiency syndrome (AIDS-related illnesses) or human immunodeficiency virus (HIV) disease requiring antiretroviral treatment, or having active hepatitis B or C infection, or severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection. * Prior treatment with an anti-CD123-directed agent (except for participants with BPDCN in the pediatric arm). * Prior HSCT with relapse beyond 3 months or prior CAR-T therapy in B-ALL with relapse beyond 2 months may be included only if off immunosuppression for a minimum of 4 weeks and no evidence of graft-versus-host disease (GVHD). * Receiving at the time of first investigational medicinal product (IMP) administration corticosteroid as a concomitant medication with corticosteroid dose \\>10 mg/day of oral prednisone or the equivalent, * AML, BPDCN, or HR-MDS participants with prior treatment with cellular therapy, eg, chimeric antigen receptor T cell (CAR-T) or chimeric antigen receptor NK cell (CAR-NK). Prior CAR-T therapy is allowed for participants with B-ALL. * Concurrent treatment with other investigational drugs. * Radiotherapy, even if palliative in intent, may not be given during the study. * Prophylactic use of hematopoietic growth factors (eg, granulocyte-colony stimulating factor (G-CSF), granulocyte-macrophage colony-stimulating factor (GM-CSF), erythropoietin) during the DLT observation period in the Dose Escalation Part only. - Individuals accommodated in an institution because of regulatory or legal order; prisoners or participants who are legally institutionalized. * Pregnant and breast-feeding women. * History of solid organ transplant, including corneal transplant. * Average QTc (using the Fridericia correction calculation) greater than 470 milliseconds (msec) at screening. For pediatric arm participants only, inadequate ejection fraction as per institutional standards at screening or any clinically significant cardiac conditions (including but not limited to congestive heart failure, myocarditis, pericarditis, arrythmias). * Pediatric arm only: Participants with known inherited bone marrow failure syndromes (e.g., bloom syndrome, ataxia-telangiectasia, Fanconi anemia, Kostmann syndrome, Shwachman syndrome). Participants with Down syndrome with adequate organ function as per Investigator discretion are allowed to participate in the study.  The above information is not intended to contain all considerations relevant to a potential participation in a clinical trial.", "description": "This is an open-label, multicenter, Phase 1/Phase 2, dose escalation and dose expansion study to evaluate the safety, pharmacokinetics, pharmacodynamics and anti-leukemic activity of SAR443579 in various hematological malignancies.", "title": "An Open-label, First-in-human, Dose-escalation/Expansion Study of SAR443579 Administered as Single Agent by Intravenous Infusion in Adult and Pediatric Participants With Relapsed or Refractory Acute Myeloid Leukemia (R/R AML), B-cell Acute Lymphoblastic Leukemia (B-ALL), High Risk-myelodysplasia (HR-MDS), or Blastic Plasmacytoid Dendritic Cell Neoplasm (BPDCN)", "url": "https://ClinicalTrials.gov/show/NCT05086315", "enrollment": "126", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05086315", "locations": ["United States", "Australia", "France", "Netherlands"], "min_age": "1.0", "outcome_measures": ["Incidence of dose-limiting toxicity (DLT) (Escalation Part); Day 1 to Day 28", "Proportion of participants who have a CR (Complete Remission) + CRi (Complete Remission with Incomplete Hematological Recovery) (Expansion Part); Up to 6 months", "Proportion of participants who have a CR (Complete Remission) + CRi (Complete Remission with Incomplete Hematological Recovery) (Expansion Part); Up to 6 months", "Incidence of dose-limiting toxicity (DLT) (Escalation Part); Day 1 to Day 28"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2021-12-08"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient with a diagnosis of acute myeloblastic leukemia. * Patient going on intensive induction chemotherapy (causing a \"high risk\" situation of severe infection defined as profound neutropenia ( Polymorphonuclear neutrophil count \\<500/mm3) and lasting (\\>7 days). * Patients who have had a PICCline placed within the last 24 hours or who require a PICCline placement as part of their hospitalization under optimal hygiene and asepsis conditions. * Patient housed in a protected environment (flow chamber or Plasmair®). * Patient who has given free and informed consent. * Patient affiliated or beneficiary of a health insurance plan. * Adult patient (≥18 years old).  Exclusion Criteria:  * Patient with PICCline placed during a previous hospitalization. * Patient in an exclusion period determined by another study. * Patient under court protection, guardianship or curatorship. * Patient unable to give consent. * Patient for whom it is impossible to give informed information.", "description": "Peripherally Inserted Central Catheters have been widely used for many years for the administration of chemotherapy to patients with cancer. However, its use entails significant infectious complications and high risks of death.The hypothesis is that increasing the rate of PICCline dressing changes will reduce the occurrence of catheter-related infections.", "title": "Study of the Impact of Frequency of Changing PICCline Dressings in Patients With Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05793801", "enrollment": "60", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05793801", "locations": ["France"], "min_age": "18.0", "outcome_measures": ["Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 1+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 9+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 17+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 25+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 32+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 39+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 46+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 53+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 60+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 1+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 3+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 5+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 7+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 9+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 11+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 13+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 15+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 17+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 19+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 21+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 23+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 25+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 27+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 29+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 31+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 33+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 35+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 37+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 39+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 41+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 43+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 45+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 47+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 49+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 51+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 53+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 55+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 57+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 59+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 33+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 25+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 9+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 21+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 3+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 31+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 23+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 1+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 25+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 60+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 53+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 29+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 39+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 15+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 19+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 53+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 37+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 13+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 17+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 43+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 35+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 39+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 55+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 17+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 57+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 27+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 49+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 51+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 1+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 7+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 5+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 41+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 11+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 59+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 45+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 46+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in the experimental group; Day 47+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 32+48 hours", "Rate of local and/or systemic occurrence of infection on the PICCline in controls; Day 9+48 hours"], "phases": ["NA"], "status": "RECRUITING", "start_date": "2023-06-06"}
{"study_results": "False", "gender": "ALL", "criteria": "• Inclusion Criteria:  Adolescent (12 to 18 years), and young adult (19 to 40 years) patients who have relapse or refractory T-cell lymphoblastic leukemia (T-ALL) or T-Cell lymphoblastic lymphoma (T-LBL) according to 2017 WHO classification \\[29\\] and NCCN v1 2021 \\[30\\]:  Patients must have ≥ 5% blasts in the bone marrow as assessed by morphology on standard bone marrow biopsy and aspirate or less than 5% blasts in the bone marrow in presence of extramedullary relapse, excluding isolated central nervous system (CNS) relapse. However, if an adequate bone marrow sample cannot be obtained, patients may be enrolled if there is unequivocal evidence of leukemia with ≥ 5% blasts in the peripheral blood.  Patients are eligible independently of Notch pathway activation in the leukemic blasts: However, a fresh marrow/blood sample must be obtained before starting the study treatment to classify the patients as being either Notch positive or negative.  Leukemic blasts must express of at least 2 of the following immune phenotyping: CD1a, CD2, CD3, CD4, CD5, CD7, CD8, CD34, TCRαβ, TCRγδ, cyCD3  Patients have adequate performance status (ECOG ≤2) for patients ≥16 years old, Lansky score \\>50 for patients \\<16 years old. Patients have a life expectancy of at least 4 months. Patients must be 12 to 40 years of age inclusive when signing the informed consent.  Patients with asymptomatic CNS disease are eligible  • Exclusion Criteria:  Mixed phenotype leukemia (excluding T-ALL with myeloid antigen expression)  History of another primary invasive malignancy that has not been definitively treated and in remission. Patients with non-melanoma skin cancers or with carcinomas in situ are eligible regardless of the time from diagnosis (including concomitant diagnoses).  Presence of clinically significant uncontrolled CNS pathology such as epilepsy, childhood seizure, paresis, aphasia, stroke, severe brain injuries, organic brain syndrome, or psychosis.  Evidence of active cerebral/meningeal disease. Patients may have history of CNS leukemic involvement if definitively treated with prior therapy and no evidence of active disease at the time of consent (see inclusion criterion 3.1.7.).  Patients with a cardiac ejection fraction (as measured by either MUGA or echocardiogram) \\< 50% or with a history of absolute decrease in LVEF of ≥ 15 absolute percentage points are excluded.  Patients with uncontrolled, active infections (viral, bacterial, or fungal). Infections controlled on concurrent anti-microbial agents are acceptable, and anti-microbial prophylaxis per institutional guidelines are acceptable.  Known active hepatitis B or C infection or known seropositivity for HIV.  Liver cirrhosis or other active severe liver disease or with suspected active alcohol abuse.  Patients with impairment of GI function or GI disease presence that significantly alter the absorption of CB-103 (e.g., ulcerative diseases, uncontrolled nausea, vomiting, diarrhea, malabsorption syndrome, or small bowel resection).  Females who are pregnant or lactating.", "description": "To learn if the combination of 2 study drugs, CB-103 and venetoclax, can help to control T-cell acute lymphoblastic leukemia (T-ALL) or T-cell lymphoblastic leukemia (T-LBL) in adolescent and young adult patients", "title": "A Phase II Study to Evaluate Safety and Efficacy of CB-103 in Combination With Venetoclax in Adolescent and Young Adult Patients With Relapsed/Refractory T-cell Acute Lymphoblastic Leukemia (T-ALL)", "url": "https://ClinicalTrials.gov/show/NCT05464836", "enrollment": "30", "max_age": "40.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05464836", "locations": ["United States"], "min_age": "12.0", "outcome_measures": ["The safety and tolerability of CB-103 in combination with Venetoclax in adolescent and young adult patients with relapsed/refractory T-cell acute lymphoblastic leukemia (T-ALL) and T-cell lymphoblastic lymphoma (T-LBL) .; through completion of study or average of 1 year", "The efficacy of CB-103 in combination with venetoclax will be determined by studying the overall response rate (ORR) of the participants; through completion of study or average of 1 year"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2023-04-06"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Relapsed or refractory B cell Leukemia. 2. KPS\\>60. 3. Life expectancy\\>3 months. 4. Gender unlimited, age from 2 years to 70 years. 5. CD19 expression must be detected on greater than 15% of the malignant cells by immunohistochemistry or greater than 30% by flow cytometry. 6. Patients who have failed at least one line of a standard treatment. 7. No serious mental disorder. 8. Patients must have adequate cardiac function(no cardiac disease, LVEF≥40% ), adequate pulmonary function as indicated by room air oxygen saturation of \\>94%, and adequate renal function(Cr≤133umol/L). 9. No other serious diseases(autoimmune disease, immunodeficiency etc.). 10. No other tumors. 11. Patients volunteer to participate in the research. 12. Patients with history of allogeneic stem cell transplantation are eligible if at least 100 days post-transplant, if there is no evidence of active GVHD and no longer taking immunosuppressive agents for at least 30 days prior to trial  Exclusion Criteria:  1. KPS\\<50. 2. Patients are allergic to cytokines. 3. Uncontrolled active infection. 4. Acute or chronic GVHD. 5. Treated with T cell inhibitor. 6. Pregnancy and nursing females. 7. HIV/HBV/HCV Infection. 8. Other situations we think improper for the research.", "description": "This study aims to evaluate the safety, efficacy and duration of response of CD19 Chimeric Antigen Receptor (CAR) redirected autologous T-cells in patients with high risk, relapsed CD19+ haematological malignancies.", "title": "Phase I Study of T Cells Expressing an Anti-CD19 Chimeric Receptor in Children and Young Adults With B Cell Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04100187", "enrollment": "100", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04100187", "locations": [""], "min_age": "2.0", "outcome_measures": ["Adverse events of each patient; 3 years", "Survival time of Anti-CD19 CAR T cells in vivo; 3 years", "Antitumor Effects; Every 3 months post treatment up to 24 months", "Maximum tolerated dose (MTD) of CD19 targeted CAR T cells.; 4 weeks"], "phases": ["PHASE1"], "status": "NOT_YET_RECRUITING", "start_date": "2023-02-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. An underlying hematological malignancy including:     a) relapse of AML after allogeneic hematopoietic stem cell transplantation; b) relapse of ALL after allogeneic hematopoietic stem cell transplantation; c) relapse of JMML after allogeneic hematopoietic stem cell transplantation; e) refractory ALL; f) refractory AML; g) high risk infant ALL; 2. be ≥ 0.5 year old and ≤ 18 years old; 3. must not be eligible for therapy of higher curative potential. Where an alternative therapy has been shown to prolong survival in an analogous population, this should be offered to the patient prior to discussing this study; 4. have a Karnofsky Performance Status ≥ 50 or Lansky Performance Status ≥ 30; 5. provide signed, written informed consent from parent or guardian; 6. be able to comply with study procedures and follow-up examinations; 7. have adequate cardiac function (irrespective of concomitant cardio-vascular treatment) at PI/CI discretion; 8. have adequate organ function (as indicated by Table 5) within 30 days prior to 111In infusion; 9. patients who have received any other chemotherapy within the previous 2 weeks and must have recovered from acute toxicity of all previous therapy prior to enrolment; 10. be negative for human-anti-murine antibodies (HAMA).  Exclusion Criteria:  1. patients who are positive for human anti-murine antibodies (HAMA); 2. patients with compromised organ function within 30 days prior to 111In infusion; 3. patients with isolated CNS disease relapse\\*; 4. patients with an active, uncontrolled systemic infection considered opportunistic, life threatening, or clinically significant at the time of treatment; 5. Pregnant or breast-feeding females are excluded due to potential risks of foetal adverse events of an investigational agent. Pregnancy tests must be obtained prior to enrolment on this study for girls of reproductive potential. The need to commence pregnancy testing will be at the discretion of the treating physician to facilitate taking in to account factors such as precocious puberty, endocrine status and medications which can affect pubertal status. Males or females of reproductive potential may not participate unless they have agreed to use an effective contraceptive method. Sexual Abstinence is an acceptable method of birth control\\*\\*. 6. patients with any other severe concurrent disease, which, in the judgment of the Investigator, would make the patient inappropriate for entry into this study; 7. patients with extensive chronic graft versus host disease (GVHD); 8. patients with unstable cardio-vascular disease. -", "description": "Children affected by high risk or relapsed/refractory leukaemia have a poor prognosis, with an increased risk of relapse. These patients generally need treatment intensification and a bone marrow transplantation (BMT).  Nevertheless, with conventional treatent the risk of relapse after transplant remains high.  Radioimmunotherapy provides a way to deliver high dose irradiation to the bone marrow (where leukaemia resides), while sparing normal organs and tissues from its toxicity.This can be achieved by linking a radioactive molecule (Yttrium90) to an antibody that, once infused in the blood, targets marrow/leukemic cells.", "title": "90Yttrium-labelled Anti-CD66 Monoclonal Antibody as Part of a Reduced Toxicity Conditioning Regimen Prior to Allogeneic Haematopoietic Stem Cell Transplantation: an Open Label, Phase II Study in Children and Adolescents With High Risk Leukaemia", "url": "https://ClinicalTrials.gov/show/NCT04856215", "enrollment": "25", "max_age": "18.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04856215", "locations": ["United Kingdom"], "min_age": "0.5", "outcome_measures": ["Disease response after [90Y]-labelled anti-CD66 monoclonal antibody; through study completion, upto 2 years post study", "Disease response after [90Y]-labelled anti-CD66 monoclonal antibody; through study completion, upto 2 years post study"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2023-09-29"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Established diagnosis of Ph-positive leukemia  Exclusion Criteria:  * no", "description": "The main task of this study includes analyses of the BCR-ABL1 (breakpoint cluster region/Abelson) gene and mutations in the BCR-ABL1 tyrosine kinase domain within flow-sorted stem cells from the bone marrow and/or peripheral blood specimens. To assess the germline configuration of the patient, DNA from fingernail clippings will be investigated.", "title": "Identification of Pre-existing Kinase Domain Mutations in Subclones of Ph-positive Leukemias", "url": "https://ClinicalTrials.gov/show/NCT02643888", "enrollment": "30", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT02643888", "locations": ["Austria"], "min_age": 0, "outcome_measures": ["Leukemic stem/progenitor cells defined by a specific marker profile will be isolated from BM/PB by flow sorting. Screening for and monitoring of BCR-ABL1 TKD mutant subclones at the cDNA/DNA levels within the 1st year of TKI therapy will be done by NGS.; 3 years"], "phases": ["NA"], "start_date": "2016-12", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion criteria:  1. Total body weight of ≥40 kg. 2. Must have pathologically confirmed relapsed or refractory acute myeloid leukemia (R/R AML) including:     1. Relapsed AML is defined as ≥5% blasts in the bone marrow (BM) or peripheral blood at any time after achieving a CR, CRh, Cri, or MLFS.    2. Refractory AML is defined as failure to achieve a CR, CRh, Cri, or MLFS after 1 of the following regimens:     i. Two courses of intensive induction chemotherapy. ii. At least 2 cycles of hypomethylating agent (HMA) or low-dose, cytarabine-based combination regimen.     iii. At least 4 cycles of HMA monotherapy. 3. During dose escalation, participants must be ineligible for hematopoietic stem cell transplantation (HSCT). 4. Must have an anticipated life expectancy of \\>3 months before lymphodepletion. 5. Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 1. 6. Participants must have adequate renal, cardiac, hepatic, pulmonary and bone marrow function as defined by the protocol.  Exclusion criteria:  1. Diagnosis of acute promyelocytic leukemia. 2. Has received or plans to receive any of the excluded therapy/treatment within the specified timeframe before lymphodepleting chemotherapy as defined by the protocol. 3. Prior allogeneic HSCT within 3 months of signing informed consent form (ICF) or with ongoing requirement for systemic graft-versus-host therapy. 4. Active central nervous system (CNS) involvement. 5. History of malignancy other than non-melanoma skin cancer or carcinoma in situ (eg. cervix, bladder, breast) low grade prostate cancer without treatment requirement unless in remission without treatment for ≥2 years.", "description": "GDX012 is a novel cell therapy developed for the treatment of certain types of cancer, including Acute Myeloid Leukemia (AML). The main aims of the study are to learn how safe GDX012 is, how treatment with GDX012 is tolerated and to determine the best dose of GDX012.", "title": "A Phase 1/2a, Open-Label, Dose Escalation, and Dose Expansion Study to Assess the Safety and Efficacy of GDX012 in Patients With Relapsed or Refractory Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05886491", "enrollment": "53", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05886491", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Number of Participants With Dose Limiting Toxicities (DLTs); Up to 1 month", "Maximum Tolerated Dose (MTD) of GDX012; Up to 1 month", "Number of Participants With Adverse Events (AEs); Up to 14 months", "Maximum Tolerated Dose (MTD) of GDX012; Up to 1 month", "Number of Participants With Adverse Events (AEs); Up to 14 months", "Number of Participants With Dose Limiting Toxicities (DLTs); Up to 1 month"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2023-07-11"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Patients with a diagnosis of previously untreated CLL/SLL meeting iwCLL 2018 indication for treatment (cohort 1) or with a diagnosis of previously untreated or relapsed/refractory RT arising from CLL (cohort 2). Previously untreated patients with RT must have received prior therapy for CLL. 2. At least 18 years of age 3. Eastern Cooperative Oncology Group (ECOG) Performance status of 0-2 4. Adequate hepatic function     1. Total bilirubin ≤1.5 x upper limit of normal (ULN) or ≤3 x ULN for patients with Gilbert's disease or documented disease involvement of liver (In pts with elevated total bilirubin due to increased indirect bilirubin, pts with direct bilirubin ≤1.5 x ULN are eligible)    2. ALT and AST ≤3.0 x ULN, or ≤5.0 x ULN if documented disease involvement of liver 5. Adequate renal function     a. Creatinine clearance ≥ 50 ml/min (calculated using CKD-EPI formula) 6. Adequate hematologic function     1. Platelet count ≥50 x109/L and hemoglobin ≥ 8 g/dL (≥ 80 g/L). Platelet and hemoglobin requirements are independent of transfusions within 7 days of screening assessment and first dose of study drugs.    2. Absolute neutrophil count ≥ 0.75 x 109/L. Absolute neutrophil count is independent of growth factor support within 7 days of screening assessment and first dose of study drugs. 7. Ability to swallow tablets and comply with outpatient treatment, laboratory monitoring, and required clinic visit for the duration of study participation 8. Women of childbearing potential must have a negative serum or urine beta human chorionic gonadotropin (β-hCG) pregnancy test result within 7 days prior to the first dose of study drugs and must agree to use an effective contraception method during the study and for 6 months following the last dose of study drug. Women of non-childbearing potential are those who are postmenopausal greater than 2 year or who have had a bilateral tubal ligation or hysterectomy. Men who have partners of childbearing potential must agree to use an effective contraceptive method during the study and for 6 months following the last dose of study drug  Exclusion Criteria:  1. Major surgery within 4 weeks prior to the first dose of study drugs 2. Uncontrolled active systemic infection 3. Known positive serology for human immunodeficiency virus (HIV) 4. Active hepatitis B infection (defined as the presence of detectable HBV DNA, HBe antigen or HBs antigen). Patients with serologic evidence of prior vaccination (HBsAg negative, anti-HBs antibody positive, anti-HBc antibody negative) are eligible. Patients who are HBsAg negative/HBsAb positive but HBcAb positive are eligible, provided HBV DNA is negative and they are willing to take appropriate anti-viral prophylaxis 5. Active hepatitis C infection (defined as detectable hepatitis C RNA in plasma by PCR) 6. Known active cytomegalovirus (CMV) infection. Unknown or negative status are eligible 7. Active, uncontrolled autoimmune phenomenon (autoimmune hemolytic anemia or immune thrombocytopenia) requiring steroid therapy with \\> 20 mg daily of prednisone or equivalent or for which new therapy was introduced or existing therapy was escalated within the 4 weeks prior to study enrollment to maintain adequate blood counts 8. Clinically significant, uncontrolled cardiovascular disease (≥3 NYHA heart failure, uncontrolled or symptomatic arrythmias), or myocardial infarction within 6 months, or stroke within 6 months, or intracranial bleeding within 6 months prior to start of study drugs 9. Prolongation of the QT interval corrected for heart rate (QTcF) \\> 470 msec. Note: Patients with QTcF \\> 470 msec should have EKG repeated. If QTcF again is \\> 470 msec, then the patient should be referred to cardiology for evaluation. Patient can be enrolled later if cleared by cardiology and repeat QTcF less than 470 msec. QTcF is calculated using Fridericia's Formula (QTcF): QTcF = QT/(RR0.33)     1. Correction of suspected drug-induced QTcF prolongation can be attempted at the investigator's discretion and only if clinically safe to do so with either discontinuation of the offending drug or switch to another drug not known to be associated with QTcF prolongation.    2. Correction for underlying bundle branch block (BBB) allowed. Note: Patients with pacemakers are eligible if they have no history of fainting or clinically relevant arrhythmias while using the pacemaker 10. Pregnancy, lactation or plan to breastfeed during the study or within 6 months of the last dose of study treatment 11. Concurrent use of warfarin or another vitamin K antagonist 12. Current treatment with strong cytochrome P450 3A4 (CYP3A4) inhibitors or inducers. A washout period of at least 5 half-lives of these agents following discontinuation and prior to study entry is required (treatment with moderate CYP3A4 inhibitors or inducers is not excluded)      a. Because of their effect on CYP3A4, use of any of the following within 7 days of study therapy start or planned use during study participation is prohibited i. Grapefruit or grapefruit products ii. Seville oranges or products from Seville oranges iii. Star fruit 13. Current treatment with the following P-gp inhibitors: amiodarone, clarithromycin, cyclosporine, erythromycin, ketoconazole, and verapamil. A washout period of at least 5 half-lives of the inhibitor before study entry is required. 14. Known central nervous system involvement by CLL/SLL/RT 15. Active second malignancy unless in remission and with life expectancy \\> 2 years with exception of patients diagnosed with basal cell or squamous cell carcinoma of the skin or carcinoma \"in situ\" of the cervix or breast who are eligible even if diagnosed within 2 years. If patients have another malignancy that was treated within the last 2 years, such patients may be enrolled, if the likelihood of requiring systemic therapy for this other malignancy within 2 years is less than 10%, as determined by an expert in that particular malignancy at MD Anderson Cancer Center, and after consultation with the Principal Investigator. 16. Prior therapy restrictions      a. Cohort 1 (CLL/SLL) i. Prior receipt of anti-CD20 monoclonal antibody therapy for non-malignant indication, including for autoimmune phenomenon ii. Prior receipt of systemic therapy for CLL/SLL b. Cohort 2 (RT) i. Patients who experienced a major bleeding event or grade ≥3 arrythmia on prior treatment with a BTK inhibitor ii. History of allogeneic or autologous stem cell transplant (SCT) or chimeric antigen receptor-modified T cell (CAR-T) therapy within 60 days of first dose of study drugs or presence of any of the following, regardless of prior SCT and/or CAR-T therapy timing: 1. Active graft versus host disease (GVHD), 2. Cytopenia from incomplete blood cell count recovery post-transplant, 3. Need for anti-cytokine therapy for toxicity from CAR-T therapy or residual symptoms of neurotoxicity \\> Grade 1 from CAR-T therapy, 4. Ongoing immunosuppressive therapy (\\> 20 mg prednisone or equivalent daily) including GVHD prophylaxis/treatment (calcineurin inhibitors or ruxolitinib) iii. Patients are required to have the following washout periods prior to planned Cycle 1 Day 1 (C1D1). In addition, prior treatment-related AEs must have recovered to Grade ≤ 1 with the exception of alopecia and Grade 2 peripheral neuropathy. 1. Targeted agents, investigational agents, therapeutic monoclonal antibodies or cytotoxic chemotherapy: 5 half-lives or 2 weeks, whichever is shorter     1. Immunoconjugated antibody treatment within 10 weeks prior to randomization     2. Broad field radiation (≥ 30% of the bone marrow or whole brain radiotherapy) must be completed 14 days prior to study enrollment     3. Palliative limited field radiation must be completed 7 days prior to study enrollment.      iv. Prior therapy with venetoclax and obinutuzumab is allowed but Richter should not have developed while actively receiving venetoclax or obinutuzumab (active therapy implies having received venetoclax or obinutuzumab within the prior 3 months) 17. Known hypersensitivity to any component or excipient of study drugs 18. Malabsorption syndrome or other condition likely to affect gastrointestinal absorption of the study drugs 19. Receipt of live-virus vaccines within 4 weeks prior to starting study drugs 20. History of bleeding diathesis", "description": "To learn if the combination of pirtobrutinib (also called LOXO-305), venetoclax, and obinutuzumab is safe and effective when given to patients with chronic lymphocytic leukemia (CLL) or Richter transformation (RT) who have not previously received treatment.", "title": "Time-limited Triplet Combination of Pirtobrutinib, Venetoclax, and Obinutuzumab for Patients With Treatment-naïve Chronic Lymphocytic Leukemia (CLL) or Richter Transformation (RT)", "url": "https://ClinicalTrials.gov/show/NCT05536349", "enrollment": "60", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05536349", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["The severity of the adverse events (AEs) will be graded according to the U.S. Department of Health and Human Services, National Institutes of Health, National Cancer Institute, Common Terminology Criteria for Adverse Events (CTCAE), Version 5.0.; through study completion an average of 1 year."], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2022-12-20"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Signed written informed consent; 2. Diagnose as relapsed /refractory acute myeloid leukemia, and meet one of the following conditions:     1. Failed to standard chemotherapy regimens;    2. Relapse after complete remission, high-risk and / or refractory patients ;    3. Relapse after hematopoietic stem cell transplantation; 3. Evidence for cell membrane CD123 expression; 4. All genders, ages: 3 to 75 years； 5. The expect time of survive is above 12 weeks; 6. KPS\\>60； 7. No serious mental disorders ; 8. Left ventricular ejection fraction ≥50% 9. Sufficient hepatic function defined by ALT/AST≤3 x ULN and bilirubin≤2 x ULN; 10. Sufficient renal function defined by creatinine clearance≤2 x ULN; 11. Sufficient pulmonary function defined by indoor oxygen saturation≥92%; 12. With single or venous blood collection standards, and no other cell collection contraindications; 13. Ability and willingness to adhere to the study visit schedule and all protocol requirements.  Exclusion Criteria:  1. Have received CAR-T therapy or other genetically modified cell therapy before screening； 2. Participated in other clinical research within 1 month before screening； 3. Have received the following anti-tumor treatment before screening: Have received chemotherapy, targeted therapy or other experimental drug treatment within 4 weeks, except those who have confirmed disease progression after treatment; 4. Live attenuated vaccine within 4 weeks before screening; 5. Convulsion or stoke within past 6 months; 6. Previous history of other malignancy; 7. Presence of uncontrolled active infection; 8. Subjects with positive HBsAg or HBcAb positive and peripheral blood HBV DNA titer is higher than the lower limit of detection of the research institution; HCV antibody positive and peripheral blood HCV RNA titer is higher than the lower limit of detection of the research institution; HIV antibody positive; syphilis primary screening antibody positive; 9. Pregnant or breasting-feeding women; 10. Any situation that investigators regard not suitable for attending in this study or may affect the data analysis.", "description": "This is a single arm study to evaluate the efficacy and safety of CD123-targeted CAR-T cells therapy for patients with relapsed/refractory Acute Myeloid Leukemia.", "title": "Safety and Efficacy of CD123-Targeted CAR-T Therapy for Relapsed/Refractory Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04272125", "enrollment": "40", "max_age": "75.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04272125", "locations": ["China"], "min_age": "3.0", "outcome_measures": ["Adverse events that related to treatment; 2 years", "The response rate of CD123 CAR-T treatment in patients with relapse/refractory Acute Myeloid Leukemia that treatment by CD123 CAR-T cells therapy; 6 months", "Adverse events that related to treatment; 2 years", "The response rate of CD123 CAR-T treatment in patients with relapse/refractory Acute Myeloid Leukemia that treatment by CD123 CAR-T cells therapy; 6 months"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2019-12-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Relapsed or refractory B-ALL, defined as：1）Not chieving a CR after 1 cycle of standard chemotherapy for relapsed leukemia. 2）Any relapse after HSCT and must be ≥ 6 months from HSCT at the time of IM19 CAR-T cells infusion. 3）Primary refractory as defined by not achieving a CR after 2 cycles of a standard chemotherapy regimen. * Patients with Ph+ ALL are eligible if they are intolerant to or have failed two lines of TKI ± chemotherapy ；Ph + all patients with T315I mutation are not required to receive at least two TKI ± chemotherapy in the absence of effective TKI therapy. * Morphological evidence of disease in bone marrow (at least 5% blasts). * Aged 3 to 70 years. * Estimated life expectancy \\>3 months. * ECOG performance status of 0 or 1(age ≥ 16 years) or Lansky (age \\< 16 years). * Women of childbearing age who had a negative blood pregnancy test before the start of the trial and agreed to take effective contraceptive measures during the trial period until the last follow-up; male subjects with fertility partners agreed to take effective contraceptive measures during the trial period until the last follow-up. * Adequate organ function. * Volunteer to participate in this trial and sign on the informed consent.  Exclusion Criteria:  * Subjects with lsolated extramedullary disease relapse. * Subjects with Burkitt's lymphoma. * Subjects has obvious symptoms of central nervous system invasion and needs targeted treatment. * Subjects has previously received gene product therapy. * Subjects has graft-versus-host response（GVHD） and need to use immunosuppressants or GVHD ≥ grade 2 or being treated with anti GVHD or suffering from autoimmune diseases. * Subjects has received chemotherapy or radiotherapy within 3 days before leukapheresis. * Subjects received systemic steroids within 5 days prior to leukapheresis. * Subjects received drugs that stimulated the production of hematopoietic cells in the bone marrow for 5 days prior to leucapheresis. * Subjects has participated in other clinical studies within 1 month before screening or plan to participate in other drug clinical trials during this study. * Subjects received allogeneic cell therapy within 6 weeks before leukapheresis. * Subjects with History or presence of CNS disorder. * Subjects with HBV, HCV, HIV ,EBV,ECV or syphilis infection at the time of screening. * Pregnant or lactating, or planning pregnancy within 180 days after the end of CAR-T cells infusion, or male patients whose partners plan pregnancy 180 days after their CAR-T cell infusion. * Subjects with other tumors in the past 5 years. * Within 14 days before enrollment, there were active or uncontrollable infections requiring systemic treatment.", "description": "This is a open-label to assess the efficacy and safety of IM19 CAR-T cells in R/R B-cell Acute Lymphoblastic Leukemia.", "title": "Clinical Trial to Evaluate the Safety and Efficacy of IM19 CAR-T Cells in Patients With Relapsed and Refractory (R/R) B-cell Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05480501", "enrollment": "9", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05480501", "locations": ["China"], "min_age": "3.0", "outcome_measures": ["Incidence of adverse events (AEs); Up to 28 days after CAR-T cell infusion", "Persistence of CAR-T cells (cell counts and cell percentage in peripheral blood and bone marrow ); Up to 24 weeks after CAR-T cell infusion", "Incidence of adverse events (AEs); Up to 28 days after CAR-T cell infusion", "Persistence of CAR-T cells (cell counts and cell percentage in peripheral blood and bone marrow ); Up to 24 weeks after CAR-T cell infusion"], "phases": ["EARLY_PHASE1"], "status": "RECRUITING", "start_date": "2022-07-11"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion criteria:  Any patient with acute myeloid leukemia (AML) or Myelodisplastic Syndrome (MDS) with:  1. a first- or second-degree relative with Acute leukemia or MDS or other myeloid malignancies 2. a first- or second-degree relative with Lymphoproliferative neoplasms 3. or with clinical features that resemble one of the familial MDS/AML predisposition syndromes:     * History of thrombocytopenia and/or a clinical bleeding propensity (as in RUNX1, ANKRD26 or ETV6 germline mutations)    * Abnormal nails or skin pigmentation, oral leukoplakia, idiopathic pulmonary fibrosis, unexplained liver disease (as in TERT and TERC germline mutations)    * Lymphedema, atypical infections, immune deficiencies (as in GATA2 germline mutations)  Exclusion Criteria:  1. any diagnosis other than acute myeloid leukemia (AML) or Myelodisplastic Syndrome (MDS); 2. acute myeloid leukemia (AML) or Myelodisplastic Syndrome (MDS) without a first- or second-degree relative with Acute leukemia or MDS or other myeloid malignancies or without a first- or second-degree relative with Lymphoproliferative neoplasms or with clinical features that resemble one of the familial MDS/AML predisposition syndromes; 3. unability to sign the informed consent", "description": "The aim of this study is to look for predisposing mutations in patients and relatives affected by AML and MDS with familial history of myeloid or, less frequently, lymphoid malignancies. Taking advantage of a next generation sequencing (NGS) platform, screening for known and unknown mutations potentially associated with the disease will be done. The screening will be performed on affected and unaffected family members, in order to outline new pedigrees that either validate previous findings or constitute novel discoveries.", "title": "Next Generation Sequencing (NGS) Approach to Study Known and New Germline Mutations in Familial Acute Myeloid Leukemia and Myelodisplastic Syndromes", "url": "https://ClinicalTrials.gov/show/NCT03058588", "enrollment": "20", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT03058588", "locations": ["Italy"], "min_age": 0, "outcome_measures": ["Discovery of predisposing mutations; After enrollment of the first 10 cases (an avarage of 2 years)"], "phases": ["NA"], "start_date": "2017-02-09", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Relapsed or refractory B-ALL, defined as:    1. Not chieving a CR after 1 cycle of standard chemotherapy for relapsed leukemia.   2. Any relapse after HSCT and must be ≥ 6 months from HSCT at the time of IM19 CAR-T cells infusion.   3. Primary refractory as defined by not achieving a CR after 2 cycles of a standard chemotherapy regimen. * Patients with Ph+ ALL are eligible if they are intolerant to or have failed two lines of TKI ± chemotherapy ；Ph + all patients with T315I mutation are not required to receive at least two TKI ± chemotherapy in the absence of effective TKI therapy; * Morphological evidence of disease in bone marrow (at least 5% blasts). * Aged 3 to 25 years, either sex; * Estimated life expectancy \\>3 months; * ECOG performance status of 0 or 1(age ≥ 16 years) or Lansky (age \\< 16 years) performance status ≥ 50; * Women of childbearing age who had a negative blood pregnancy test before the start of the trial and agreed to take effective contraceptive measures during the trial period until the last follow-up; male subjects with fertility partners agreed to take effective contraceptive measures during the trial period until the last follow-up; * Adequate organ function; * Volunteer to participate in this trial and sign on the informed consent.  Exclusion Criteria:  * Isolated extramedullary disease relapse； * Burkitt's lymphoma； * Patient has obvious symptoms of central nervous system invasion and needs targeted treatment; * Patient has previously received gene product therapy; * Patients have graft-versus-host response（GVHD） and need to use immunosuppressants; Or GVHD ≥ grade 2 or being treated with anti GVHD; Or suffering from autoimmune diseases; * Patient received chemotherapy or radiotherapy within 3 days before leukapheresis * Patient used systemic steroids within 5 days before leucapheresis, except those who were recently or currently using inhaled steroids; * Patients who used drugs to stimulate the production of bone marrow hematopoietic cells within 5 days before leucapheresis; * Patients have participated in other clinical studies within 1 month before screening or plan to participate in other drug clinical trials during this study; * Patient received allogeneic cell therapy within 6 weeks before CAR-T cell infusion, such as donor lymphocyte infusion(DLI)； * History or presence of CNS disorder, such as epilepsy, epileptic seizures, cerebrovascular disease (ischemia / hemorrhage / cerebral infarction), brain edema, reversible posterior white matter encephalopathy, paralysis, aphasia, stroke, severe brain injury, dementia, Parkinson's disease, cerebellar disease, cerebral organic syndrome or mental disease; * Patients has HBV, HCV, HIV ,EBV,ECV or syphilis infection at the time of screening; * Pregnant or lactating, or planning pregnancy within 180 days after the end of CAR-T cells infusion, or male patients whose partners plan pregnancy 180 days after their CAR-T cell infusion; * Patients with other tumors in the past 5 years; * Within 14 days before enrollment, there were active or uncontrollable infections requiring systemic treatment.", "description": "This is a phase I/II, open-label, multicenter study to assess the efficacy and safety of IM19 CAR-T cells in R/R B-cell Acute Lymphoblastic Leukemia", "title": "A Phase 1-2 Study to Evaluate the Safety and Efficacy of IM19 CAR-T Cells in Patients With Relapsed and Refractory (R/R) B-cell Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05309213", "enrollment": "58", "max_age": "25.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05309213", "locations": [""], "min_age": "3.0", "outcome_measures": ["Incidence of Treatment Related adverse events (AEs); Up to 28 days after CAR-T cell infusion", "Persistence of CAR-T cells (cell counts and cell percentage in peripheral blood and bone marrow); Up to 24 weeks after CAR-T cell infusion", "Persistence of CAR-T cells (cell counts and cell percentage in peripheral blood and bone marrow); Up to 24 weeks after CAR-T cell infusion", "Incidence of Treatment Related adverse events (AEs); Up to 28 days after CAR-T cell infusion"], "phases": ["PHASE1", "PHASE2"], "status": "NOT_YET_RECRUITING", "start_date": "2022-04-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Ages 1-39 years * Diagnosis of one of the following:    * Acute myeloid leukemia (AML)   * Acute undifferentiated leukemia (AUL)   * Mixed phenotype acute leukemia (MPAL)   * T-cell acute lymphoblastic leukemia (T ALL)   * Early thymocyte precursor (ETP) ALL   * KMT2A-rearranged ALL * Disease status    * Relapsed/Refractory AML, MPAL and AUL   * Relapsed/Refractory KMT2A-rearranged ALL, T-cell ALL, ETP ALL * Karnofsky/ Lanksy performance level score of greater than or equal to 50 percent * Prior therapy requirements    * Fully recovered from acute toxicities of Hematopoietic Stem Cell Transplant (HSCT) or Anthracycline Exposure   * 14 days must have elapsed since the completion of systemic cytotoxic therapy other than hydroxyurea, decitabine or azacitidine   * 2 weeks must have elapsed for local palliative radiotherapy (RT); 6 months must have elapsed if prior craniospinal RT or if 50% radiation of pelvis, and at least 6 weeks must have elapsed if other substantial bone marrow radiation * Adequate renal, liver, cardiac and central nervous system (CNS) function  Exclusion Criteria:  * Diagnosis of one of the following:    * Acute Promyelocytic Leukemia (APML)   * Acute leukemia with CNS status 3 involvement   * Philadelphia chromosome positive leukemia (Ph+ ALL, MPAL, or AUL)   * Fanconi Anemia, Shwachman-Diamond syndrome, or any other bone marrow failure syndrome or DNA repair disorder   * Wilson's Disease or other copper-metabolism disorder * Pregnant or breastfeeding * Uncontrolled infection * Received greater than 13.6 Gray (Gy) prior radiation to the mediastinum * Unable to swallow tablets * Receipt of growth factors within 7 days prior to enrollment * Currently receiving another investigational drug * Currently receiving anti-cancer agents (with the exception of intrathecal (IT) agents or hydroxyurea) * Unable to comply with the safety monitoring requirements of the study", "description": "This study evaluates the safety and tolerability of combining venetoclax with Vyxeos (CPX-351) in pediatric and young adult patients with acute leukemia that has come back or not responded to treatment.", "title": "A Phase I Study of Venetoclax Combined With Vyxeos (CPX-351) for Children, Adolescents and Young Adults With Relapsed or Refractory Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT03826992", "enrollment": "21", "max_age": "39.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT03826992", "locations": ["United States"], "min_age": "1.0", "outcome_measures": ["Feasibility of combining venetoclax and Vyxeos (dose limiting toxicities); 28 days", "Treatment related toxicities; 60 days", "Feasibility of combining venetoclax and Vyxeos (dose limiting toxicities); 28 days", "Treatment related toxicities; 60 days"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2018-12-27"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * 14-55 years old; * Ph-like ALL newly diagnosed; * signed written informed consent  Exclusion Criteria:  * Pregnant women; * History of pancreatitis; * History of diabetes; * History of active peptic ulcer disease in the past 6 months; * History of arteriovenous thrombosis in the past 6 months; * Severe active infection; * Allergic to any drugs in PDT-Ph-like-ALL.", "description": "Ph-like ALL is a recently recognized high-risk subgroup and the optimal therapeutic approaches are poorly characterized. Based on the pediatric-inspired, PEG-L-asparaginase-intensified and MRD-directed PDT-ALL-2016 protocol, this open-label, two-arm, multi-site trial PDT-Ph-like-ALL is aimed to evaluate the safety and effect of oral histone deacetylase inhibitor chidamide and dasatinib for adult Ph-like ALL.", "title": "An Open-Label, One-Arm, Multi-Site Trial of Precision Diagnosis Directing Target Total Therapy for Adult Ph-like Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT03564470", "enrollment": "120", "max_age": "55.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT03564470", "locations": ["China"], "min_age": "14.0", "outcome_measures": ["Event free survival; 3 years", "Event free survival; 3 years"], "phases": ["PHASE2", "PHASE3"], "status": "RECRUITING", "start_date": "2016-02-14"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Signed written informed consent； 2. Diagnose as Relapsed/Refractory AML, and meet one of the following conditions：     1. With persistent disease after at least two lines of therapy；    2. Relapse to the last line of therapy in 6 months，as known as early recurrence;    3. Relapse to the last line of therapy after 6 months, but refractory to this last line of therapy；    4. Relapse more than once. The definition of relapse: Reappearance of blasts in the blood or bone marrow (\\>5%) or in any extramedullary site after a CR (the most common are CNS and testicular leukemia). 3. Evidence for cell membrane CD123 expression; 4. KPS\\>60; 5. The expect time of survive is above 3 months; 6. Ages: 2 to 75 years; 7. All genders; 8. The patients that diagnosis as high risks, relapse/refractory or inconformity criteria to other therapy； 9. No serious mental disorders; 10. Left ventricular ejection fraction ≥40%; 11. Sufficient hepatic function defined by ALT/AST\\<5 x ULN and bilirubin≤34.2μmol/L; 12. Sufficient renal function defined by creatinine clearance \\<220μmol/L; 13. Sufficient pulmonary function defined by indoor oxygen saturation≥92%; 14. No other illness may conflict with the protocol (e.g. autoimmune diseases, immune deficiency and organ transplantation； 15. Ability and willingness to adhere to the study visit schedule and all protocol requirements.  Exclusion Criteria:  1. Previous history of other malignancy; 2. Presence of uncontrolled active infection; 3. Evidence of disorder that need the treatment by glucocorticoids; 4. Active or chronic GVHD； 5. The patients treatment by inhibitor of T cell； 6. Pregnant or breasting-feeding women; 7. Any situation that investigators regard not suitable for attending in this study (e.g. HIV , HCVinfection or intravenous drug addiction) or may affect the data analysis.", "description": "There are limited options for treatment of relapse/refractory acute myeloid leukemia (AML). CD123 CAR-T cells may have an attractive and permanent effect on anti-tumor. This study purpose to estimate the safety and efficiency of CD123 CAR-T cells to patients with relapse/refractory AML.", "title": "CD123-Targeted CAR-T Cell Therapy for Relapsed/Refractory Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04265963", "enrollment": "45", "max_age": "75.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04265963", "locations": ["China"], "min_age": "2.0", "outcome_measures": ["Adverse events that related to treatment; 2 years", "The response rate of CD123 CAR-T treatment in patients with relapse/refractory AML that treatment by CD123 CAR-T cells therapy; 2 years", "Adverse events that related to treatment; 2 years", "The response rate of CD123 CAR-T treatment in patients with relapse/refractory AML that treatment by CD123 CAR-T cells therapy; 2 years"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2019-09-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Pediatric, adolescent, or young adult patients with B-ALL as per NCCN v2.2021 and WHO classification in relapse or primary refractory and, either/both of the following: * Unable to receive anthracyclines (see section 3.1.8) or is PEG-asparaginase intolerant. * For leukemia: Patients must have ≥ 5% blasts expressing CD19 and CD22 in the bone marrow as assessed by morphology or flow cytometry. However, if an adequate bone marrow sample cannot be obtained, patients may be enrolled if there is unequivocal evidence of leukemia with ≥ 5% blasts in the peripheral blood. * If patient does not have CD20, they can still be enrolled but will not receive rituximab. * Performance status: Lansky ≥ 50 for patients who are ≤ 16 years old and Karnofsky ≥ 50% for patients who are \\> 16 years old. * Patients with asymptomatic CNS leukemia are eligible (see also Exclusion Criterion 3.2.2.) * Age \\> = 1 years of age and less than 25 years of age. * The following baseline laboratory data: * Total serum bilirubin ≤1.5x upper limit of normal (ULN). Patients with known Gilbert's syndrome may have a total bilirubin up to ≤3 x ULN. * Adequate renal function per age51 unless related to the disease. Estimated glomerular filtration rate ≥ 60 mL/min/1.73 m2 based on local institutional practice for age-appropriate determination (eg, Schwartz formula for pediatric patients or Cockcroft Gault formula for adults). * Alanine aminotransferase (ALT) and/or aspartate aminotransferase (AST) ≤3 x ULN; ≤5 x ULN in case of suspected leukemic liver involvement * Females of childbearing potential must have a negative serum or urine beta human chorionic gonadotropin (β-HCG) pregnancy test result within 14 days prior to the first dose of study drugs and must agree to use one of the following effective contraception methods during the study and 30 days after the last treatment and 8 months after the last dose of inotuzumab and 12 months after the last dose of rituximab. Effective methods of birth control include: * Birth control pills, shots, implants (placed under the skin by a health care provider) or patches (placed on the skin) * Intrauterine devices (IUDs) * Condom or occlusive cap (diaphragm or cervical/vault caps) used with Spermicide * Abstinence * Males need to inform the doctor right away if the partner becomes pregnant or suspects pregnancy. While in this study and for 30 days after the last treatment the patient should not donate sperm for the purposes of reproduction. He will need to use a condom while in this study and for 30 days after the last treatment and 5 months after the last dose of inotuzumab. * Patients with cardiac disease (Left ventricular ejection fraction (EF) \\< 50% (as determined by the Biplane Simpson method)(but not per exclusion criteria 3.2.3.1), or who have received \\>450mg/m2 of doxorubicin and cannot receive anthracyclines.  Exclusion Criteria:  * Patients who meet any of the following criteria will be excluded from participation in the study: * Past or current history of a secondary or other primary tumor or a chronic myeloid leukemia (CML) blast crisis with exception of: * Curatively treated non-melanomatous skin cancer * Other primary solid tumor treated with curative intent and no known active disease present and no treatment administered during the last 2 years * Presence of clinically significant uncontrolled CNS pathology such as epilepsy, childhood seizure, paresis, aphasia, stroke, severe brain injuries, organic brain syndrome, or psychosis. Presence of the following are allowed: headaches, vomiting, nerve palsy * Medical history of cardiovascular disease such as: * Clinically significant cardiac disease including congestive heart failure (NYHA class III or IV) or arrhythmia or conduction abnormality requiring medication * Patients with uncontrolled, active infections (viral, bacterial, or fungal). Infections controlled on concurrent anti-microbial agents are acceptable, and anti-microbial prophylaxis per institutional guidelines are acceptable. * Known active hepatitis B or C infection or known seropositivity for HIV. * Patients with liver cirrhosis or other serious active liver disease or with suspected active alcohol abuse. * Active acute/chronic Graft-versus-Host Disease (GvHD) requiring systemic treatment; or receiving immunosuppression for GvHD prophylaxis within 2 weeks from the start of study therapy. * If patient has not recovered from previous chemotherapy, surgery, radiation before the start of study drugs. * To reduce the circulating blast count or palliation, the following are allowed prior to starting: Single dose intravenous cytarabine, steroids or hydroxyurea. No washout necessary for these agents. * Females who are pregnant or lactating. * Male or female subjects of childbearing potential, unwilling to use an approved, effective means of contraception in accordance with institution's standards. * Other severe, uncontrolled acute or chronic medical or psychiatric condition or laboratory abnormality that in the opinion of the investigator may increase the risk associated with study participation or investigational product administration or may interfere with the interpretation of study results and/or would make the patient inappropriate for enrollment into this study. * Patients with Trisomy 21, or bone marrow failure syndromes are not eligible. * Prior history of allergic reaction to any of the agents. * Patients who are unable or unwilling to comply with all study requirements for clinical visits, examinations, tests, and procedures. * Patients may be excluded if they are currently enrolled in another ongoing clinical trial with investigational products", "description": "To learn if cyclophosphamide, vincristine, and dexamethasone (called mini hyper-CVD) in combination with intrathecal (delivered into the spine) chemotherapy (methotrexate, hydrocortisone, cytarabine) and compressed rituximab, blinatumomab, and inotuzumab ozogamicin (called cRIB) can help to control the disease.", "title": "Phase II Study of Pedi-cRIB: Mini-Hyper-CVD With Condensed Rituximab, Inotuzumab Ozogamicin and Blinatumomab (cRIB) for Relapsed Therapy for Pediatric With B-Cell Lineage Acute Lymphocytic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05645718", "enrollment": "27", "max_age": "25.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05645718", "locations": ["United States"], "min_age": "1.0", "outcome_measures": ["Incidence of Adverse Events, Graded According to National Cancer Institute Common Terminology Criteria for Adverse Events (NCI CTCAE) Version (v) 5.0; through study completion; an average of 1 year."], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2023-07-14"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patients with previously untreated acute lymphoblastic leukemia (B-cell or T-cell) * Bone marrow involvement with ≥20% lymphoblasts * Age ≥ 60 Years  OR  * Patients with relapsed or refractory acute lymphoblastic leukemia (B-cell or T-cell) defined as receiving one or more cytotoxic containing regimens * Bone marrow involvement with ≥5% lymphoblasts * Age ≥ 18 Years * Eastern Cooperative Oncology Group (ECOG) performance status ≤2 (Refer to Appendix D) * Adequate organ function    * Serum total bilirubin ≤1.5 x upper limit of normal (ULN) or ≤3 x ULN for patients with Gilbert's disease   * Alanine aminotransferase (ALT) and aspartate aminotransferase (AST) ≤3.0 x ULN, unless clearly due to disease involvement   * Creatinine clearance \\>50 mL/min (calculated according to institutional standards or using Cockcroft-Gault or Modification of Diet in Renal Disease (MDRD) formula) * Women of childbearing potential must have a negative serum or urine beta human chorionic gonadotropin (β-hCG) pregnancy test result within 14 days prior to the first dose of study drugs and must agree to use an effective contraception method during the study and for 30 days following the last dose of study drug. Women of non- childbearing potential are those who are postmenopausal greater than 1 year or who have had a bilateral tubal ligation or hysterectomy. Men who have partners of childbearing potential must agree to use an effective contraceptive method during the study and for 30 days following the last dose of study drug * Patients or their legally authorized representative must provide written informed consent  Exclusion Criteria:  * Ph-positive ALL, Burkitt's leukemia/lymphoma, or lymphoblastic lymphoma * Patient is pregnant or breastfeeding * Patients with uncontrolled infection * Hepatitis B or C infection, or known seropositivity for human immunodeficiency virus (HIV) * Major surgery or radiation therapy within 4 weeks prior to the first study dose * Systemic chemotherapy/radiotherapy/investigational therapy within 14 days (with the exception of hydroxyurea and/or dexamethasone, or one dose of cytarabine) prior to starting therapy * Symptomatic or untreated leptomeningeal disease or spinal cord compression * Patients with active heart disease (New York Heart Association (NYHA) class 3-4 as assessed by history and physical examination, unstable angina/stroke/myocardial infarction within the last 6 months) * Patients with a cardiac ejection fraction (as measured by either Multi Gated Acquisition (MUGA) or echocardiogram (EKG)) \\<40% * History of another primary invasive malignancy that has not been definitively treated or in remission for at least 2 years. Patients with non-melanoma skin cancers or with carcinomas in situ are eligible regardless of the time from diagnosis (including concomitant diagnoses) * Concurrent use of warfarin * Received Cytochrome P450 3A (CYP3A) inhibitors (such as fluconazole, ketoconazole, voriconazole, and clarithromycin) within 3 days of starting venetoclax; received strong CYP3A inducers (such as rifampin, rifabutin, phenytoin, carbamazepine, and St. John's Wort) within 3 days of starting venetoclax * Consumed grapefruit, grapefruit products, Seville oranges, or star fruit within 3 days prior to starting venetoclax * Prior treatment with venetoclax * Malabsorption syndrome or other conditions that preclude enteral route of administration * Other severe acute or chronic medical or psychiatric condition or laboratory abnormality that in the opinion of the investigator may increase the risk associated with study participation or investigational product administration or may interfere with the interpretation of study results and/or would make the patient inappropriate for enrollment into this study", "description": "This research study is studying a medication called Venetoclax and a chemotherapy regimen as a possible treatment for Acute Lymphoblastic Leukemia.  The drugs involved in this study are:  * Venetoclax * Standard Chemotherapy (which includes cyclophosphamide, vincristine, doxorubicin, dexamethasone, methotrexate, 6-mercaptopurine, etoposide, and cytarabine", "title": "A Phase Ib Study of the Combination of Venetoclax With Chemotherapy as Frontline Therapy in Older Patients and Patients With Relapsed/Refractory Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT03319901", "enrollment": "82", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT03319901", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Maximum Tolerated Dose; 2 years", "Maximum Tolerated Dose; 2 years"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2017-10-30"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Pediatric and young adult patients 10-25 years of age 2. Lumbar puncture for chemotherapy per leukemia therapy 3. Cognitively appropriate 4. Assessed by child life specialist as appropriate to use VR 5. Previous LP with GA 6. Tested negative for COVID-19  Exclusion Criteria:  1. History of seizures 2. Active headache 3. Active nausea or vomiting 4. ASA (American Society of Anesthesiologists) greater than 4 5. Allergy to lidocaine, procaine, or propofol 6. Developmental delay 7. No previous LP with GA 8. Tested positive for COVID-19, or opted out of of COVID-19 testing", "description": "The goal of this feasibility study is to determine if Virtual Reality (VR) can be adequately used as an alternative to General Anesthesia (GA) for Lumbar Punctures (LP).", "title": "Virtual Reality as a Distraction Technique for Performing Lumbar Punctures in Children and Young Adults With Leukemia: a Feasibility Study", "url": "https://ClinicalTrials.gov/show/NCT04092803", "enrollment": "20", "max_age": "25.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04092803", "locations": ["United States"], "min_age": "10.0", "outcome_measures": ["Success of completion of the LP with VR; 4 months", "Success of completion of the LP with VR; 4 months"], "phases": ["NA"], "status": "RECRUITING", "start_date": "2019-09-09"}
{"study_results": "False", "gender": "ALL", "criteria": "Cohort 1  Inclusion Criteria:  1. Patients with previously untreated AML or high risk MDS (\\>/= 10 % blasts or IPSS \\>/= intermediate-2). Prior therapy with hydroxyurea, hematopoietic growth factors, azacytidine, ATRA, or total dose of cytarabine up to 2g is allowed. Patients with history of MDS transformed to AML are eligible regardless of their prior therapy for MDS provided this will be their first induction therapy for AML. 2. Age \\>/= 60 years. Patients aged \\< 60 years who are unsuitable for standard induction therapy may be eligible after discussion with PI 3. Adequate organ function as defined below:     * liver function (bilirubin \\< 2mg/dL, AST and/or ALT \\<3 x ULN)    * kidney function (creatinine \\< 1.5 x ULN ). 4. ECOG performance status of ≤ 2. 5. A negative urine pregnancy test is required within 1 week for all women of childbearing potential prior to enrolling on this trial. 6. Patient must have the ability to understand the requirements of the study and signed informed consent. A signed informed consent by the patient is required prior to their enrollment on the protocol. 7. Prior therapy with decitabine will be allowed unless the patient experienced progression to AML while being treated with decitabine.  Exclusion Criteria:  1. Pregnant women are excluded from this study because the agents used in this study have the potential for teratogenic or abortifacient effects. Because there is a potential risk for adverse events in nursing infants secondary to treatment of the mother with the chemotherapy agents, breastfeeding should also be avoided. 2. Uncontrolled intercurrent illness including, but not limited to ongoing or active uncontrolled infection, symptomatic congestive heart failure, unstable angina pectoris, cardiac arrhythmia, or psychiatric illness/social situations that would limit compliance with study requirements. 3. Patient with documented hypersensitivity to any of the components of the chemotherapy program. 4. Men and women of childbearing potential who do not practice contraception. Women of childbearing potential and men must agree to use contraception prior to study entry and for the duration of study participation.  Cohort 2  Inclusion Criteria:  8. Patients with previously untreated AML who are not currently eligible for other frontline clinical trials of AML therapy. Prior therapy with hydroxyurea, hematopoietic growth factors, azacytidine, ATRA, or total dose of cytarabine up to 2g is allowed. Patients with history of MDS transformed to AML are eligible regardless of their prior therapy for MDS provided this will be their first induction therapy for AML.  9. Age \\>/= 18 years who are unsuitable for standard induction therapy are eligible after discussion with PI  10. Patients must have one of the following:  * Creatinine \\>/= 2 mg/dL * Total bilirubin \\>/= 2 mg/dL * ECOG Performance Status equal to 3 or 4 * Is ineligible for participation in a protocol of higher priority    11. A negative urine pregnancy test is required within 1 week for all women of childbearing potential prior to enrolling on this trial.    12. Patient must have the ability to understand the requirements of the study and signed informed consent. A signed informed consent by the patient is required prior to their enrollment on the protocol.    13. Prior therapy with decitabine will be allowed unless the patient experienced progression to AML while being treated with decitabine.  Exclusion Criteria:  5. Pregnant women are excluded from this study because the agents used in this study have the potential for teratogenic or abortifacient effects. Because there is a potential risk for adverse events in nursing infants secondary to treatment of the mother with the chemotherapy agents, breastfeeding should also be avoided.  6. Uncontrolled intercurrent illness including, but not limited to ongoing or active uncontrolled infection, symptomatic congestive heart failure, unstable angina pectoris, cardiac arrhythmia, or psychiatric illness/social situations that would limit compliance with study requirements, unless these illnesses are judged to be related to the underlying leukemia.  7. Patient with documented hypersensitivity to any of the components of the chemotherapy program.  8. Men and women of childbearing potential who do not practice contraception. Women of childbearing potential and men must agree to use contraception prior to study entry and for the duration of study participation.", "description": "The goal of this clinical research study is to learn if cladribine given in combination with low-dose cytarabine (LDAC) and decitabine can help control the disease in patients with AML or MDS. The safety of this drug combination will also be studied.  Cladribine is designed to interfere with the cell's ability to process DNA (the genetic material of cells). It can also insert itself into the DNA of cancer cells to stop them from growing and repairing themselves.  Cytarabine is designed to insert itself into DNA of cancer cells to stop them from growing and repairing themselves.  Decitabine is designed to damage the DNA of cells, which may cause cancer cells to die.  This is an investigational study. Cladribine is FDA approved and commercially available for use in patients with hairy cell leukemia. Its use in patients with AML is investigational.  Cytarabine is FDA approved and commercially available for use in patients with AML.  Decitabine is FDA approved and commercially available for use in patients with MDS. Its use for patients with AML is investigational.  Up to 160 patients will take part in this study. All will be enrolled at MD Anderson.", "title": "Phase II Study of Cladribine Plus Low Dose Cytarabine (LDAC) Induction Followed By Consolidation With Cladribine Plus LDAC Alternating With Decitabine in Patients With Untreated Acute Myeloid Leukemia (AML) or High-Risk Myelodysplastic Syndrome (MDS)", "url": "https://ClinicalTrials.gov/show/NCT01515527", "enrollment": "160", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT01515527", "locations": ["United States"], "min_age": "60.0", "outcome_measures": ["Disease-Free Survival (DFS); Day 21"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2012-02-07"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Participants must be considered ineligible to receive intensive chemotherapy by treating investigator and must have a diagnosis of one of the following:    * Secondary AML (can be untreated secondary AML if previously treated for MDS, MDS/MPN, or any MPN with any anti-leukemic therapy; but cannot be recommended to receive any available approved AML therapy)   * Relapsed or refractory AML or relapsed/refractory AML without available approved AML therapy including transplantation or intensive chemotherapy or targetable lesion such as FLT3 or IDH1/IDH2   * Relapsed or Refractory MDS with a minimum of at least 4 cycles of decitabine or 6 cycles of azacitidine or sooner if they experience intolerance/progression/relapse while on HMA-based therapy.   * Persistent MDS/AML disease despite receiving at least 2 cycles of hypomethylating agent and venetoclax   * Previously untreated higher risk MDS by IPSS-R (\\>3.5) who require treatment per treating investigator. Exceptions: Patients recommended for immediate transplant and have a donor ready or patients recommend for intensive chemotherapy * Participants must have measurable disease defined as 5% or more blasts (blood or bone marrow). * Age 18 years and older. * ECOG performance status ≤2 (see Appendix A) * Participants must have normal organ function as defined below:    * total bilirubin ≤ 2.5 × institutional upper limit of normal (unless considered to be secondary to leukemia)   * AST(SGOT)/ALT(SGPT) ≤ 2.5 × institutional upper limit of normal (unless considered to be secondary to leukemia)   * creatinine clearance ≥ 60 mL/min/1.73 m2 * Documented pathogenic mutation in cohesin complex including a mutation in STAG2, SMC1A, RAD21, PDS5B, or SMC3 gene from a CLIA-approved test (local testing allowed; will be centrally confirmed). Patient must have a minimum VAF of 5%. Historical results from (up to 3 months prior to study registration) allowed for treatment start on study if no recent disease-modifying agent was received since testing. * The effects of Talazoparib on the developing human fetus are unknown. For this reason and because PARP inhibitor agents are suspected to be teratogenic, women of child-bearing potential and men must agree to use adequate contraception (hormonal or barrier method of birth control; abstinence) prior to study entry and for the duration of study participation. Should a woman become pregnant or suspect she is pregnant while she or her partner is participating in this study, she should inform her treating physician immediately. Men treated or enrolled on this protocol must also agree to use adequate contraception prior to the study, for the duration of the study participation, and 4 months after completion of Talazoparib administration. * For women of child bearing potential only, must have a negative urine or serum pregnancy test. * Ability to understand and the willingness to sign a written informed consent document  Exclusion Criteria:  * Participants receiving any leukemia-directed chemotherapy within 2 weeks prior to study registration or those who have not recovered from adverse events (to at least grade 1 with exception of alopecia) due to chemotherapy administered more than 2 weeks earlier. Exceptions: hydroxyurea and prior palliative radiotherapy is permitted if completed within 5 days prior to study registration and patient has no clinically significant toxicities such as mucositis or esophagitis. * No prior PARP inhibitor for any indication. * No limitations to prior MDS/AML therapy including HMA (azacitidine or decitabine). If a patient is post allogeneic hematopoietic stem cell transplant, he/she must be \\> 2 months from day of donor cell infusion to date of study registration. They must be off immunosuppression therapy for at least 14 days prior to registration (topical steroids are permitted). * Participants who are receiving any other investigational agents. * Participants with known CNS leukemia. * Uncontrolled intercurrent illness including, but not limited to, ongoing or active infection, symptomatic congestive heart failure, unstable angina pectoris, cardiac arrhythmia, or psychiatric illness/social situations that would limit compliance with study requirements or compromise safety assessment, in the judgement of the investigator. * Pregnant women are excluded from this study because Talazoparib is a PARP inhibitor agent with the potential for teratogenic or abortifacient effects. Because there is an unknown but potential risk for adverse events in nursing infants secondary to treatment of the mother with Talazoparib, breastfeeding should be discontinued if the mother is treated with Talazoparib. These potential risks may also apply to other agents used in this study. * Patient has known active HIV, HCV or HBV. * Patients with prior malignancy are eligible however patient must either be in remission from prior malignancy OR have inactive (note: meaning they do not require treatment) and asymptomatic disease. Maintenance therapy such as hormone therapy is allowed", "description": "This research study is testing if Talazoparib is an effective treatment for patients with AML and MDS that have a mutation in the cohesin complex.", "title": "A Pilot Proof-of-Concept Study of Talazoparib-Based Therapy for Cohesin-Mutated AML and MDS With Excess Blasts", "url": "https://ClinicalTrials.gov/show/NCT03974217", "enrollment": "12", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT03974217", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Proportion of participants with ≥ 50% leukemic blast reduction with Talazoparib monotherapy as a marker of anti-leukemic activity.; 1 year", "Proportion of participants with ≥ 50% leukemic blast reduction with Talazoparib monotherapy as a marker of anti-leukemic activity.; 1 year"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2019-08-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Disease specific Inclusion Criteria:  Acute myeloid leukemia relapsed/refractory after 2 lines of therapy; with CD38 expression  * CD38 expression is defined by ≥20% of malignant cells with CD38 expression by flow cytometry on the most recent marrow biopsy (within 30 days of enrollment - archived or fresh). * Relapsed/refractory is defined as failure to achieve at least a Morphological Leukemia Free State (MLFS) or reverting from MLFS. * Lines of therapy are defined as (must have had 2 prior therapies):    * One cycle of Intensive induction chemotherapy such as 7+3, 5+2, MEC, FLAG, FLAG-Ida, CLAG ± small molecule inhibitor   * Four weeks of HMA-based induction ± small molecule inhibitor   * Hematopoietic stem cell transplantation (HSCT) if relapse that occurs \\> 90 days after HSCT   * Gemtuzumab Ozogamicin   * LDAC + glasdegib   * Biomarker-specific targeted agents (FLT3 inhibitors, IDH1/2 inhibitors, others if available)   * Other treatments could be considered after discussion with the PI  Inclusion Criteria:  * Age 12 years or older at the time of consent - Please note, enrollment of minors will be begin until permission to proceed is received from the FDA. At that time, the protocol will be updated to open enrollment to minors. * Weight ≥ 50 kg due to FT538 fixed cell dosing and FT538 product pre-dose packaging * Karnofsky performance status of 80-100% for 16 years and older or Lansky Play Score of 80-100 for ≥12 and \\< 16 years of age * Evidence of adequate organ function within 14 days of starting study treatment defined as:    * Estimated Glomerular Filtration Rate (estimated creatinine clearance) ≥50 mL/min/1.73m\\^2   * Total bilirubin ≤ 5 × upper limit normal (ULN), not applicable for patients with Gilbert's syndrome   * AST ≤3 × ULN and ALT ≤ 3 × ULN, not applicable if determined to be directly due to underlying malignancy   * LVEF ≥ 40% by echocardiogram or MUGA * Contraceptive use by men or women    * Female subjects: Women of childbearing potential (WOCBP) must use a highly effective form of contraception from the screening visit until at least 12 months after the final dose of cyclophosphamide (CY), at least 4 months after the final dose of FT538, and at least 3 months after the final dose of daratumumab, whichever is latest.   * Male subjects: Males with a female partner of childbearing potential or a pregnant female partner must be sterile (biologically or surgically) or use a highly effective method of contraception from the screening visit until at least 4 months after the final dose of CY and at least 4 months after the final dose of FT538, and at least 3 months after the final dose of daratumumab, whichever is latest. * Must agree to and sign the consent for the companion Long-Term Follow-Up study (UMN CPRC #2020LS166) to fulfill the FDA required 15 years of follow-up for a genetically modified cell product. * Must agree to and sign the consent for the companion Long-Term Follow-Up study (UMN CPRC #2020LS166) to fulfill the FDA required 15 years of follow-up for a genetically modified cell product.  Exclusion Criteria:  * Diagnosis of acute promyelocytic leukemia (APL) * Pregnant or breastfeeding, Menstruating females of child-bearing potential must have a negative pregnancy test within 14 days of study treatment start * Known allergy to any of study drugs or their components * Clinically significant cardiovascular disease including any of the following: myocardial infarction within 6 months prior to first study treatment; unstable angina or congestive heart failure of New York Heart Association Grade 2 or higher or cardiac ejection fraction \\<40% * Any known condition that requires systemic immunosuppressive therapy (\\> 5mg prednisone daily or equivalent) during the FT538 dosing period (3 days before the 1st dose through 14 days after the last dose) excluding pre-medications - inhaled and topical steroids are permitted * Receipt of any biological therapy, chemotherapy, or radiation therapy, except for palliative purposes, within 2 weeks prior to Day 1 or five half-lives, whichever is shorter; or any investigational therapy within 28 days prior to the to the first dose of daratumumab. Maintenance hydroxyurea for blast control up to the initiation of lympho-conditioning is permitted * Known active central nervous system (CNS) involvement or treated CNS disease that has not cleared. If prior disease related CNS involvement must have completed effective treatment of their CNS disease at least 2 months prior to Day 1 with no evidence of disease clinically and at least stable findings on relevant CNS imaging * Non-malignant CNS disease such as epilepsy, CNS vasculitis, or neurodegenerative disease or receipt of medications for these conditions in the 2-year period leading up to study enrollment * Clinically significant untreated/uncontrolled infection * Live vaccine \\<6 weeks prior to start of lympho-conditioning * Known seropositive for HIV or known active Hepatitis B or C infection with detectable viral load by PCR * Prior solid organ transplant * Allogeneic HSCT relapse occurring \\<90 days after HSCT * Active graft-versus-host-disease (GvHD) requiring systemic immunosuppression within 14 days prior to enrollment * Presence of any medical or social issues that are likely to interfere with study conduct or may cause increased risk to the participant.", "description": "This Phase I open-label dose escalation study is conducted in two stages with a primary endpoint to identify the maximum tolerated dose (MTD) of FT538 when administered with daratumumab in patients 12 years and older with advanced acute myeloid leukemia (AML) and related myeloid diseases.", "title": "Study of FT538 in Combination With Daratumumab in Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04714372", "enrollment": "50", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04714372", "locations": ["United States"], "min_age": "12.0", "outcome_measures": ["Number of participants experiencing Dose Limiting Toxicity (DLT) events; 42 days from the 1st FT538 infusion", "Number of participants experiencing Dose Limiting Toxicity (DLT) events; 42 days from the 1st FT538 infusion"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2021-11-03"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria  1. Patients with R/R CLL fulfilling the eligibility criteria required by the Venetoclax Named Patient Program who have received at least 1 dose of venetoclax. 2. Patients with R/R CLL who have received at least 1 dose of venetoclax or are scheduled to start treatment with venetoclax according to the Post-marketing Use before October 31st, 2021. 3. Signed informed consent document (if feasible) according to ICH/EU/GCP and national local laws indicating that the patients understand the purpose of the study and they agree to give complete access to their medical records.  Exclusion Criteria:  None", "description": "Observational study aimed at describing the characteristics and outcome of CLL patients who started treatment with venetoclax-based regimens according to the local label outside clinical trials in Italy in a period of time ranging from the start of the Venetoclax Named Patient Program (March 2016) until October 31st, 2021.", "title": "An Observational Study to Evaluate the Clinical and Biologic Features and Outcome of Patients With Relapsed or Refractory Chronic Lymphocytic Leukemia (CLL) Treated With Venetoclax-based Regimens Outside Clinical Trials in Italy", "url": "https://ClinicalTrials.gov/show/NCT04282811", "enrollment": "157", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT04282811", "locations": ["Italy"], "min_age": "18.0", "outcome_measures": ["Estimation of the PFS in relapsed/refractory (R/R) patients with CLL treated with venetoclax-based regimens according to the local label outside clinical trials in Italy.; 15 months"], "phases": ["NA"], "start_date": "2020-07-24", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Patients with relapsed or refractory T-cell acute lymphoblastic leukemia defined as receiving one or more cytotoxic containing regimens and A. Bone marrow involvement with ≥ 5% lymphoblasts B. Age ≥ 18 Years 2. Eastern Cooperative Oncology Group (ECOG) performance status ≤2 3. Adequate organ function     * Serum total bilirubin ≤1.5 x upper limit of normal (ULN) or ≤3 x ULN for patients with Gilbert's disease    * Alanine aminotransferase (ALT) and aspartate aminotransferase (AST) ≤3.0 x ULN, unless clearly due to disease involvement    * Creatinine clearance ≥50 mL/min (calculated according to institutional standards or using Cockcroft-Gault or Modification of Diet in Renal Disease (MDRD) formula) 4. Women of childbearing potential must have a negative serum or urine beta human chorionic gonadotropin (β-HCG) pregnancy test result within 14 days prior to the first dose of study drugs and must agree to use an effective contraception method during the study and for 30 days following the last dose of study drug. Women of non- childbearing potential are those who are postmenopausal greater than 1 year or who have had a bilateral tubal ligation or hysterectomy. Men who have partners of childbearing potential must agree to use an effective contraceptive method during the study and for 30 days following the last dose of study drug 5. Patients or their legally authorized representative must provide written informed consent  Exclusion Criteria:  1. Patient is pregnant or breastfeeding 2. Patients with uncontrolled active infection 3. Hepatitis B or C infection, or known seropositivity for human immunodeficiency virus (HIV) 4. Major surgery or radiation therapy within 4 weeks prior to the first study dose 5. Systemic chemotherapy/radiotherapy/investigational therapy within 14 days (with the exception of hydroxyurea, dexamethasone, or one dose of cytarabine) prior to starting therapy 6. No clinical, radiological or laboratory evidence of pancreatitis, including:     1. Serum lipase must be \\<2 times the ULN, and    2. Serum amylase must be \\<2 times the ULN 7. Symptomatic or untreated leptomeningeal disease or spinal cord compression. Patients with prior h/o CNS disease are eligible as long as no active CNS disease as documented by recent CSF analysis and/or imaging studies. 8. Patients with active heart disease \\[New York Heart Association (NYHA) class 3-4 as assessed by history and physical examination, unstable angina/stroke/myocardial infarction within the last 6 months\\] 9. Clinically significant, uncontrolled, or active cardiovascular disease, specifically including, but not restricted to:     * Myocardial infarction (MI), stroke, revascularization, unstable angina or transient ischemic attack within 6 months    * Left ventricular ejection fraction (LVEF) less than 50%    * Diagnosed or suspected congenital long QT syndrome    * Clinically significant atrial or ventricular arrhythmias (such as uncontrolled, clinically significant atrial fibrillation, ventricular tachycardia, ventricular fibrillation, or Torsades de pointes) as determined by the treating physician    * Prolonged QTc interval on pre-entry electrocardiogram (\\> 480 msec) unless corrected after electrolyte replacement or Currently taking drugs that are known to have a risk of causing prolonged QTc or torsades de pointes (TdP) (unless these can be changed to acceptable alternatives or discontinued)    * History of venous thromboembolism including deep venous thrombosis or pulmonary embolism within the past 3 months, excluding line-associated DVT of the upper extremity    * Uncontrolled hypertension (diastolic blood pressure \\>100mmHg; systolic \\>150mmHg). 10. Uncontrolled hypertriglyceridemia (triglycerides \\> 450mg/dL) 11. History of another primary invasive malignancy that has not been definitively treated or in remission for at least 2 years. Patients with non-melanoma skin cancers or with carcinomas in situ are eligible regardless of the time from diagnosis (including concomitant diagnoses) 12. Taking any medications or herbal supplements that are known to be strong inhibitors (such as fluconazole, ketoconazole, voriconazole, and clarithromycin) or inducers (such as rifampin, rifabutin, phenytoin, carbamazepine, and St. John's Wort) of cytochrome P450 (CYP)3A4 within at least 7 days before the first dose of ponatinib or within 3 days of starting venetoclax. 13. Consumed grapefruit, grapefruit products, Seville oranges, or star fruit within 3 days prior to starting venetoclax 14. Malabsorption syndrome or other conditions that preclude enteral route of administration 15. Other severe acute or chronic medical or psychiatric condition or laboratory abnormality that in the opinion of the investigator may increase the risk associated with study participation or investigational product administration or may interfere with the interpretation of study results and/or would make the patient inappropriate for enrollment into this study", "description": "The addition of ponatinib to mini-hyper-CVD chemotherapy and venetoclax will improve the complete remission rate in patients with relapsed or refractory T-cell acute lymphoblastic leukemia", "title": "A Phase II Study of the Combination of Ponatinib With Mini-hyper CVD Chemotherapy and Venetoclax in Patients With Relapsed or Refractory T-cell Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05268003", "enrollment": "20", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05268003", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["To determine the complete remission (CR) / CR with incomplete count recovery (CRi) rate with the combination of Ponatinib and mini-hyper-CVD chemotherapy and venetoclax.; through study completion, an average of 1 year"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2022-06-07"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient in the Maintenance Phase of therapy on or as per DFCI 16-001 and has completed at least two cycles of maintenance therapy to allow adequate recovery from the more intensive Consolidation phase. * English or Spanish speaking child and primary caregiver (parent/guardian). * Child aged 4-12 years.  Exclusion Criteria:  * Primary team declines permission to approach. * Children with critical illness (defined as ICU admission)", "description": "The goal of this research study is to understand the acceptability and feasibility of the Sleep ALL Night intervention among children with Acute Lymphoblastic Leukemia (ALL) in hopes of improving the discussion of sleep disorders with clinical providers.  The name of the intervention used in this research study is: Sleep ALL Night, which is a sleep intervention program comprised of an action plan tool and psychoeducational website.", "title": "Insomnia Prevention in Children With Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05866887", "enrollment": "30", "max_age": "12.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05866887", "locations": ["United States"], "min_age": "4.0", "outcome_measures": ["Enrollment Rate of Participants; At screening", "Acceptability of Intervention Measure Scale Score; At Week 4", "Participant Review Rate of Action Plan; At Week 4", "Psychoeducational Website Access Rate; At Week 4", "Intervention Assessment Completion Rate; Up to 1 month after the conclusion of the study period, up to 8 weeks."], "phases": ["NA"], "status": "RECRUITING", "start_date": "2023-09-26"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Histologically or cytologically documented adult T-cell leukemia/lymphoma (ATLL), Cluster of Differentiation (CD)34+ acute myelogenous leukemia (AML), or acute lymphoblastic leukemia (B-cell or T-cell ALL). Eligible patients with ATLL must have leukemic involvement (See Appendix K for subtype classification). 2. Must have evidence of persistent refractory disease or progression at the time of screening and documented presence of leukemic cells in peripheral blood by either morphology, histology, or flow cytometry. 3. Must have failed standard induction and salvage therapies available AND be ineligible for allogeneic stem cell transplant ǂ as follows:     For ATLL, must not have failed standard combination chemotherapy (i.e. doxorubicin or etoposide based regimen), salvage chemotherapy (i.e. ifosfamide + carboplatin + etoposide (ICE), dexamethasone, High-dose Cytarabine (Ara-C) and cisplatin (DHAP), or gemcitabine + oxaliplatin (GEMOX)), brentuximab vedotin if CD30+, interferon based therapy if acute or chronic type, and mogamulizumab provided patient is a suitable candidate for the above therapies ±.     Relapsed/refractory (R/R) AML is defined as patients ≥ 18 years of age at the time of signing the informed consent form (ICF) who are not eligible to receive further intensive therapy and:    * Have failed to achieve a complete remission (CR) or morphologic complete remission with incomplete blood count recovery (CRi) after induction plus reinduction with intensive chemotherapy (e.g., anthracycline plus cytarabine or high-dose cytarabine containing regimens) if a suitable candidateǂ or 4 cycles of low-intensity therapy (i.e. azacytidine, or decitabine based regimens) (either 4 cycles of the same regimen or a combination of 2 different regimens) OR    * Have relapsed from CR or CRi from either intensive or low-intensity therapy. Subjects with second or multiple relapses are also eligible.     For R/R ALL, the patient must have failed (relapsed or primary refractory) induction chemotherapy with consolidation if a suitable candidate± (i.e. ECOG 2993 or similar regimen). The patient should also have failed blinatumomab if CD19+ B-cell ALL, inotuzumab if CD22+ B-cell ALL, tyrosine kinase inhibitor if bcr-abl+, or salvage chemotherapy if available and if the patient is a suitable candidate± for these therapies.     ± A suitable candidate is defined by a patient who has no contraindications to the available chemotherapy based on organ function, age, and overall health and performance status as determined by the treating physician.     ǂ Transplant ineligible patients are defined as those not suitable for potentially curative allogeneic stem cell transplant based on lack of disease control or remission at the time of evaluation, inadequate organ function, age, and overall health and performance status as determined by the treating physician, or patient's refusal to undergo such treatment procedure. 4. Adults (≥ 18 years of age) regardless of their gender and genetic background 5. Karnofsky performance status (KPS) ≥ 50% or Eastern Cooperative Oncology Group (ECOG) performance status ≤ 3. (see Appendix B for definitions). 6. Must have adequate end organ and bone marrow function as defined below: 7. Absolute neutrophil count (ANC)≥ 1,000 cells/mm3 (Exception: Unless cytopenias are secondary to leukemia disease). 8. Platelets (PLT) ≥ 50,000 cells/mm3 (Exception: Unless cytopenias are secondary to leukemia). 9. Hepatic function: transaminase ≤ 2.5 x the institutional upper limit of normal, total bilirubin ≤ 1.5 x institutional upper limit of normal, (Exception: Unless secondary to hepatic infiltration with leukemia). 10. Females of childbearing potential (CBP) must have a negative pregnancy test within one week of enrollment. Women should avoid pregnancy while receiving study treatment. Males and females must agree to use adequate methods of birth control during participation in this trial and for 3 months after completing therapy 11. Patients receiving erythropoietin or granulocyte colony-stimulating factor (G-CSF) from baseline are eligible. 12. Ability to understand and willingness to sign a written informed consent document. Written consent by patient or legal guardian on an institutional review board (IRB)-approved informed consent form prior to any study-specific evaluation. Subject or legal guardian must be capable of understanding the investigational nature, potential risks and benefits of the study and able to provide valid informed consent.  Exclusion Criteria:  1. Patients who have previously received allogeneic stem cell transplant are ineligible 2. Patients receiving cytotoxic chemotherapy within 14 days or any other investigational biological agents within 7 days prior to initiation of study therapy. 3. Any concomitant participation in other therapeutic trials. 4. All patients will be required to be screened for Hepatitis B and C. Patients with active hepatitis B (HBsAg+ and Immunoglobulin M (IgM)+ for Hepatitis B core antigen) will not be eligible for trial enrollment. Those found to be Immunoglobulin G (IgG)+ for Hepatitis core antigen only may be eligible as long as they are receiving anti-Hepatitis B prophylactic therapy and liver function tests meet criteria listed under 4.1.10 above, and have no evidence of cirrhosis. The exact Hepatitis B therapy will be at the discretion of the infection disease specialist or investigator. Participants who are Hepatitis C antibody positive without a positive Hepatitis C RNA level, will be permitted to enroll in the study provided liver function tests meet criteria listed under 4.1.10 above, and have no evidence of cirrhosis on imaging. 5. HIV infection. 6. Active or latent syphilis. 7. Uncontrolled inter-current illness including, but not limited to, ongoing or active infection, symptomatic congestive heart failure (CHF), unstable angina pectoris, cardiac arrhythmia, or psychiatric illness/social situations that are likely in the judgment of the Investigator(s) to interfere or limit compliance with study requirements/treatment. 8. Patients with known central nervous system (CNS) involvement. 9. Pregnant or breast-feeding women. 10. Concurrent active malignancies, with the exception of in situ carcinoma of the cervix, non-metastatic, non- melanomatous skin cancer, or Kaposi's sarcoma not requiring systemic chemotherapy. 11. Known New York Heart Association (NYHA) Class 3 or 4 heart disease as per Appendix C. 12. Known history of cardiomyopathy with ejection fraction \\< 45% (or lower limit of institutional normal value) or uncontrolled arrhythmia. 13. Psychological, familial, sociological or geographical conditions likely in the judgment of the Investigator(s) to interfere or limit compliance with study requirements/treatment 14. Known active deep venous thrombosis (DVT) or pulmonary embolism", "description": "The purpose of this research is to investigate whether the combination of STING-dependent Adjuvants (STAVs) and dendritic cell (DC) vaccine therapies will increase the body's ability to fight aggressive relapsed or refractory leukemias.", "title": "A Pilot Safety Trial of STING-dependent Activators (STAVs) and Stimulated Dendritic Cells for Aggressive Relapsed/Refractory Leukemias", "url": "https://ClinicalTrials.gov/show/NCT05321940", "enrollment": "18", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05321940", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Incidence of Treatment-Related Adverse events; Up to 12 months", "Incidence of Treatment-Related Adverse events; Up to 12 months"], "phases": ["PHASE1"], "status": "NOT_YET_RECRUITING", "start_date": "2023-09-15"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Adult patients, 18 years or older, undergoing an allo-HSCT for acute leukemia. * Approval to engage in exercise as per screening by the CSEP or ACSM certified CEP and/or clinician * Ability to provide written informed consent and understand study information.  Exclusion Criteria:  * Less than 18 years old * Diagnosed with acute leukemia but not undergoing work-up for allo-HSCT * Unable to read/communicate in English (i.e., unable to complete experimental procedures such as patient-reported outcomes). * Neurological or musculoskeletal comorbidity inhibiting exercise. * Diagnosed psychotic, addictive, or major cognitive disorders. * Severe coronary artery disease (Canadian Cardiovascular Society class III or greater). * Significant congestive heart failure (New York Heart Association class III or greater). * Severe thrombocytopenia (platelets \\<10) - ok if transfused platelets prior to exercise.", "description": "The purpose of this study is to implement a prehabilitation intervention to enhance recovery for people undergoing allogeneic stem cell transplant for hematologic malignancies. All participants in this study will receive a prehabilation intervention in addition to usual care (no change to their chemotherapy protocols or transplant) and several quality of life and fitness scores will be measured throughout the intervention.", "title": "A Multiphasic Prehabilitation Exercise Program For Allogeneic Hematopoietic Stem Cell Transplant Recipients", "url": "https://ClinicalTrials.gov/show/NCT05649371", "enrollment": "60", "max_age": "80.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05649371", "locations": [""], "min_age": "18.0", "outcome_measures": ["Feasibility of Implementing an Exercise Program for Patients Undergoing Allogeneic-HSCT, Measured by Participant Attendance; 6-9 months", "Feasibility of Implementing an Exercise Program for Patients Undergoing Allogeneic-HSCT, Measured by Participant Attendance; 6-9 months"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Selected patients over the age of 18 with hematologic malignancies or other blood disorders (leukemia, myeloproliferative disorders, lymphoma, other malignancies involving the bone marrow or patients with unexplained alterations in their complete blood count).  Patients who are scheduled to undergo a bone marrow aspirate and/or phlebotomy for other clinical indications will be asked to participate. They will be asked to donate an additional small aliquot of bone marrow and/or blood during the course of their already scheduled bone marrow aspiration or phlebotomy.  Exclusion Criteria:  * Patients with pre-existing medical conditions that might be exacerbated by the procedure of obtaining bone marrow or blood * Patients who are allergic to Lidocaine, which is used as a local anesthetic, and who cannot receive a suitable substitute anesthetic. * Patients who have a bleeding diathesis which might pose a problem with marrow aspiration. * Patients unable to give informed consent. * Pregnant patients", "description": "The collection of Blood and/or Bone Marrow from patients with blood disorders, blood cell malignancies and associated conditions will serve as a convenient and comprehensive source of tissue to give us further information about the differences between normal blood cells and blood cells of affected individuals. This will be an invaluable asset for understanding the biology of blood disorders. The collected samples will be used by investigators for studies including immunology, molecular biology and genetics to name a few.", "title": "Collection of Blood and/or Bone Marrow for Investigation and Characterization of Normal and Abnormal Cell Growth in Patients With Malignancy or Hematologic Disorders", "url": "https://ClinicalTrials.gov/show/NCT01174615", "enrollment": "1000", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT01174615", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["The study is designed to collect blood and bone marrow from patients with various hematological diseases.; On average, indefinite, or until death of participant", "The study is designed to collect blood and bone marrow from patients with various hematological diseases.; On average, indefinite, or until death of participant"], "phases": ["NA"], "start_date": "2009-09", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Man or woman aged 18 or over * Patient with prolymphocytic T leukemia  Exclusion Criteria:  * Absence of signature of informed consent", "description": "Prolymphocytic leukemia T is a rare disease representing approximately 2% of mature lymphoid leukemias and 20% of prolymphocytic leukemias. It mainly affects the elderly with an aggressive clinical course. It is a hemopathy exhibiting a post thymic T phenotype (Tdt-, CD1a-, CD5 +, CD2 + and CD7 +), generally CD4 + / CD8-, but also CD4 + / CD8 + or CD8 + / CD4-.  The main feature of T-PLL is the rearrangement of chromosome 14 involving genes encoding the T cell receptor complex (TCR) subunits, leading to overexpression of the proto-oncogene TCL1.  On the molecular level, the study of Prolymphocytic leukemia T shows a substantial mutational activation of the IL2RG-JAK1-JAK3-STAT5B axis.  Patients with Prolymphocytic leukemia T have a poor prognosis, due to a poor response to conventional chemotherapy. Treatment with the anti-CD52 monoclonal antibody: alemtuzumab has considerably improved the results, but the responses to treatment are transient; therefore, patients who obtain a response to alemtuzumab treatment are candidates for stem cell allograft (TSS) if they are eligible for this procedure. This combined approach extended the median survival to four years or more. However, new approaches using well-tolerated therapies that target signaling and survival pathways are necessary for most patients who are unable to receive intensive chemotherapy, such as JAK STAT axis inhibitors, anti-AKT, or anti BCL2 .  Main objective: Better manage prolymphocytic T leukemias.  Secondary objectives:  * Molecular characterization of prolymphocytic leukemia T. * Study of the response to treatment, disease-free survival, overall survival. * Impact of prognostic factors on response to treatment, and survival.", "title": "Prospective and Retrospective Study Evaluating Epidemiological, Clinical, Molecular and Therapeutic Data of Prolymphocytic Leukemia T", "url": "https://ClinicalTrials.gov/show/NCT04411043", "enrollment": "50", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT04411043", "locations": ["France"], "min_age": "18.0", "outcome_measures": ["Clinical characteristics of prolymphocytic leukemia T; from day 0 through study completion, an average of 3 years", "Biological characteristics of prolymphocytic leukemia T; At day 0 and at relapse, an average of 3 years", "Flow cytometry data of bone marrow and blood cells; At day 0 and at relapse, an average of 3 years", "karyotype of tumor cells; At day 0 and at relapse, an average of 3 years"], "phases": ["NA"], "start_date": "2020-07-01", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Patient Inclusion Criteria:  * Patient age 14-60 years * Absence of a suitable HLA identical related or unrelated hematopoietic stem cell donor * Absence of a suitable partially HLA-mismatched (haploidentical), first-degree related donor aged between 18 and 50 * Presence of both HLA haploidentical young non-first-degree (age ≤ 40) and older first-degree (age \\>50) donors  Eligible diagnoses:  AML（excluding APL） with at least one of the following:  * median- or high- risk according to the WHO prognostic stratification system * failure to achieve CR after 2 cycles of induction chemotherapy * AML arising from MDS or a myeloproliferative disorder, or secondary AML * patients in CR2 or beyond, with \\<5% bone marrow blasts before HSCT  ALL in remission, defined as \\<5% bone marrow blasts morphologically  MDS with at least one of the following:  * IPSS score of INT-2 or greater * IPSS score of INT-1 with life-threatening cytopenias, including those generally requiring greater than weekly transfusions  NHLs (including diffuse large B-cell lymphoma, lymphoblastic lymphoma, Burkitt lymphoma, peripheral T-cell lymphoma, and NK or NK-T cell lymphoma) which are relapsed/refractory OR in CR2 or beyond  * Adequate end-organ function * ECOG performance status \\< 2 * No other contraindications for HSCT * Signature of the informed consent  Patient Exclusion Criteria:  * Availability of suitable HLA identical related or unrelated hematopoietic stem cell donors * Availability of suitable partially HLA-mismatched (haploidentical), first-degree related donor aged between 18 and 50 * Presence of uncontrolled bacterial, viral, or fungal infection * Patients with severe heart, lung, liver and kidney insufficiency * HIV-positive patients * Women of childbearing potential who are pregnant (β-HCG+) or breast feeding * Patients with a psychiatric history * ECOG performance status ≥ 3 * Patients with malignancies other than the primary disease * Refusal to sign the informed consent  Donor Inclusion Criteria:  * The donor and recipient must be HLA haploidentical * Meets institutional selection criteria and medically fit to donate * Lack of recipient anti-donor HLA antibody  Donor Exclusion Criteria:  * The donor and recipient are HLA identical * Has not donated blood products to recipient", "description": "An open, multi-center, randomized trial comparing haploidentical HSCTs from young non-first-degree and older first-degree donors in hematological malignancies", "title": "An Open, Multi-center, Randomized Trial Comparing Haploidentical HSCTs From Young Non-first-degree and Older First-degree Donors in Hematological Malignancies", "url": "https://ClinicalTrials.gov/show/NCT04547049", "enrollment": "160", "max_age": "60.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04547049", "locations": ["China"], "min_age": "14.0", "outcome_measures": ["Cumulative incidence of transplant-related nonrelapse mortality (NRM); 2 years", "Cumulative incidence of transplant-related nonrelapse mortality (NRM); 2 years"], "phases": ["PHASE3"], "status": "RECRUITING", "start_date": "2020-09-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days prior to allocation * Has a life expectancy of at least 3 months, based on the investigator assessment * Has the ability to swallow and retain oral medication * Participants who are Hepatitis B surface antigen (HBsAg)-positive are eligible if they have received Hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV viral load prior to randomization * Participants with history of Hepatitis C virus (HCV) infection are eligible if HCV viral load is undetectable at screening * Has adequate organ function * Male participants agree to refrain from donating sperm and agree to either remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle OR agree to use contraception, during the intervention period and for at least the time required to eliminate the study intervention after last dose of study intervention * Female participants assigned female sex at birth who are not pregnant or breastfeeding are eligible to participate if not a participant of childbearing potential (POCBP), or if a POCBP they either use a contraceptive method that is highly effective OR remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle during the intervention period and for at least 30 days after the last dose of study intervention * Participants with HIV are eligible if they meet all of the following: the CD4 count is \\>350 cells/uL at screening, the HIV viral load is below the detectable level, are on a stable ART regimen for at least 4 weeks prior to study entry, and are compliant with their ART  Part 1 and Part 2 (Cohorts A to C)  * Has a confirmed diagnosis of CLL/SLL with    * At least 2 lines of prior therapy (Part 1 only)   * Part 2 Cohort A: CLL/SLL participants who are relapsed or refractory to prior therapy with a covalent, irreversible Bruton's tyrosine kinase inhibitor (BTKi), and a B-cell lymphoma 2 inhibitor (BCL2i). CLL participants must have received and failed, been intolerant to, or determined by their treating physician to be a poor phosphoinositide 3-kinase inhibitor (PI3Ki) candidate or ineligible for a PI3Ki per local guidelines   * Part 2 Cohort B: CLL/SLL participants who are relapsed or refractory following at least 1 line of prior therapy and are BTKi treatment naive   * Part 2 Cohort C: CLL/SLL participants with 17p deletion or tumor protein p53 (TP53) mutation who are relapsed or refractory following at least 1 line of prior therapy   * Has active disease for CLL/SLL clearly documented to initiate therapy   * Has evaluable core or excisional lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate at Screening (optional for participants enrolling in Part 1)  Part 2 (Cohorts D to G)  * Has a confirmed diagnosis of and response to previous treatment of one of the following:    * Participants with Richter's transformation who are relapsed or refractory following at least 1 line of prior therapy (Cohort D)   * Participants with pathologically confirmed MCL, documented by either overexpression of cyclin D1 or t(11;14), who are relapsed or are refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort E)   * Participants with MZL (including splenic, nodal, and extra nodal MZL) who are relapsed or refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort F)   * Participants with FL who are relapsed or refractory to chemoimmunotherapy, immunomodulatory agents (i.e. lenalidomide plus rituximab) (Cohort G) * Have measurable disease defined as at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan * Has a lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate (Cohort D) at Screening  Part 2 (Cohort H): confirmed diagnosis of WM; participants who are relapsed or refractory to standard therapies for WM including chemoimmunotherapy and a covalent irreversible BTKi  * Has active disease defined as 1 of the following: systemic symptoms, physical findings, laboratory abnormalities, coexisting disease * Has measurable disease, satisfying any of the following: at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan (minimum measurement must be \\>15 mm in the longest diameter or \\>10 mm in the short axis); IgM ≥450 mg/dL; or bone marrow infiltration of 10% * Has fresh bone marrow aspirate or a lymph node biopsy for biomarker analysis at Screening or a lymph node biopsy from an archival  Exclusion Criteria:  * Has active HBV/HCV infection (Part 1 and Part 2) * Has a history of malignancy ≤3 years before providing documented informed consent. Participants with basal cell carcinoma of skin, squamous cell carcinoma of skin, or carcinoma in situ (eg, breast carcinoma, cervical cancer in situ) that have undergone potential curative therapy are not excluded. Participants with low-risk, early-stage prostate cancer (T1-T2a, Gleason score ≤6, and prostate-specific antigen \\<10 ng/mL) either treated with definitive intent or untreated in active surveillance with SD are not excluded * Has active central nervous system (CNS) disease * Has an active infection requiring systemic therapy * Has received prior systemic anti-cancer therapy within 4 weeks prior to allocation * Is currently participating in or has participated in a study of an investigational agent or has used an investigational device within 4 weeks prior to the first dose of study intervention * Has any clinically significant gastrointestinal abnormalities that might alter absorption * History of severe bleeding disorders", "description": "The purpose of this study is to evaluate the safety and efficacy of nemtabrutinib (formerly ARQ 531) in participants with hematologic malignancies of chronic lymphocytic leukemia (CLL)/ small lymphocytic lymphoma (SLL), Richter's transformation, marginal zone lymphoma (MZL), mantle cell lymphoma (MCL), follicular lymphoma (FL), and Waldenström's macroglobulinemia (WM).", "title": "A Phase 2 Study to Evaluate the Efficacy and Safety of MK-1026 in Participants With Hematologic Malignancies", "url": "https://ClinicalTrials.gov/show/NCT04728893", "enrollment": "450", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04728893", "locations": ["Poland", "Denmark", "Korea, Republic of", "Australia", "Hungary", "Czechia", "France", "Turkey", "Argentina", "United Kingdom", "Switzerland", "Germany", "Canada", "Ukraine", "Brazil", "Ireland", "Italy", "Romania", "United States", "Spain", "Israel", "China"], "min_age": "18.0", "outcome_measures": ["Part 1: Number of participants experiencing dose-limiting toxicities (DLTs); Up to ~56 days (Cycles 1-2, cycle = 28 days)", "Part 1: Number of participants experiencing adverse events (AEs); Up to ~34 months", "Part 1: Number of participants discontinuing study treatment due to AEs; Up to ~34 months", "Part 2: Objective Response Rate (ORR) per International Workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria 2018 as assessed by independent central review (ICR); Up to ~78 months", "Part 2: ORR per Lugano criteria 2014 as assessed by ICR; Up to ~78 months", "Part 2: ORR per International Workshop on Waldenström's Macroglobulinemia (IWWM) criteria 2014 as assessed by ICR; Up to ~78 months", "Part 1: Number of participants discontinuing study treatment due to AEs; Up to ~34 months", "Part 2: ORR per International Workshop on Waldenström's Macroglobulinemia (IWWM) criteria 2014 as assessed by ICR; Up to ~78 months", "Part 1: Number of participants experiencing dose-limiting toxicities (DLTs); Up to ~56 days (Cycles 1-2, cycle = 28 days)", "Part 2: ORR per Lugano criteria 2014 as assessed by ICR; Up to ~78 months", "Part 2: Objective Response Rate (ORR) per International Workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria 2018 as assessed by independent central review (ICR); Up to ~78 months", "Part 1: Number of participants experiencing adverse events (AEs); Up to ~34 months"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2021-04-05"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Acute leukemia harboring histone-lysine N-methyltransferase 2A (KMT2A) or nucleophosmin 1 gene (NPM1) or nucleoporin (NUP98 or NUP214) alterations * Performance status greater than or equal to (\\>=) 50 by lansky scale (for participants less than \\[\\<\\] 16 years of age) or \\>=50 percent (%) karnofsky scale (for participants \\>=16 years of age) * Estimated or measured glomerular filtration rate \\>= 60 milliliter per minute per 1.73 meter square (mL/min/1.73m\\^2) based on the bed side schwartz formula  Exclusion Criteria:  * Received an allogeneic hematopoietic transplant within 60 days of screening * Active acute graft-versus-host disease of any grade or chronic graft-versus-host which is not well-controlled * Received immunosuppressive therapy post hematopoietic transplant within 30 days of enrollment * Diagnosis of Down syndrome associated leukemia, acute promyelocytic leukemia, juvenile myelomonocytic leukemia * Diagnosis of fanconi anemia, kostmann syndrome, shwachman diamond syndrome, or any other known bone marrow failure syndrome * Prior exposure to menin-KMT2A inhibitors * Prior cancer immunotherapy (ie \\[that is\\], Chimeric Antigen Receptor-T Cell Therapy \\[CAR-T\\], inotuzumab, gemtuzumab ozogamicin) within 4 weeks prior to enrollment or blinatumomab within 2 weeks prior to enrollment. Additional prior cancer therapies must not be given within 4 weeks prior to enrollment or 5 half-lives of the agent (whichever is shorter)", "description": "The purpose of this study is to determine the recommended Phase 2 dose(s) (RP2Ds) of JNJ-75276617 in combination with a conventional chemotherapy backbone in pediatric and young adult participants with relapsed/refractory acute leukemia harboring histone-lysine N-methyltransferase 2A1 (\\[KMT2A1\\], nucleophosmin 1 gene (NPM1), or nucleoporin alterations in Part 1 (Dose Escalation) and to further evaluate safety at the RP2D(s) of JNJ-75276617 in combination with chemotherapy in pediatric and young adult participants with relapsed/refractory acute leukemia harboring KMT2A1, NPM1, or nucleoporin alterations and safety at the RP2D(s) of JNJ-75276617 as monotherapy in a select low burden of disease cohort in Part 2 (Dose Expansion).", "title": "A Phase I/Ib Study of JNJ-75276617 in Combination With Conventional Chemotherapy for Pediatric and Young Adult Participants With Relapsed/Refractory Acute Leukemias Harboring KMT2A, NPM1, or Nucleoporin Gene Alterations", "url": "https://ClinicalTrials.gov/show/NCT05521087", "enrollment": "80", "max_age": "30.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05521087", "locations": ["France", "United States", "United Kingdom", "Germany", "Spain"], "outcome_measures": ["Number of Participants with Adverse Events (AEs); Up to 3 years 5 months", "Number of Participants with AEs by Severity; Up to 3 years 5 months", "Number of Participants with Dose-Limiting Toxicity (DLT); Cycle 1 (28 days)", "Number of Participants with AEs by Severity; Up to 3 years 5 months", "Number of Participants with Adverse Events (AEs); Up to 3 years 5 months", "Number of Participants with Dose-Limiting Toxicity (DLT); Cycle 1 (28 days)"], "min_age": "0.0821917808219178", "phases": ["PHASE1"], "status": "NOT_YET_RECRUITING", "start_date": "2024-02-07"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Children between 1 year (≥ 12 months) and 18 years of age at the time of first diagnosis and less than 21 years at the time of inclusion 2. Performance status: Karnofsky performance status (for patients \\>12 years of age) or Lansky Play score (for patients ≤12 years of age) ≥ 50% (Appendix I). 3. Written informed consent from parents/legal representative, patient, and age-appropriate assent before any study specific screening procedures are conducted, according to local, regional or national guidelines. 4. For all oral medications patients must be able to comfortably swallow capsules (except for those for which an oral solution is available or dissolving of tablets is allowed based on investigator brochure (IB); nasogastric or gastrostomy feeding tube administration is allowed only if indicated). 5. Patients must have had advanced molecular profiling and flow-cytometric analysis of their recurrent or refractory disease at a time-point before the first inclusion into this trial (see section 9.1 for detailed description of the molecular diagnostics required). Drug response profiling and methylation is highly recommended but not mandatory. Patients with advanced molecular profiling at diagnosis may be allowed to be included after discussion with the sponsor. 6. Patients whose tumor present the following alterations: NUP214-ABL1 fusion or other ABL1 fusion, activating the kinase domain, or ABL1 amplification, or PDGFRβ-fusion with various fusion partners including but not limited to: AGGF1, DOCK2, SATB1, ETV6 and/or Patients showing a very deep ex-vivo dasatinib IC50 below 10 nM (Only data generated in centralized laboratory, where a robust DRP platform has been established with a reference cohort in place, will be considered) 7. Adequate organ function:     * RENAL AND HEPATIC FUNCTION (Assessed within 48 hours prior to C1D1) :       * Serum creatinine ≤ 1.5 x upper limit of normal (ULN) for age or calculated creatinine clearance as per the Schwartz formula or radioisotope glomerular filtration rate ≥ 60 mL/min/1.73 m2.      * Direct bilirubin ≤ 2 x ULN (≤ 3.0 × ULN for patients with Gilbert's syndrome).      * Alanine aminotransferase (ALT)/serum glutamic pyruvic transaminase (SGPT) ≤ 5 x ULN; aspartate aminotransferase (AST)/serum glutamic oxaloacetic transaminase/SGOT ≤ 5 x ULN. Note: Patients with hepatic disfunction related to the underling disease can be eligible even if they do not fulfill the aforementioned values for hepatic transaminases. In these cases, patients need to be discussed with the sponsor to confirm the eligibility.    * CARDIAC FUNCTION:       * Shortening fraction (SF) \\>29% (\\>35% for children \\< 3 years) and/or left ventricular ejection fraction (LVEF) ≥50% at baseline, as determined by echocardiography or MUGA.      * Absence of QTcF prolongation (QTc prolongation is defined as \\>450 msec on baseline ECG, using the Friedericia correction), or other clinically significant ventricular or atrial arrhythmia.  Exclusion Criteria:  1. Pregnancy or positive pregnancy test (urine or serum) in females of childbearing potential. Pregnancy test must be performed within 7 days prior to C1D1. 2. Sexually active participants not willing to use highly effective contraceptive method (pearl index \\<1) as defined in CTFG HMA 2020 (Appendix II) during trial participation and until 6 months after end of antileukemic therapy. 3. Breast feeding. 4. Impairment of gastrointestinal (GI) function or GI disease that may significantly alter drug absorption of oral drugs (e.g., ulcerative diseases, uncontrolled nausea, vomiting, diarrhea, or malabsorption syndrome) in case of oral IMPs. 5. Patients whose tumor present known mutationts confering resistance to venetoclax (e.g. BCL2 mutations of venetoclax binding-site (Gly101Val mutation, Phe104Leu/Cys mutations). 6. Have a known immediate or delayed hypersensitivity reaction or idiosyncrasy to the study drugs, or drugs chemically related to study treatment or excipients that contraindicate their participation, including conventional chemotherapeutics (i.e. cytarabine and cyclophosphamide when applicable, intrathecal agents) and corticoids. 7. Known active viral hepatitis or known human immunodeficiency virus (HIV) infection or any other uncontrolled infection.     a. Additional specifications for SARS-CoV-2 (COVID-19): i. Patients with a recent positive test for SARS-CoV-2 (COVID-19) and no follow-up negative PCR test are not eligible.     ii. Patients with recent contact to persons with COVID-19 and persons with signs and symptoms of COVID-19 infection must be tested before enrolling. In case of contact with a COVID-19 positive person, at least 5 days should be observed between last contact and COVID testing. A negative PCR test is required to be eligible.     iii. A negative COVID-19 test result is defined as at least 1 negative PCR test at least 24 hours after resolution of clinical symptoms. Resolution of clinical symptoms is defined as resolution of fever without use of antipyretics and improvement in respiratory symptoms (e.g., cough, shortness of breath).     iv. Frequency or timing of COVID-19 testing and interval between testing for the above viral clearance criteria may be adjusted to the applicable country and institutional guidelines. 8. Severe concomitant disease that does not allow treatment according to the protocol at the investigator's discretion. 9. Subjects unwilling or unable to comply with the study procedures. 10. Previous treatment with dasatinib and venetoclax in combination (Patients who have previously received any of these two drugs separately can be eligible for this sub-protocol). 11. Current use of a prohibited medication or herbal preparation or requires any of these medications during the study. See Section 7, Appendix III and IV for details. In general, CYP3A4 inhibitors/Pgp inhibitors, moderate or strong inducers of CYP3A4 or drugs inducing QTc changes (prolongation of the QT interval or inducing Torsade de Points) are not permitted. Among others and not exclusively that relates to antiviral, antifungal, antibiotic, antimalarial, antipsychotic and antidepressive drugs. 12. Patients who have consumed grapefruit, grapefruit products, Seville oranges (Including marmalade containing Seville oranges) or starfruit within 72 hours prior to the first dose of study drug. 13. Unresolved toxicity greater than NCI CTCAE v 5.0 ≥ grade 2 from previous anti-cancer therapy, including major surgery, except those that in the opinion of the investigator are not clinically relevant given the known safety/toxicity profile of the study treatment (e.g., alopecia and/or peripheral neuropathy related to platinum or vinca alkaloid based chemotherapy) (Common Terminology Criteria for Adverse Events (CTCAE) (cancer.gov). 14. Active acute graft versus host disease (GvHD) of any grade or chronic GvHD of grade 2 or higher. Patients receiving any agent to treat or prevent GvHD post bone marrow transplant are not eligible for this trial. 15. Received immunosuppression post allogenic HSCT within one moth of study entry. 16. History of bone disorders such as osteogenesis imperfecta, rickets, renal osteodystrophy, osteomyelitis, osteopenia, fibrous dysplasia, osteomalacia etc. prior to the underlying diagnosis. 17. Evidence of clinically active tuberculosis (clinical diagnosis per local practice). 18. Wash-out periods of prior medication:      1. CHEMOTHERAPY: At least 7 days must have elapsed since the completion of cytotoxic therapy, with the exception of hydroxyurea, 6-mercaptopurine, oral methotrexate and steroids which are permitted up until 48 hours prior to initiating protocol therapy. Patients may have received intrathecal therapy (IT) at any time prior to study entry.     2. RADIOTHERAPY: Radiotherapy (non-palliative) within 21 days prior to the first dose of drug. Palliative radiation in past 21 days is allowed.     3. HEMATOPOIETIC STEM CELL TRANSPLANTATION (HSCT):         * Autologous HSCT within 2 months prior to the first study drug dose.        * Allogeneic HSCT within 3 months prior to the first study drug dose.     4. IMMUNOTHERAPY: At least 42 days must have elapsed after the completion of any type of immunotherapy other than monoclonal antibodies (e.g. CAR-T therapy)     5. MONOCLONAL ANTIBODIES AND INVESTIGATIONAL DRUGS: At least 21 days or 5 times the half-life (whichever is shorter) from prior treatment with monoclonal antibodies or any investigational drug under investigation must have elapsed before the first study drug.     6. SURGERY: Major surgery within 21 days of the first dose. Gastrostomy, ventriculo-peritoneal shunt, endoscopic ventriculostomy, tumor biopsy and insertion of central venous access devices are not considered major surgery.", "description": "HEM-iSMART is a master protocol which investigates multiple investigational medicinal products in children, adolescents and young adults (AYA) with relapsed/refractory (R/R) ALL and LBL. Sub-protocol B is a phase I/II trial evaluating the safety and efficacy of dasatinib + venetocolax in combination with dexamethasone + Cyclophosphamide and cytarabine in children and AYA with R/R ped ALL/LBL whose tumor present with alterations in the MAPK/SRC pathway.", "title": "International Proof of Concept Therapeutic Stratification Trial of Molecular Anomalies in Relapsed or Refractory HEMatological Malignancies in Children, Sub-protocol B Dasatinib + Venetoclax + Dexamethasone + Cyclophosphamide and Cytarabine in Pediatric Patients With Relapsed or Refractory Hematological Malignancies", "url": "https://ClinicalTrials.gov/show/NCT05751044", "enrollment": "26", "max_age": "21.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05751044", "locations": ["Netherlands"], "min_age": "1.0", "outcome_measures": ["Phase I: Maximum tolerated dose (MTD) / Recommended phase 2 dose (RP2D).; 3 years", "Phase II: Best Overall Response Rate (ORR).; 6 years", "Phase II: Best Overall Response Rate (ORR).; 6 years", "Phase I: Maximum tolerated dose (MTD) / Recommended phase 2 dose (RP2D).; 3 years"], "phases": ["PHASE1", "PHASE2"], "status": "NOT_YET_RECRUITING", "start_date": "2023-10-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Older Adult patients (greater than or equal to 60 years of age) * New diagnosis of acute myeloid leukemia (AML) * Receiving induction therapy (intensive or low intensity therapy) * Willing and able to provide written informed consent  Exclusion Criteria:  * Presence of a pacemaker or defibrillator. * Participants who are pregnant at the time of enrollment. * Anyone unable/unwilling to follow protocol requirements", "description": "This study will explore how malnutrition (poor nutrition/diet) and sarcopenia (a condition that causes a loss of muscle and bone mass) affects study participants over the age of 60 with acute myeloid leukemia (AML) who will receive induction chemotherapy (chemotherapy given as the first treatment to help cancer go into remission) and/or cancer drugs as part of standard care for AML. By studying how these nutritional and skeletal factors, doctors leading this study hope to learn how malnutrition and sarcopenia may be able to predict certain outcomes --such as how long study participants with poor nutrition and muscle loss can live after chemotherapy- for older (age 60+) individuals with AML.", "title": "Investigating The Prognostic Significance Of Malnutrition And Sarcopenia In Older Adults With Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05458258", "enrollment": "82", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "", "name": "NCT05458258", "locations": [""], "min_age": "60.0", "outcome_measures": ["Treatment-Related Mortality Rates Based on Incidence of Sarcopenia in All Study Participants; 60 days", "Treatment-Related Mortality Rates Based on Incidence of Sarcopenia in All Study Participants; 60 days"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-10-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient has the ability to provide informed consent according to the applicable regulatory and local institutional requirements * Male or female, aged ≥18 and \\<55 years for patients receiving MAC (Regimen A or Regimen B); aged ≥18 and \\<70 years for patients receiving RIC (Regimen C in Cohort 2 only) * Patient must require allogeneic HCT per the discretion of the treating physician * Patient must be high-resolution, HLA partially or fully matched (4-8/8 allele matched at HLA-A, -B, -C, DRB1) to an available Ossium HPC, Marrow product * Stated willingness to comply with all study procedures and availability for the duration of the study * Diagnosed with acute leukemia \\[acute lymphoblastic leukemia (ALL), acute myeloid leukemia (AML), acute biophenotypic leukemia (ABL), or acute undifferentiated leukemia (AUL)\\] in the first remission or beyond with ≤5% marrow blasts and no circulating blasts or extra-medullary disease documented by bone marrow assessment within 42 days prior to anticipated start of conditioning * Karnofsky performance status score ≥70% (MAC) or ≥60% (RIC) * HCT comorbidity index (HCT-CI) \\<5 * Adequate organ function defined as:    1. Cardiac: LVEF at rest ≥45% (RIC) or LVEF at rest ≥40% (MAC)   2. Pulmonary: DLCO, FEV1, FVC ≥50% predicted by pulmonary function tests (PFTs). DLCO value may be corrected for hemoglobin.   3. Hepatic: total bilirubin ≤2.0 mg/dL, and ALT, AST, and ALP \\<3 x upper limit normal (ULN), unless ALT, AST, and/or ALP are disease related   4. Renal: SCr within 1.5x normal range for age. If SCr is outside normal range for age, CrCl\\> 60 mL/min/1.73m2 must be obtained (measured by 24-hour urine specimen or nuclear glomerular filtration rate (GFR), or calculated GFR (by Cockcroft-Gault formula))  Exclusion Criteria:  * Availability of suitable graft from living donor (defined as 7/8 or 8/8 HLA-matched related or unrelated donors, haploidentical donors, or cord blood donors) * Prior autologous or allogeneic HCT * Pregnancy or lactation * Ongoing treatment with an investigational drug used for disease-related treatment within 5 half-lives of the drug * Current uncontrolled bacterial, viral or fungal infection defined as currently taking medication with evidence of progression of clinical symptoms or radiologic findings * Any condition(s) or diagnosis, both physical or psychological, or physical exam finding that in the investigator's opinion precludes participation", "description": "The goal of this clinical trial is to determine the safety and feasibility of allogeneic transplantation with bone marrow from a deceased donor in patients with acute leukemias. Patients will either receive myeloablative conditioning or reduced intensity conditioning regimen prior to the transplant. Patients will be followed for 56 days for safety endpoints and remain in follow-up for one year.", "title": "A First-in-Human Study of HLA-Partially to Fully Matched Allogenic Cryopreserved Deceased Donor Bone Marrow Transplantation for Patients With Hematologic Malignancies", "url": "https://ClinicalTrials.gov/show/NCT05589896", "enrollment": "12", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05589896", "locations": [""], "min_age": "18.0", "outcome_measures": ["Neutrophil Engraftment; Day 28", "Serious Adverse Events; Day 56", "CTCAE Grade 3/4 Adverse Events (AEs); Day 56", "CTCAE Grade 3 or higher infusion-related toxicity; Day 56", "Death; Day 56", "Death; Day 56", "CTCAE Grade 3 or higher infusion-related toxicity; Day 56", "CTCAE Grade 3/4 Adverse Events (AEs); Day 56", "Neutrophil Engraftment; Day 28", "Serious Adverse Events; Day 56"], "phases": ["PHASE1", "PHASE2"], "status": "NOT_YET_RECRUITING", "start_date": "2023-03"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Relapsed or refractory B-precursor ALL defined as one of the following:    * Primary refractory disease (\\>=5% blasts or persistent extramedullary disease following induction therapy)   * First or later relapse of marrow or extramedullary disease   * Persistence of MRD defined as detectable ALL by flow cytometry, PCR, or next-generation sequencing   * Relapsed or refractory disease after allogeneic transplant provided individual is at least 100 days from transplant at time of enrollment   * Patients with isolated, asymptomatic CNS relapse will be eligible      * Age \\>=18 years     * Eastern cooperative oncology group (ECOG) performance status of 0-2     * Adequate renal, hepatic, pulmonary and cardiac function defined as:   * Creatinine clearance (as estimated by Cockcroft Gault) ≥ 60 cc/min   * Serum alanine aminotransferase (ALT)/aspartate aminotransferase (AST) ≤ 2.5 x upper limit of normal (ULN)   * Total bilirubin ≤ 1.5 mg/dl, except in individuals with Gilbert's syndrome.   * Cardiac ejection fraction ≥ 50%, no evidence of clinically significant pericardial effusion, and no clinically significant arrhythmias   * Baseline oxygen saturation \\> 92% on room air   * QTc ≤ 500ms      * In individuals previously treated with blinatumomab, CD19 tumor expression in bone marrow or peripheral blood by flow cytometry or extramedullary site by IHC or flow cytometry     * Negative serum or urine beta-HCG test in females of childbearing potential within 3 weeks of enrollment     * Subjects of childbearing or child fathering potential must be willing to practice birth control from the time of enrollment on this study Page 10 of 83 Version 1.0 dated 27-April-2023 and for six (6) months after receiving the preparative conditioning regimen.     * Must be able to give informed consent. Legal authorized representative (LAR) is permitted if subject is cognitively able to provide verbal assent.  Exclusion Criteria:  * History of dasatinib intolerance * Known sensitivity or allergy to aminoglycosides or any agents/reagents used in this study * Blast count \\> 75% in the bone marrow. * History of malignancy other than non-melanoma skin cancer or carcinoma in situ (e.g. cervix, bladder, breast) unless disease free for at least 2 years * Presence of CNS-3 disease with neurological changes * History or presence of any CNS disorder such as a seizure disorder, cerebrovascular ischemia/hemorrhage with clinical signs or symptoms * History of concomitant genetic syndrome such as Fanconi anemia, Kostmann syndrome, Shwachman-Diamond or any known bone marrow failure syndrome * History of myocardial infarction, cardiac angioplasty or stenting, unstable angina, or other clinically significant cardiac disease within 12 months of enrollment * Primary immunodeficiency * Known infection with HIV, hepatitis B (HBsAg positive) or untreated hepatitis C virus * Presence of fungal, bacterial, viral, or other infection that is uncontrolled or requiring IV antimicrobials for management. * Salvage chemotherapy including TKIs for Ph+ ALL within 1 week prior to enrollment * Pregnant or breast feeding * Patients with known autoimmune disease requiring the use of systemic immunosuppressive therapy within the last year * Corticosteroid therapy within 7 days prior to enrollment * Acute or chronic GVHD requiring systemic treatment within 4 weeks prior to enrollment * Live vaccine ≤ 4 weeks prior to enrollment * Any medical condition that in the judgement of the investigator is likely to interfere with assessment of safety or efficacy of study treatment", "description": "To assess the feasibility of oral dasatinib pulses (3 consecutive days per week) during the first month following infusion of brexucabtagene autoleucel (Tecartus) in adults with relapsed or refractory B-cell acute lymphoblastic leukemia.", "title": "Phase 1b Study of Brexucabtagene Autoleucel Plus Dasatinib in Adults With Acute Lymphoblastic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05993949", "enrollment": "20", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05993949", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Feasibility of dasatinib pulses; 1 month", "Feasibility of dasatinib pulses; 1 month"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2023-10-02"}
{"study_results": "False", "gender": "ALL", "criteria": "Key Inclusion Criteria:  * Males and females (of non-childbearing potential) aged ≥18 years * Relapsed or refractory acute leukemia, including participants who are MRD-positive by multiparametric flow cytometry or next-generation sequencing, and including participants with isolated extramedullary disease. * Previously received standard of care therapy * Eastern Cooperative Oncology Group (ECOG) performance status score of 0 to 2 * Adequate liver and cardiac function * Fertile males agree to use barrier contraception from the time of enrollment through 120 days after the last study drug dose  Key Exclusion Criteria:  * Active diagnosis of acute promyelocytic leukemia * White blood cell (WBC) count \\>25,000/microliters at time of enrollment. * Detectable human immunodeficiency virus viral load within the previous 6 months * Hepatitis B or Hepatitis C * Cardiac, gastrointestinal, or graft-versus-host disease (GVHD) * History of or any concurrent condition, therapy, laboratory abnormality, or allergy to excipients that might confound the results of the study, interfere with the participant's ability to participate for the full duration of the study, or not be in the best interest of the participant to participate * Must not be receiving any moderate or strong cytochrome P450 3A4 (CYP3A4) inhibitor/inducers * Any commercially available or investigational antileukemic therapy other than SNDX-5613 except for short-term administration of corticosteroids and/or hydroxyurea for cytoreduction * Participation in another therapeutic interventional clinical study in which an investigational agent was administered within 30 days before starting SNDX-5613 * Any concurrent systemic treatment to prevent GVHD", "description": "This is an open-label study to evaluate the absorption, metabolism, and excretion (AME) of carbon-14 (\\[14C\\])-SNDX-5613 in participants with acute leukemia.", "title": "A Phase 1, Open-label Study to Assess the Mass Balance, Pharmacokinetics, and Metabolism of Orally Administered [14C]-SNDX-5613 in Patients With Relapsed/Refractory Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05406817", "enrollment": "8", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05406817", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Percentage of Dose Excreted in Urine (feu); Up to Day 11", "Percentage of Dose Excreted in Feces (fef); Up to Day 11", "Amount Excreted in Urine (Aeu); Up to Day 11", "Amount Excreted in Feces (Aef); Up to Day 11", "Area Under The Concentration Time Curve from Time 0 to The Last Measurable Concentration (AUC0-t); Up to Day 21", "Maximum Observed Concentration (Cmax); Up to Day 21", "Percentage of Dose Excreted in Feces (fef); Up to Day 11", "Maximum Observed Concentration (Cmax); Up to Day 21", "Percentage of Dose Excreted in Urine (feu); Up to Day 11", "Area Under The Concentration Time Curve from Time 0 to The Last Measurable Concentration (AUC0-t); Up to Day 21", "Amount Excreted in Urine (Aeu); Up to Day 11", "Amount Excreted in Feces (Aef); Up to Day 11"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2022-08-05"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * approval to sign an informed written consent, patient with newly diagnosed AL.  Exclusion Criteria:  * Refusal to sign an informed written consent, Cases with Chronic leukemias, Lymphoma or Leukemic phase of lymphoma or patients on chemotherapy.", "description": "The leukaemias are a heterogeneous group of blood cancers, Acute leukaemia (AL) is caused by malignant proliferation of blood cells arrested at an immature stage of development, They are very aggressive diseases that run a rapidly fatal course if not promptly diagnosed and appropriately treated. Misdiagnosis is very common with delay in diagnosis and prompt treatment being the causes of high morbidity and mortality in acute leukaemias.  Although with the continuous improvement of clinical and laboratory diagnosis and treatment methods, the prognosis of AML has been significantly improved, but there are still about 70% of patients who cannot survive more than 5 years after diagnosis The activity of miRNAs in tumors is regulated by the same alterations affecting protein-coding genes, such as chromosomal rearrangements, genomic amplifications or deletions or mutations, abnormal transcriptional control, dysregulation of epigenetic changes and defects in the biogenesis machinery A typical chromosomal rearrangement is a chromosomal translocation, especially in hematological malignancies, in which it promotes tumor development and progression by the promoter exchange or by the creation of chimeric genes translated as fusion proteins. In Acute Myeloid Leukemia (AML) patients with myeloid/lymphoid leukemia gene (or mixed-lineage leukemia, MLL) rearrangement, by large-scale genome-wide microarray analysis, it was demonstrated that among 48 selected miRNAs, 47 of them are increased", "title": "Study of miRNA-155 in Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05809050", "enrollment": "50", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "PROBABILITY_SAMPLE", "healthy_volunteers": "True", "name": "NCT05809050", "locations": [""], "min_age": 0, "outcome_measures": ["Detection of miRNA-155; one year"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-04"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Adult Patients(above 18 years) diagnosed as acute myeloid leukemia according to WHO diagnostic criteria  Exclusion Criteria:  * Patients with other types of leukemia", "description": "1. to assess the frequency of acute myeloid leukemia at clinical Haematology unit of Assiute university hospital 2. to study correlations of known risk factors and if there are new risk factors participate in increasing frequency of acute myeloid leukemia", "title": "Frequency and Risk Factors of Acute Myeloid Leukemia at Clinical Haemtology Unit of Assiut University Hospital", "url": "https://ClinicalTrials.gov/show/NCT05787951", "enrollment": "200", "max_age": "80.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05787951", "locations": [""], "min_age": "18.0", "outcome_measures": ["Frequency of acute myeloid leukemia at clinical Haemtology unit of Assiute university hospital; Two years", "Frequency of acute myeloid leukemia at clinical Haemtology unit of Assiute university hospital; Two years"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-05-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient is ≤ 365 days of age at the time of diagnosis. * Patient has newly diagnosed CD19 positive acute lymphoblastic leukemia (ALL) or acute undifferentiated leukemia with ≥25% blasts in the bone marrow (M3), with or without extramedullary disease. Patients with CD19 positive biphenotypic acute leukemia are eligible. Patients with CD19 positive mature B-cell ALL that carry a KMT2Ar are eligible. * Limited prior therapy, including hydroxyurea for 72 hours or less, systemic glucocorticoids for one week or less, cytarabine for 72 hours or less, one dose of vincristine, and one dose of intrathecal chemotherapy. * Written informed consent following Institutional Review Board, NCI, FDA, and OHRP Guidelines.  Exclusion Criteria:  * Patients with prior therapy, other than therapy specified in inclusion criteria. * Patients with mature B-cell ALL that does not have a KMT2Ar or patients with acute myelogenous (AML) or T-cell ALL. * Patients with Down syndrome. * Inability or unwillingness of legal guardian/representative to give written informed consent", "description": "The purpose of this study is to improve upon the TINI study treatment. The study will test the ability of a type of immunotherapy called blinatumomab to clear persistent leukemia. Blinatumomab targets CD19 which is located on the leukemia cells outer membrane.", "title": "TINI 2: Total Therapy for Infants With Acute Lymphoblastic Leukemia II", "url": "https://ClinicalTrials.gov/show/NCT05848687", "enrollment": "90", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05848687", "locations": ["United States"], "min_age": "1.0", "outcome_measures": ["Minimal Residual Disease; 5 years and 2 months", "Minimal Residual Disease; 5 years and 2 months"], "phases": ["PHASE1", "PHASE2"], "status": "NOT_YET_RECRUITING", "start_date": "2023-11-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Must be a newly diagnosed and untreated patient with Ph+ B-cell Acute Lymphoblastic Leukemia and CD22 expression on ≥20% of blasts. 2. 18 years old or older. 3. Bone marrow involvement with ≥20% lymphoblasts and demonstration of BCR-ABL1 via fluorescence in situ hybridization (FISH) studies or PCR-based testing. Patients with \\>1000/mm3 lymphoblasts in the peripheral blood that cannot undergo bone marrow biopsy and aspiration due to clinical condition are also eligible. 4. Eastern Cooperative Oncology Group (ECOG) performance status 0-2. 5. Adequate organ function as confirmed by clinical/medical record. 6. Patients must be at least 2 weeks from major surgery, radiation therapy, or participation in other investigational trials, and must have recovered from clinically significant toxicities related to these prior treatments. 7. Patients must voluntarily sign and date an informed consent, approved by an Independent Ethics Committee/Institutional Review Board prior to starting any screening or study-specific procedures. 8. Females of childbearing potential will use effective contraception during treatment with InO and for at least 8 months after the last dose. Males with female partners of reproductive potential will use effective contraception during treatment with Inotuzumab Ozogamicin and for at least 5 months after the last dose. A patient is of childbearing potential if, in the opinion of the treating investigator, he/she is biologically capable of having children and is sexually active. Female patients who are not of childbearing potential (ie, meet at least one of the following criteria):     a. Have undergone hysterectomy or bilateral oophorectomy; or have medically confirmed ovarian failure; or are medically confirmed to be post-menopausal (cessation of regular menses for at least 12 consecutive months with no alternative pathological or physiological cause). 9. Patients who are willing and able to comply with scheduled visits, treatment plan, laboratory tests, and other study procedures.  Exclusion Criteria:  1. Isolated extramedullary disease. 2. Burkitt's or mixed-lineage leukemia. 3. Active central nervous system (CNS) leukemia. 4. Any prior therapy for ALL except for limited treatment (≤ 7 days) with corticosteroids or hydroxyurea and a single dose of intrathecal therapy. Patients who are being treated with chronic steroids for other reasons (eg, asthma, autoimmune disorders) are eligible. 5. Current or chronic hepatitis B or C infection as evidenced by hepatitis B surface antigen and anti-hepatitis C antibody positivity, respectively, or known seropositivity for human immunodeficiency virus (HIV). HIV testing may need to be performed in accordance with local regulations or local practice. Patients with HIV but an undetectable viral load are eligible for enrollment 6. Major surgery within ≤ 2 weeks before randomization. 7. Unstable or severe uncontrolled medical condition (eg, unstable cardiac function or unstable pulmonary condition. 8. Concurrent active malignancy other than non-melanoma skin cancer, carcinoma in situ of the cervix, or localized prostate cancer that has been definitely treated with radiation or surgery. Patients with previous malignancies are eligible provided that they have been disease free for ≥2 years or are not currently requiring treatment. 9. Uncontrolled cardiac disease. 10. QTcF \\> 500 msec (based on the average of 3 consecutive ECGs). 11. History of chronic liver disease (eg, cirrhosis) or suspected alcohol abuse. 12. History of hepatic veno-occlusive disease (VOD) or sinusoidal obstruction syndrome (SOS). 13. Evidence of uncontrolled current serious active infection including sepsis, bacteremia, fungemia, or patients with a recent history (within 4 months) of deep tissue infections such as fasciitis or osteomyelitis. 14. Medications known to predispose to Torsades de Pointes are prohibited throughout the treatment period of the study. 15. Pregnant females; breastfeeding females; males with female partners of reproductive potential and females of childbearing potential not using highly effective contraception or not agreeing to continue highly effective contraception for a minimum of 5 months after the last dose of investigational product if male and 8 months after the last dose of investigational product if female. 16. Patients who are investigational site staff members or relatives of those site staff members or patients who are Pfizer employees directly involved in the conduct of the trial. 17. Participation in other investigational studies during active treatment phase. 18. Other severe acute, chronic medical, psychiatric condition, or laboratory abnormality that may increase the risk associated with study participation or investigational product administration or may interfere with the interpretation of study results and, in the judgment of the Study Lead Principal Investigator, would make the patient inappropriate for entry into this study.", "description": "This research study will add an anti-cancer drug (called inotuzumab ozogamicin also known as \"InO\") to treatment for participants with newly diagnosed Philadelphia chromosome-positive (Ph+) acute lymphoblastic leukemia (ALL). Doctors leading this study hope to learn if adding InO to standard induction treatment for Ph+ ALL will lead to quicker, complete molecular remission (where the disease is not detectable even with very sensitive testing techniques). The purpose of this research is to gather information regarding the effectiveness of InO in newly-diagnosed Ph+ ALL patients that have not yet received treatment.", "title": "A Phase II Study of a Chemotherapy-Free Induction Regimen for Ph+ Acute Lymphoblastic Leukemia (ALL) Incorporating Inotuzumab Ozogamicin (InO)", "url": "https://ClinicalTrials.gov/show/NCT04747912", "enrollment": "25", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04747912", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Number of Participants Who Enter Complete Clinical Remission at 60 Days as Defined by Criteria Set By The International Scale; 60 days", "Number of Participants Who Enter Complete Clinical Remission at 60 Days as Defined by Criteria Set By The International Scale; 60 days"], "phases": ["PHASE2"], "status": "RECRUITING", "start_date": "2021-03-02"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion criteria:  * Patients aged 18 or above * Acute promyelocytic leukaemia with PML/RARA * Acute myeloid leukaemia with variant RARA translocation  Exclusion criteria:  -Acute myeloid leukaemia without PML/RARA or variant RARA translocation", "description": "There is currently lack of collaborative data on the epidemiology, clinicopathologic features and treatment outcome of newly diagnosed and relapsed APL in Asia. In addition, there is lack of data comparing oral- As2O3-based regimens with other treatment approaches, including intravenous As2O3,in the frontline or relapsed setting. With the long-term data of oral-As2O3 based regimen for APL available from Hong Kong, retrospective and prospective comparison with other treatment approaches in other Asian countries will generate important information to pave the way for widespread application of oral-As2O3 outside Hong Kong.", "title": "The Acute Promyelocytic Leukaemia Asian Consortium (APL-AC) Project", "url": "https://ClinicalTrials.gov/show/NCT04251754", "enrollment": "1000", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT04251754", "locations": ["Hong Kong"], "min_age": 0, "outcome_measures": ["Survivals; 60 months"], "phases": ["NA"], "start_date": "2020-02-02", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patients diagnosed with new or recurrent myeloid leukemia * Aged \\>= 18 years old * Eastern Cooperative Oncology Group (ECOG) performance status \\< 4 * Patient have measurable and amenable to biopsy under local anesthesia without the need for imaging directed procedure * Ability to understand and provide signed informed consent * Females must be surgically or biologically sterile or postmenopausal (amenorrhoeic for at least 12 months) or if of childbearing potential, must have a negative serum or urine pregnancy test within 72 hours before the start of the treatment. Women of childbearing potential must agree to use an adequate method of contraception during the study and until the last radiation treatment. Males must be surgically or biologically sterile or agree to use an adequate method of contraception during the study and until the last radiation treatment  Exclusion Criteria:  * Patients who are unwilling to participate * Patients unwilling to undergo the biopsy before or after radiotherapy", "description": "This clinical trial assesses how the immune system responds to leukemia tumors after low dose radiation delivered as part of standard of care. The information learned in this study may help them know if adding immunotherapy (a type of treatment that uses the immune system to fight cancer) can be helpful in future leukemia patients receiving radiation.", "title": "Anti-Leukemia Immune Responses After Irradiation of Extramedullary Tumors", "url": "https://ClinicalTrials.gov/show/NCT05035706", "enrollment": "10", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05035706", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Changes in anti-leukemia immune responses; Through study completion, an average of 1 year"], "phases": ["EARLY_PHASE1"], "status": "RECRUITING", "start_date": "2021-06-30"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Chronic Myeloid Leukemia or Phi+ ALL patients with TKI resistance mutations being monitored by the Clinical Cytology and Cytogenetics Laboratory at Nîmes University Hospital. * Pathology resulting from a BcrAbl1 fusion gene (CML or Phi+ ALL) and presence of a TKI resistance mutation. * Patients affiliated to or beneficiaries of a health insurance scheme. * Adult patients over18 years of age.  Exclusion Criteria:  * Blast crisis stage pathology (according to WHO 2017 criteria (Table2.01, p33, WHO classification of tumours of haematopoietic and lymphoid tissues, IARC 2017). * Patients Under 18 years of age", "description": "The aim of this project is to test whether low levels of BcrAbl1, despite the presence of resistance mutations, are related to high levels of innate CD8+ T cells, in the hypothesis that these cells have an anti-tumor role. This research aims to investigate:  * An association between the rate of innate CD8+ T cells and the evolution of Phi+ pathologies (Chronic Myeloid Leukemia and Philadelphia chromosome-positive Acute lymphocytic leukemia (Phi+ ALL) carrying a resistance mutation, according to the ELN 2013 and Phi LMC recommendations. * An association between the level of innate CD8+ T cells and the expansion of TKI resistance clones, assessed as the number of BcrAbl1 copies carrying the mutation relative to the number of Abl1 copies.", "title": "Search for an Association Between the Innate CD8+ T Cell Population and the Evolution of TKI (Tyrosine Kinase Inhibitor) Resistance Mutations in Phi+ Hematological Malignancies.", "url": "https://ClinicalTrials.gov/show/NCT04965649", "enrollment": "30", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT04965649", "locations": ["France"], "min_age": "18.0", "outcome_measures": ["Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: mutated BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: % of BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: % of innate CD8+ T cells; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:mutated BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:% of BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:% of innate CD8+ T cells; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:% of BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:mutated BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: % of BcrAbl1; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Philadelphia+ Acute Lymphoblastic Leukemia:% of innate CD8+ T cells; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: % of innate CD8+ T cells; 1-6 months after collecting last sample", "Association between innate CD8+ T cell population levels and the rate of progression of TKI resistance mutations in Chronic Myeloid Leukemia: mutated BcrAbl1; 1-6 months after collecting last sample"], "phases": ["NA"], "start_date": "2021-01-01", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. patients from 6 to 18 years old 2. diagnosis of acute lymphoblastic leukemia during chemotherapy 3. patients of the same age without hematological diseases  Exclusion Criteria:  1. patients less then 6, and older then 18 years old 2. patients who cannot perform the study MRI without general anesthesia", "description": "The study is aimed at assessing changes in the bone marrow of patients from 6 to 18 years old with a diagnosis of acute lymphoblastic leukemia during chemotherapy. Patients of the same age without hematological diseases will be recruited as a control group.", "title": "Clinical Pilot Study of Quantitative MRI Assessment of Bone Marrow in Patients With Acute Lymphoblastic Leukemia and Patients Without Hematopoietic Disorders, From 6 to 18 Years Old", "url": "https://ClinicalTrials.gov/show/NCT04767165", "enrollment": "150", "max_age": "18.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "True", "name": "NCT04767165", "locations": ["Russian Federation"], "min_age": "6.0", "outcome_measures": ["Dynamics of Bone marrow fat fraction; Point 1. Before the start of therapy - the starting point.", "Dynamics of Bone marrow fat fraction; Point 2. 15 ± 3 days after the start of the therapy.", "Dynamics of Bone marrow fat fraction; Point 3. 36 ± 3 days after the start of the therapy.", "Dynamics of Bone marrow fat fraction; Point 4. through study completion, an average of 2 year", "Dynamics of Bone marrow fat fraction; Point 4. through study completion, an average of 2 year", "Dynamics of Bone marrow fat fraction; Point 1. Before the start of therapy - the starting point.", "Dynamics of Bone marrow fat fraction; Point 3. 36 ± 3 days after the start of the therapy.", "Dynamics of Bone marrow fat fraction; Point 2. 15 ± 3 days after the start of the therapy."], "phases": ["NA"], "status": "RECRUITING", "start_date": "2021-02-22"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Ages 16-65 years inclusive. * Diagnosed as acute leukemia, planning to receive haplo-HSCT * Eastern Cooperative Oncology Group (ECOG) Performance status 0-2 * Presence of an available haploidentical donor * Signing written informed consent and agreeing with taking designated umbilical cord blood  Exclusion Criteria:  * Uncontrolled infections less than 4 weeks prior to enrollment * Secondary malignancy * Psychiatric illness that would limit compliance with study requirements * Impairment of heart, hepatic or renal function to such an extent that the patient, in the opinion of the investigator, will be exposed to an excessive risk if entered into this clinical study * Allergic to blood products * Other causes which are not suitable for the trial in investigator's consideration", "description": "Allogeneic stem cell transplantation (Allo-HSCT) is the effective and even the only treatment option for acute leukemia. The haplo-hematopoietic stem cell transplantation(haplo-HSCT) and \"GIAC\" protocol have crossed HLA barrier and helped more patients find donors. However, the engraftment failure and incidence of graft-versus-host disease(GVHD) limit the prognosis of patients who receive the haplo-HSCT. It is believed that Combined haploidentical and umbilical cord blood allogeneic stem cell transplantation improved hematopoietic reconstitution and reduced the incidence of GVHD, there is still no consensus about the efficacy and safety of this kind of therapy. This prospective, randomized and controlled study is to investigate the efficacy and safety of Combined haploidentical and umbilical cord blood allogeneic stem cell transplantation", "title": "The Efficacy and Safety of Combined Haploidentical and Umbilical Cord Blood Allogeneic Stem Cell Transplantation in Patients With Acute Leukemia.", "url": "https://ClinicalTrials.gov/show/NCT05335226", "enrollment": "116", "max_age": "65.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05335226", "locations": ["China"], "min_age": "18.0", "outcome_measures": ["Overall survival; 12 months", "Disease free survival; 12 months", "Disease free survival; 12 months", "Overall survival; 12 months"], "phases": ["NA"], "status": "RECRUITING", "start_date": "2022-06-06"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient managed and treated with a diagnosis of acute lymphoblastic leukemia * Patient between 1 and 10 years of age * Patient with pain at inclusion, or pain at diagnosis related to leukemia * Social security affiliation or entitlement * Signature of informed consent by both parents  Exclusion Criteria:  * No pain reported at the time of management or diagnosis * Surgery less than 30 days old * Patient with another contraindication to osteopathic treatment (worsening of the condition, bleeding syndrome), or a psychiatric pathology that prevents the scales from being used.", "description": "During the curative treatment of cancer, pain often remains the dominant symptom affecting the physical and psychological state of the patient.  Osteopathy is an exclusively manual practice whose goal is to compensate for mobility dysfunctions of the tissues of the human body. It can be used as a complementary treatment for cancer pain when pain medications are not enough.  The aim of this study is to examine the effectiveness of osteopathy in reducing pain intensity and improving quality of life in patients treated for pediatric acute lymphoblastic leukemia.", "title": "Efficacy of Osteopathic Treatment on the Side Effects of Curative Treatments of Lymphoblastic Leukemia in Pediatrics", "url": "https://ClinicalTrials.gov/show/NCT05664230", "enrollment": "15", "max_age": "10.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05664230", "locations": ["France"], "min_age": "1.0", "outcome_measures": ["Evaluate the effectiveness of 5 weekly osteopathy sessions at regular intervals from week 1 to week 5 on the characteristics of the pain felt in patients aged 1 to 10 years treated for acute lymphoblastic leukemia using the HEDEN scale.; 5 weeks", "Evaluate the effectiveness of 5 weekly osteopathy sessions at regular intervals from week 1 to week 5 on the characteristics of the pain felt in patients aged 1 to 10 years treated for acute lymphoblastic leukemia using the HEDEN scale.; 5 weeks"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-01-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. The patients meet the diagnostic criteria for acute leukemia(except APL). 2. Expecting life span is more than 3 months. 3. The patients intended allogeneic hematopoietic stem cell transplantation.  Exclusion Criteria:  1. Previously received doxorubicin or other anthracycline therapy, the total cumulative dose of doxorubicin≥360 mg/m2. 2. Cardiac function and disease meet one of the following conditions:     1. Long QTc syndrome or QTc intervalgt≥480 ms;    2. Complete left bundle branch block, grade II or III Degree atrioventricular block;    3. Severe, uncontrolled arrhythmia requiring drug treatment;    4. New York Society of Cardiology class ≥ II;    5. Cardiac ejection fraction (LVEF) lower than 50% or lower than the study The lower limit of the central laboratory test value range;    6. History of myocardial infarction, unstable angina, severe unstable ventricular arrhythmia or any other arrhythmia requiring treatment, clinically serious pericardial disease history within 6 months before recruitment, or ECG evidence of acute ischemia or active conduction system abnormalities. 3. Alanine aminotransferase (AST) and aspartate aminotransferase (ALT) \\> 2.5 times the upper limit of normal (ULN); Total bilirubin \\> 1.5 times upper limit of normal; Serum creatinine \\> 1.5 times the upper limit of normal. 4. Suffering from other malignant tumors in the past or at the same time ; 5. Exclude patients with severe active infection or other underlying diseases who cannot tolerate chemotherapy; 6. Human immunodeficiency virus (HIV) infected patients (HIV antibody positive); 7. Active hepatitis B and C infection； 8. Pregnant women, lactating women, and patients who refuse to take effective contraceptive measures during the study; 9. Severe mental disorders who do not cooperate with treatment; 10. Judgment by the investigator , There are patients who are not suitable to participate in this study.", "description": "This study intends to evaluate the efficiency and safety of M-PTCy as conditioning regimen in Haploidentical HSCT for Acute Leukemia, so as to provide a new conditioning regimen for allogeneic hematopoietic cell transplantation.", "title": "An Multicenter, Randomized, Controlled, Prospective Clinical Study of Mitoxantrone Liposome Combined With PTCy as Conditioning Regimen in Allo-HSCT in Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05739630", "enrollment": "60", "max_age": "60.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05739630", "locations": ["China"], "min_age": "14.0", "outcome_measures": ["Progression-free survival (PFS); From the 1st day to 2 years after enrollment", "Progression-free survival (PFS); From the 1st day to 2 years after enrollment"], "phases": ["PHASE2", "PHASE3"], "status": "RECRUITING", "start_date": "2023-01-01"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Age \\<18 years at the time of inclusion * Received first-line treatment for ALL or AML * Treatment at a Danish tertiary pediatric oncology unit (Rigshospitalet, Aarhus University Hospital, Odense University Hospital, and Aalborg University Hospital) * Treatment initiation January 1st, 2008, to December 31st, 2022  Exclusion Criteria:  * Not meeting inclusion criteria", "description": "The study aims to evaluate the occurrence, mortality, and risk factors for invasive mold infections (IMI) in children treated with chemotherapy for acute leukemia in Denmark. The study will be a retrospective nationwide survey study of all children who received first-line chemotherapy for acute leukemia from 2008 to 2022 in Danish pediatric oncology units. The study population will include approximately 800 children under the age of 18. Data will be collected from medical records, hospital databases, and national databases. When the IMI subgroup has been identified, this will be compared to the leukemic group that did not develop IMI. Statistical analysis can then determine the occurrence, mortality rate, and possible IMI risk factors.", "title": "Incidence and Risk Factors for Invasive Mold Infections in Children During First-Line Chemotherapy for Primary Acute Leukemia: Protocol for a National Retrospective Cohort Study", "url": "https://ClinicalTrials.gov/show/NCT05774990", "enrollment": "800", "max_age": "17.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05774990", "locations": ["Denmark"], "min_age": 0, "outcome_measures": ["Incidence of invasive mold infection in childhood AML and ALL in Denmark; Up to three years", "Mortality form invasive mold infection in childhood AML and ALL in Denmark.; Up to three years"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-04"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Adults with acute leukemia undergoing allogeneic stem cell transplant. * ECOG performance status 0, 1 or 2. * Adequate Liver function  Exclusion Criteria:  * Known hypersensitivity to rifaximin or other rifampicin antimicrobial agents * Current or past history of inflammatory bowel disease * History of major bowel resection or presence of colostomy. * Ongoing Verapamil, ketoconazole or itraconazole.", "description": "* Goal: This study is a randomized phase II interventional study. The purpose of this study is to see if addition of oral rifaximin tablets during allogeneic stem cell transplant can improve the quality of gut microbiome and reduce chances of death, infections and graft versus host disease (GVHD) post-transplant. * The study objectives are as follows: * Primary Objective: To determine the impact of rifaximin on gut microbial diversity and compare it with controls. * Secondary Objectives: a. To determine non-relapse mortality at 1-year post transplant in patients who receive peri-transplant transplant rifaximin and compare it with controls. * b. To compare the incidence of severe GVHD in patients who receive peri-transplant rifaximin with the controls. * c. To determine impact of gut decontamination with rifaximin on incidence of MDR sepsis and usage of higher antibiotics (e.g. Carbapenems, colistin, tigecycline, ceftazidime avibactum and ceftriaxone-sulbactam EDTA) in first 6 months post BMT. * d. To determine the impact of rifaximin induced gut manipulation on immune reconstitution, T cell repertoire post-transplant and cytokine profile. * Exploratory objective: To use single cell transcriptomics (SCT) to identify immune cell profile in gut biopsies post allogeneic stem cell transplant whenever biopsy is done, to correlate the impact of microbiome on gut immunity. * Intervention: Tab Rifaximin 200 mg will be given orally twice daily from day -8 to day +60 of allogeneic stem cell transplant in acute leukemia patients. This will be in addition to standard of care post-transplant treatment. * Comparator Agent: Standard of care treatment including standard anti GVHD measures, antibiotic support and transfusions as needed.", "title": "Randomized Trial to Study the Effect of Rifaximin on Gut Microbiome Diversity Post Allogeneic Stem Cell Transplant in Acute Leukemia.", "url": "https://ClinicalTrials.gov/show/NCT06058572", "enrollment": "166", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT06058572", "locations": [""], "min_age": "18.0", "outcome_measures": ["Impact of rifaximin on gut microbial diversity.; 14 days post transplant", "Impact of rifaximin on gut microbial diversity.; 14 days post transplant"], "phases": ["PHASE2"], "status": "NOT_YET_RECRUITING", "start_date": "2023-10-15"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * The patient must have a diagnosis of acute lymphoblastic leukemia (ALL) or acute myeloid leukemia (AML). * Stored diagnostic pre-treatment samples corresponding to the patient's original diagnosis of leukemia must be available for request from either the COG Biopathology Center or a treating institution * The patient must be enrolled on APEC14B1 with consent to future contact and indicate that cord blood was stored at birth in the APEC14B1 registry intake data. * The patient must also have been registered with COG by a North American (limited to the U.S. and Canada) member institution. * ≤ 25 years old at the time of original diagnosis with ALL or AML * The patient must be able to understand written and spoken English or Spanish * All patients must provide their consent/assent, as appropriate, and for patients under the age of majority at least one parent or legal guardian must provide consent as well * All institutional, FDA, and NCI requirements for human studies must be met  Exclusion Criteria:  * Patients who responded that cord blood was not stored at birth are excluded. Patients without stored diagnostic, pre-treatment leukemia samples at either the COG Biopathology Center or their treating institution are excluded.", "description": "A comprehensive mechanistic and epidemiological study to obtain banked cord blood samples from consecutive childhood leukemia patients enrolled in the COG Project:EveryChild (APEC14B1) study. Will attempt to backtrack the initiating genomic alteration identified in the matched diagnostic leukemia sample and molecularly characterize pre-leukemic cells. The ultimate goal of this research is to pinpoint the cell of origin of leukemogenic alterations formed in utero, elucidating the etiology of these initiating mutations (as opposed to frank leukemia), and devising a test for circulating pre-leukemia that can be applied on a population-wide basis.", "title": "Backtracking Leukemia-Typical Somatic Mutations in Cord Blood", "url": "https://ClinicalTrials.gov/show/NCT05014165", "enrollment": "300", "max_age": "25.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05014165", "locations": ["United States"], "min_age": 0, "outcome_measures": ["Prevalence of patient-specific somatic alterations found in cord blood in each molecularly-defined subtype of leukemia leukemia patients in Project:EveryChild.; up to 5 years", "Prevalence of patient-specific somatic alterations found in cord blood in each molecularly-defined subtype of leukemia leukemia patients in Project:EveryChild.; up to 5 years"], "phases": ["NA"], "start_date": "2021-07-30", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Written informed consent * Male * not pregnant female * patients \\>=60 years old * Diagnosis of acute leukemia  Exclusion Criteria:  * Pregnancy * HIV positive * patients \\>=100 years old", "description": "This study will monitor CtDNA After Chemotherapy in Elderly Patients With AL", "title": "Monitoring Circulating Tumor DNA After Chemotherapy in Elderly Patients With Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04157569", "enrollment": "200", "max_age": "100.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT04157569", "locations": ["China"], "min_age": "60.0", "outcome_measures": ["cumulative incidence of relapse(CIR); through study completion, an average of 1 year", "cumulative incidence of relapse(CIR); through study completion, an average of 1 year"], "phases": ["NA"], "start_date": "2019-11-05", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Male and female subjects aged ≤ 30 years. First 2 enrolled subjects: age ≥ 18 and ≤ 30 years * Evidence of refractory or recurrent CD22+ leukemia or lymphoma * Able to tolerate apheresis, or subject with sufficient existing apheresis product or T cells for manufacturing investigational product. * Life expectancy ≥ 8 weeks * Lansky or Karnofsky, as applicable, score ≥ 50 * Recovered from acute toxic effects of all prior chemotherapy, immunotherapy, and radiotherapy, if the subject does not have a previously obtained apheresis product that is acceptable and available for manufacturing of CAR T cells * ≥ 7 days post last chemotherapy and biologic therapy, with the exception of intrathecal chemotherapy and maintenance chemotherapy * ≥ 7 days post last corticosteroid therapy * ≥ 3 days post Tyrosine Kinase Inhibitor (TKI) use * ≥ 1 day post hydroxyurea * 30 days post most recent CAR T cell infusion * Adequate organ function * Adequate laboratory values, including absolute lymphocyte count ≥ 100 cells/uL * Subjects of childbearing or child-fathering potential must agree to use highly effective contraception from consent through 12 months following infusion of investigational product on trial * Subject and/or legally authorized representative has signed the informed consent form for this study  Exclusion Criteria:  * Presence of active malignancy other than disease under study * History of symptomatic CNS pathology or ongoing symptomatic CNS pathology * CNS involvement of leukemia or lymphoma that is symptomatic and in the opinion of the investigator, cannot be controlled during the interval between enrollment and CAR T cell infusion * Subjects with uniform expression of CD19 on their malignant cells who are eligible but have not attempted CD19 directed CAR T cell therapy * For subjects having had a previous stem cell transplant: presence of active GVHD, or receiving immunosuppressive therapy for treatment or prevention of GVHD within 4 weeks prior to enrollment * Presence of active severe infection, * Presence of primary immunodeficiency syndrome * Subject has received prior virotherapy * Pregnant or breastfeeding * Subject and/or legally authorized representative unwilling to provide consent/assent for participation in the 15-year follow-up period, required if CAR T cell therapy is administered * Presence of any condition that, in the opinion of the investigator, would prohibit the subject from undergoing treatment under this protocol", "description": "Patients with relapsed or refractory leukemia or lymphoma are often refractory to further chemotherapy. In this study, the investigators will attempt to use T cells obtained directly from the patient, which can be genetically engineered to express a chimeric antigen receptor (CAR). The CAR used in this study can recognize CD22, a protein expressed on the surface of leukemia and lymphoma cells. The phase 1 part of this study will determine the safety and appropriate dose level of these CAR T cells, and the phase 2 part of the study will determine how effective this CAR T cell therapy is. Both patients who have never had prior CAR T cell therapy and those who have had prior CAR T cell therapy may be eligible to participate in this study.", "title": "Pediatric and Young Adult Leukemia Adoptive Therapy (PLAT)-07: A Phase 1/2 Study of CD22-Specific CAR T Cells for CD22+ Leukemia or Lymphoma", "url": "https://ClinicalTrials.gov/show/NCT04571138", "enrollment": "42", "max_age": "30.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04571138", "locations": ["United States"], "min_age": 0, "outcome_measures": ["he adverse events associated with CAR T cell product infusions will be assessed; 28 days post-infusion", "The ability to successfully manufacture SCRI-CAR22v2; 28 days", "The leukemia response to SCRI-CAR22v2 in subjects with relapsed or refractory CD22+ leukemia will be assessed; 28 days post-infusion"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2020-09-25"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * 2-60 years old, all genders; * the first complete remission phase (CR1) of acute leukemia; * planning to receive haplotype PBSCT; * no uncontrolled current infections (new infections, body temperature still above 38 ℃ after treatment with broad-spectrum antibiotics for 72h, except for other non-infectious factors); * no organ failure.  Exclusion Criteria:  * with poor compliance; * with uncontrolled current infections； * pregnancy; * donors with contraindications of mobilization and collection of peripheral blood stem cells; * with mental sickness", "description": "Allogeneic stem cell transplantation (Allo-HSCT) is the effective and even the only treatment for hematological malignancies. The \"GIAC\" protocol established by our center has successfully crossed the HLA barrier in HLA-mismatched/haploidentical HSCT. The protocol entails the following: treating donors with granulocyte colony-stimulating factor (G-CSF) to induce donor immune tolerance, intensified immunologic suppression to both promote engraftment and to prevent GVHD, antithymocyte globulin (ATG) was included for the prophylaxis of GVHD and graft rejection, and combination of G-CSF-primed bone marrow harvest (G-BM) and G-CSF-mobilized peripheral blood stem cell harvest (G-PB) as the source of stem cell grafts. But peripheral blood transplantation is still prevalent. Compared with BM, G-PB is more convenient to collect, and the number of T lymphocytes and CD34+ cells is higher. It is reported that G-PB has a higher implantation rate and even a higher disease-free survival rate in sibiling-identical transplantation compared with BM transplantation, whereas there were also reports with different conclusions. This prospective, one-arm clinical cohort study aims to evaluate the safety and efficacy of haplotype peripheral blood stem cell transplantation (PBSCT) in the treatment of acute leukemia.", "title": "Haploidentical Peripheral Blood Stem Cell Transplantation for Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT03756675", "enrollment": "45", "max_age": "60.0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "", "name": "NCT03756675", "locations": ["China"], "min_age": "2.0", "outcome_measures": ["engraftment rate; one year after transplantation", "engraftment rate; one year after transplantation"], "phases": ["NA"], "start_date": "2018-11-01", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Specimen collected/handled prior to enrollment in accordance with site policies and procedures. 2. Specimen with adequate volume (1 mL) to complete protocol tests. 3. Specimen is leftover PB and BM from routine flow cytometry laboratory testing for having or suspected of having acute leukemia disorders (i.e. AML, BCP-ALL, ALAL, etc.), myelodysplastic syndrome (MDS), other hematological, or non-hematological disorders. 4. Specimen from newly diagnosed or relapsed subject. 5. Only one specimen type (PB or BM) shall be enrolled per given subject. 6. Specimen is stored at room temperature, upon receipt by the site. 7. Specimens are collected in EDTA (K2 or K3) or heparin (sodium or lithium). 8. Age of specimen (BCP ALL T1: time of collection to start of first pre-wash; ALOT, AML T1-T4: time of collection to start of staining): ≤ 24 hours. 9. Specimens are from subjects irrespective of race, gender, and ethnicity  Exclusion Criteria:  1. Specimen is from healthy subject. 2. Specimen from subject \\<3 years of age. 3. Specimen is from subject undergoing any treatment for any form of leukemia. 4. Specimen is from subject with minimal residual disease (MRD) as determined by the site. 5. Specimen is from subject suspected of plasma cell disorders. 6. Visibly clotted specimen. 7. Visibly hemolyzed specimen. 8. Frozen specimen. 9. Refrigerated specimen. 10. Fixed specimen.", "description": "This study is a multi-site, prospective performance study to determine equivalency between the investigational OneFlow Acute Leukemia Panel on the FACSLyric system versus the final clinical diagnosis.", "title": "Evaluation of the BD OneFlow Acute Leukemia Panel (BD OneFlow ALOT, BCP-ALL T1, and AML T1-T4) on the BD FACSLyric Flow Cytometer Using Leftover, De-identified Specimens", "url": "https://ClinicalTrials.gov/show/NCT05035615", "enrollment": "200", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05035615", "locations": ["United States", "Brazil", "United Kingdom", "Spain", "Czechia"], "min_age": "3.0", "outcome_measures": ["Comparison between expert analysts' determination of normal and abnormal specimen and final diagnosis (Sensitivity Analysis); Within 24 Hours of specimen collection", "Comparison between expert analysts' determination of normal and abnormal specimen and final diagnosis (Specificity Analysis); Within 24 Hours of specimen collection"], "phases": ["NA"], "start_date": "2021-11-02", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Newly diagnosed AL (acute myeloid leukemia (AML) and acute lymphocytic leukemia (ALL)) and is recruited within 2 weeks of hospital admission. For patients diagnosed with a mixed phenotype AL, the dominant sub-type must be identified for stratification purposes. * Receiving or expected to receive induction chemotherapy with curative intent at the time of recruitment. * Age ≥ 18 years. * Ability to pass the cognitive screening test at the time of recruitment (Short Orientation-Memory-Concentration Test (SOMC) score ≥ 20), unless deemed suitable at the CRA's discretion (e.g. in extenuating circumstances such as interruptions during the administration of the measure or when patients report a learning disability that can influence the results). * Patient is fluent in English and is able (i.e. sufficiently literate and competent) and willing to complete the baseline questionnaires in English. Ability but unwillingness to complete the baseline questionnaires will make the patient ineligible.  Exclusion Criteria:  * Major communication difficulties at the time of recruitment, as assessed by the research team (e.g. severe hearing impairment or inability to speak). * Receiving on-site (in hospital) psychological/psychiatric counseling at the time of recruitment. * Receiving on-site (in hospital) palliative care services at the time of recruitment. * A diagnosis of acute promyelocytic leukemia and acute leukemia of ambiguous lineage.", "description": "The purpose of this study is to find out whether a novel manualized intervention, called Emotion and Symptom-focused Engagement (EASE), that combines psychological support with symptom screening plus triggered referral to early palliative care for symptom control, reduces psychological distress and physical symptom burden in individuals newly diagnosed with acute leukemia. To do this, half of the participants in this study will receive the usual care offered to patients with acute leukemia and half of the participants will receive usual care plus the EASE intervention.", "title": "Emotion and Symptom-Focused Engagement (EASE): A Multi-Site Randomized Controlled Trial of an Intervention for Individuals With Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04224974", "enrollment": "266", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04224974", "locations": ["Canada"], "min_age": "18.0", "outcome_measures": ["Assess the effect of the EASE intervention compared to usual care to reduce traumatic stress symptoms using the Stanford Acute Stress Reaction questionnaire (SASRQ); 4 weeks", "Assess the effect of the EASE intervention compared to usual care to reduce physical symptom severity using the Memorial Symptom Assessment Scale (MSAS); 4 weeks", "Assess the effect of the EASE intervention compared to usual care to reduce physical symptom severity using the Memorial Symptom Assessment Scale (MSAS); 4 weeks", "Assess the effect of the EASE intervention compared to usual care to reduce traumatic stress symptoms using the Stanford Acute Stress Reaction questionnaire (SASRQ); 4 weeks"], "phases": ["NA"], "status": "RECRUITING", "start_date": "2022-01-06"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  * Patient with AML * Treated with a new targeted oral therapy as monotherapy or in combination:    * Venetoclax\\* in combination with ivosidenib (IDH1 inhibitor)   * Onureg\\* (azacitin: pyrimidine analogue)   * Venetoclax (BCL-2 protein inhibitor) in combination with subcutaneous azacitin * Whose follow-up is provided alternately by a hematologist and an IPA. * Affiliated to a social security scheme  Exclusion Criteria:  * Moderate or severe cognitive impairment * Language barrier * Other communication disorders", "description": "Advanced Practice Nurse (APN) is a new contributor in the French healthcare system. APN is part of a multidisciplinary team and aim to monitor patients under the coordination of the doctor particularly in onco-hematology. The aim of the study is to describe the different perceptions and expectations of APN monitoring according to patients with acute myeloid leukemia (AML) and their care team.  This study will involve 10 patients, recruited over a provisional period of 5 months and 25 member of care team. Patients and their care team will be asked about their perceptions and expectations of APN participation in (AML monitoring) during a semi-structured interviews.", "title": "Implantation of an Advanced Practice Nurse in the Complex Care Pathway of Patients Followed for AML Treated With Oral Targeted Therapy", "url": "https://ClinicalTrials.gov/show/NCT05309018", "enrollment": "35", "max_age": "0", "study_type": "OBSERVATIONAL", "sampling_method": "NON_PROBABILITY_SAMPLE", "healthy_volunteers": "False", "name": "NCT05309018", "locations": [""], "min_age": "18.0", "outcome_measures": ["Perception of patient; Within 1 month", "Perception of patient; Within 1 month"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2024-07-15"}
{"study_results": "False", "gender": "ALL", "criteria": "Patient Inclusion Criteria:  * Subjects in CR must have a history of chemotherapy refractory disease defined as progression or stable disease after one line of chemotherapy, or relapsed disease after achieving prior CR OR must have other high risk ALL features including: CRLF2 rearrangement, Ph-like phenotype, MLL/KMT2a rearrangement, or hypodiploid karyotype. * Subjects with persistent or relapsed minimal residual disease (MRD) (by flow cytometry, PCR, FISH, or next generation sequencing) require verification of MRD in the peripheral blood or bone marrow on two occasions at least 2 weeks apart. * Subjects with active ALL (defined as \\>=5% bone marrow blasts, circulating blasts, or extramedullary disease) are eligible. * Age ≥ 18 and ≤ 65 years (i.e., from age 18 to \\< 66 years old) at the time of enrollment * Eastern cooperative oncology group (ECOG) performance status of 0, 1, or 2; or Karnofsky ≥ 60% * CD19 expression is required any time since diagnosis. CD19 expression may be detected by immunohistochemistry or by flow cytometry. The choice of whether to use flow cytometry or immunohistochemistry will be determined by what is the most easily available tissue sample in each subject. In general, immunohistochemistry will be used for lymph node biopsies, flow cytometry will be used for peripheral blood and bone marrow samples. Patients receiving prior CD19 CAR T cell or blinatumomab are eligible if there is no documented history of CD19 negativity on the malignant cells. * Subjects must have an HLA matched related donor willing to undergo unstimulated apheresis for T cell collection for CAR T cell generation followed by GCSF mobilized apheresis for HSC/Treg graft. * Matched related donor who is an 8/8 match for HLA-A, -B, -C, and -DRB1, all typed using DNA-based high-resolution methods * Subjects must have adequate organ function measured by:    * Cardiac: Cardiac ejection fraction at rest ≥ 45%   * Hepatic:   * Total bilirubin \\< 2 times upper limit of normal (ULN) (patients with Gilbert's syndrome may be included where hemolysis has been excluded and with approval of the study PI)   * ALT/AST \\<= 3 times ULN   * Renal: Calculated creatinine clearance ≥ 50 mL/min or serum creatinine \\< 2.0 mg/dL   * Pulmonary: Diffusing capacity of the lung for carbon monoxide (DLCO) (adjusted for hemoglobin) ≥ 50%   * CNS: Subjects with CNS involvement are eligible as long as there are no overt signs or symptoms that in the evaluation of the investigator would mask or interfere with the neurological assessment of toxicity. * Negative serum or urine beta-HCG test in females of childbearing potential within 3 weeks of registration * Subjects of childbearing or child fathering potential must be willing to practice birth control from the time of enrollment on this study and for twelve (12) months after receiving the preparative conditioning regimen. * Must be able to give informed consent. Legal authorized representative (LAR) is permitted if subject is cognitively able to provide verbal assent.  Donor Inclusion Criteria  * Age ≥ 18 and ≤ 75 years at time of enrollment * Karnofsky performance status of ≥ 70% defined by institutional standards * Willing to donate for two separate apheresis collections (T cells and PBSC) * Matched related donor who is an 8/8 match for HLA-A, -B, -C, and -DRB1, all typed using DNA-based high-resolution methods * Negative serum or urine beta-HCG test in females of childbearing potential within 2 weeks of first apheresis * Seronegative for HIV-1 RNA PCR; HIV 1 and HIV 2 Ab (antibody); HTLV-1 and HTLV-2 Ab; PCR negative or sAg (surface antigen) negative for hepatitis B; negative for the Treponema pallidum antibody Syphilis screen; and negative for HIV-1 and hepatitis C by nucleic acid testing (NAT) within 40 days of donor apheresis procedures. * In the case that T pallidum antibody tests are positive, donors must:    * Be evaluated and show no evidence of syphilis infection of any stage by physical exam and history   * Have completed effective antibiotic therapy to treat syphilis   * Have a documented negative non-treponemal test (such as RPR) or in the case of a positive non-treponemal test must be evaluated by an infectious disease expert to evaluate for alternative causes of test positivity and confirm no evidence of active syphilitic disease  Patient Exclusion Criteria:  * History of other malignancy unless disease free for at least 3 years. At the discretion of the Principal Investigator, subjects in remission for 1-2 years prior to enrollment may be deemed eligible after considering the nature of other malignancy, likelihood of recurrence for one year following therapy, and impact of prior treatment on risk of CD19/CD22-CAR T cells and Treg graft. Subjects in remission \\<1 year are not eligible. The following exceptions apply:    * Nonmelanoma skin cancer or carcinoma in situ (e.g. cervix, bladder, breast) is eligible.   * Hormonal therapy in subjects in remission \\>1 year will be allowed. * Patients who have undergone a prior allogeneic or autologous stem cell transplant. * Recipient positive anti-donor HLA antibodies against a mismatched allele in the selected donor determined by either:    * a positive crossmatch test of any titer (by complement-dependent cytotoxicity or flow cytometric testing), or   * the presence of anti-donor HLA antibody to any of the following HLA loci: HLA-A, -B, -C, -DRB1, -DQB1, -DQA1, -DPB1, or -DPA1, with mean fluorescence intensity (MFI) \\>1000 by solid phase immunoassay * Presence of fungal, bacterial, viral, or other infection that is uncontrolled. Simple UTI and uncomplicated bacterial pharyngitis are permitted if responding to active treatment. * Known history of infection with any of the following: * HIV * Hepatitis B (HBsAg positive) \\*\\* * Hepatitis C virus (anti HCV positive) \\*\\*    \\*\\* A history of hepatitis B or hepatitis C is permitted if the viral load is undetectable per quantitative PCR and/or nucleic acid testing. * Currently receiving corticosteroids or other immunosuppressive therapy. Topical corticosteroids or oral systemic corticosteroid doses less than or equal to 10 mg/day are allowed. * Planned pharmaceutical in vivo or ex vivo T cell depletion, e.g., post-transplant cyclophosphamide (Cy), peri-transplant anti-thymocyte globulin (ATG), or alemtuzumab. For patients that have previously been exposed to a T cell-depleting agent, a 5-half-life washout of the agent must occur prior to planned Transplant Day 0. * Hyperleukocytosis (≥ 50,000 blasts/μL) or rapidly progressive disease that in the estimation of the investigator and sponsor would compromise ability to complete study therapy. * History of myocardial infarction, cardiac angioplasty or stenting, unstable angina, or other clinically significant cardiac disease within 12 months of enrollment. * Pregnant or breast feeding * Patients with known autoimmune disease requiring the use of systemic immunosuppressive therapy within the last year * Presence of a seizure disorder, cerebrovascular ischemia/hemorrhage, dementia, cerebellar disease, or any autoimmune disease with CNS involvement that in the judgment of the investigator may impair the ability to evaluate neurotoxicity. * Any medical condition that in the judgement of the investigator is likely to interfere with assessment of safety or efficacy of study treatment  Donor Exclusion Criteria  * Evidence of active infection * Seropositive for HIV-1 or -2, HTLV-1 or -2 * Positive PCR test results indicating acute or chronic HBV infection. Patients with isolated HBV core antibody positivity will not be excluded. Donors whose HBV infection status cannot be determined conclusively by serologic test results (www.cdc.gov/hepatitis/hbv/pdfs/serologicchartv8.pdf) must be negative for HBV by PCR to be eligible for study participation. * Potential for Zika virus infection as defined as any of the following:    * Medical diagnosis of Zika virus infection in the past 6 months   * Residence in, or travel to, an area with active Zika virus transmission within the past 6 months.   * Unprotected sex within the past 6 months with a person who is known to have either of the risk factors listed above (donor exclusion criterion 5.a or 5.b) * Donors determined to be ineligible based on the results of Zika virus screening may be determined to be eligible if:    o The donor has no signs or symptoms consistent with active Zika virus infection and    o Either of the following is true: i. The donor is a first-degree or second-degree blood relative of the recipient ii. Urgent medical need, meaning no comparable human cell product is available and the recipient is likely to suffer death or serious morbidity without the human cell product, as attested by the Investigator. * Pregnant or breastfeeding female * Medical, physical, or psychological reason that would place the donor at increased risk for complications from growth factor or leukapheresis.", "description": "To assess the safety of administering allogenic, donor-derived CD19/CD22-CAR T cells that meet established release specifications in adults with B-cell ALL following a myeloablative conditioning regimen and Orca-T to determine if this will augment graft versus leukemia without increasing acute GVHD or graft failure.", "title": "Phase I Trial Evaluating the Safety of Myeloablative Conditioning, Orca-T, and Allogeneic, Donor-Derived CD19/CD22-CAR (Chimeric Antigen Receptor) T Cells in Adults With B-Cell Acute Lymphoblastic Leukemia (ALL)", "url": "https://ClinicalTrials.gov/show/NCT05507827", "enrollment": "18", "max_age": "65.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05507827", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Number of patients who received donor CD19/CD22-CAR T cells; 42 days", "Assessment of the donors safety CD19/CD22-CAR T cells plus the Orca-T graft; 42 days", "Assessment of the donors safety CD19/CD22-CAR T cells plus the Orca-T graft; 42 days", "Number of patients who received donor CD19/CD22-CAR T cells; 42 days"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2022-08-18"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Patients aged 18 to 65 years, male or female; 2. Newly diagnosed Philadelphia chromosome positive(either t(9;22) and/or BCR-ABL positive and/ or FISH positive) acute lymphoblastic leukemia; Patients will be diagnosed according to morphologic,immunologic, cytogenetic and molecular(MICM) criteria, including bone marrow morphology, immunophenotype, cytogenetic and molecular genetic (BCR/ABL gene, qualitative and quantitative analysis) examination. 3. Eastern Cooperative Oncology Group (ECOG) Performance status 0-2; 4. Adequate end organ function as defined by: Total bilirubin ≤ 1.5 x upper limit of normal（ULN）; serum alanine aminotransferase (ALT) and serum aspartate aminotransferase (AST) ≤ 2.5 x ULN or ≤5 x ULN if leukemic involvement of the liver is present; Creatinine ≤ 1.5 x ULN; Serum amylase and lipase ≤ 1.5 x ULN; Alkaline phosphatase ≤ 2.5 x ULN unless considered tumor related; normal electrolytes: Potassium ≥ LLN; Magnesium ≥ LLN; Phosphorus ≥ LLN; 5. Cardiac color Doppler ultrasound ejection fraction ≥ 45%; 6. Subject has provided written informed consent prior to any screening procedure;  Exclusion Criteria:  1. Lymphoid blast crisis of chronic myelocytic leukemia (CML); 2. Previous or ongoing systemic anti-ALL therapy (including but not restricted to TKI and/or radiotherapy, except for appropriate pre-treatment); 3. Patients with clinical manifestations of central or extramedullary invasion of leukemia at diagnosis; 4. Identification of T315I mutation; 5. Concurrent participation in another clinical study with an investigational medical product; 6. Any concurrent severe and/or uncontrolled medical condition, which could, in the opinion of the investigator, compromise participation in the study; 7. History of neurological or psychiatric disorders, including epilepsy or dementia; 8. Major surgery within 4 weeks or failure to recover from previous surgery; 9. Patients with a history of another primary malignancy that is currently clinically significant or currently requires active intervention; 10. Female patients who are pregnant or breast feeding or patients of childbearing potential and male patients whose sexual partner(s) are women of childbearing potential not willing to use a highly effective method of contraception; 11. Clinically significant, uncontrolled or active cardiovascular disease, specifically including, but not restricted to: any history of myocardial infarction, stroke, or revascularization; unstable angina or transient ischemic attack within 6 months prior to enrolment; congestive heart failure within 6 months prior to enrolment or left ventricular ejection fraction (LVEF) less than lower limit of normal per local institutional standards; history of clinically significant (as determined by the treating physician) atrial arrhythmia; any history of ventricular arrhythmia; any history of venous thromboembolism including deep venous thrombosis or pulmonary embolism;Uncontrolled hypertension; 12. Active known positive HIV serology; 13. Active serious infection not controlled by oral or intravenous antibiotics; 14. Patients with known allergies or contraindications to the study drug; 15. Patients with bleeding disorders unrelated to ALL.", "description": "Compared with patients with philadelphia chromosome-negative Acute Lymphoblastic Leukemia (Ph- ALL), patients with Ph-positive (Ph+) ALL exhibit a comparatively poor prognosis. Fortunately, significant improvements have been found in response rates, disease-free survival (DFS), and overall survival (OS) for patients with Ph+ ALL with the introduction of tyrosine kinase inhibitor (TKI) therapy to treatment regimens. Based on improvements in efficacy and tolerability, next-generation TKIs have been widely used in first-line treatment for chronic myeloid leukemia (CML). Flumatinib, a TKI with more potent binding affinity for BCR-ABL1 tyrosine kinase than imatinib, demonstrated higher rates of responses, faster and deeper responses in FESTnd trial, which suggested that flumatinib might show improved clinical efficacy for treating Ph+ ALL compared with imatinib. The investigators therefore hypothesized that the addition of flumatinib to combinatorial chemotherapy regimen would demonstrate greater efficacy compared with the prior use of imatinib in treating Ph+ ALL. This study explored the safety and efficacy of flumatinib versus imatinib when combined with multi-agent chemotherapy in patients with newly diagnosed Ph+ ALL.", "title": "Flumatinib Versus Imatinib Combined With Multiagent Chemotherapy for Newly Diagnosed Philadelphia Chromosome-positive Acute Lymphoblastic Leukemia: A Prospective, Open-label，Randomized，Multi-center Clinical Trial", "url": "https://ClinicalTrials.gov/show/NCT05071482", "enrollment": "238", "max_age": "65.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05071482", "locations": ["China"], "min_age": "18.0", "outcome_measures": ["Relapse free survival; up to 24 months", "Relapse free survival; up to 24 months"], "phases": ["PHASE4"], "status": "RECRUITING", "start_date": "2021-09-16"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  In order to be eligible to participate in this study, an individual must meet all of the following criteria:  1. Candidates with relapse or refractory CD33+ acute myeloid leukemia, who have progressed on after treatment with all standard therapies or intolerant of standard care, have limited prognosis with currently available therapies and had no available curative treatment options (such as HSCT or chemotherapy) 2. Male or female, aged 1-70 years 3. No serious allergic constitution 4. Eastern Cooperative Oncology Group (ECOG) performance status (Oken et al.,1982) score 0 to 2 5. Have life expectancy of at least 60 days based on investigator's judgement 6. CD33 positive in bone marrow or cerebrospinal fluid (CSF) by flow cytometry, or CD33 positive in tumor tissues by immunohistochemistry; (CD33 positive criteria: Flow cytometry: Positive: \\> 80% of tumor cells expressed CD33 and the MFI of CD33 is the same as that in normal myeloid cells; Dim: \\> 80% of tumor cells expressed CD33, but the MFI of CD33 is lower than that in normal myeloid cells as least as 1log; Partial positive: 20-80% of tumor cells expressed CD33 and the MFI of CD33 is the same as that in normal myeloid cells. Tumor tissue immunohistochemistry: Positive \\> 30% tumor cells expressed CD33); 7. Provide a signed informed consent before any screening procedure; subjects who voluntarily participate in the study should have the ability to understand and sign the informed consent form and be willing to follow the study visit schedule and relevant study procedure, as specified in the protocol. Candidates aged 19-70 years need to be sufficiently conscious and able to sign the treatment consent form and voluntary consent form. Pediatric patients aged 1-7 years could be recruited after signing an informed consent form by a legal surrogate (Guardian); pediatric patients aged 8-18 years need to be sufficiently conscious and voluntarily signed an informed consent form, and their legal surrogates (guardians) were also required to sign a written informed consent form.  Exclusion Criteria:  An individual who meets any of the following criteria will be excluded from participation in this study:  1. Intracranial hypertension or disorder of consciousness 2. Symptomatic heart failure or severe arrhythmia 3. Symptoms of severe respiratory failure 4. Complicated with other types of malignant tumors 5. Diffuse intravascular coagulation 6. Serum creatinine and / or blood urea nitrogen ≥ 1.5 times of the normal value 7. Suffering from septicemia or other uncontrollable infections 8. Patients with uncontrollable diabetes 9. Severe mental disorders 10. Obvious and active intracranial lesions were detected by cranial magnetic resonance imaging (MRI) 11. Have received organ transplantation (excluding hematopoietic stem cell transplantation); 12. Reproductive-aged female patients with positive blood HCG test 13. Screened to be positive of infection of hepatitis (including hepatitis B and C), AIDS or syphilis 14. Patients with tumor burden higher than 30% requiring reinfusion of autologous CAR-T cells.", "description": "This is a open-label, nonramdominzed, single-arm, Phase I/II Study to evaluate safety and tolerability of functionally enhanced CD33 CAR-T cells in subjects with relapsed or refractory acute myeloid leukemia. 25 subjects will be enrolled. Subjects will be pretreated with chemotherapy prior to infusion of CAR T cells: about 5 days before cells transfusion, the patients who planned to reinfuse CAR T cells were treated with fluorodarabine 30 mg/m\\^2( body surface area) and cyclophosphamide 250 mg/m\\^2( body surface area) for 3 days. Then the Bayesian optimal interval phase I/II (Boin12) trial design will be used in this study: The protocol preset 2 dose levels: Dose 1 (DL-1) was 5×10\\^5 (±20%) CAR T cells/kg, and dose 2 (DL-2) was 1×10\\^6 (±20%) CAR T cells/kg. Phase I was the dose exploration phase. After determining the optimal biological dose (OBD), phase II will be expanded at the OBD dose by 10 cases, enrollment will reach 25 cases, and the trial will be discontinued. Moreover, the first 3 enrolled subjects per dose group will be on one by one dosing regimen.  The expected initial dose of 5×10\\^5 (±20%) CAR T cells/kg could not be achieved due to preparation problems and should be placed in the reduced dose group. The number of cells will be collected by the above regimen as far as possible. If this is not possible, subjects can still enter the study upon investigator consideration but require documentation of dosing. The lowest dose is 1×10\\^5 CAR T cells/kg (±20%), and the highest dose is 1×10\\^6 CAR T cells/kg (±20%). If the dose is out of the range mentioned above, entry into the trial will not be considered.", "title": "Open-Label, Nonramdominzed, Single-Arm Phase I/II Study to Evaluate the Safety and Tolerability of Functionally Enhanced CD33 CAR T Cells in Subjects With Relapsed or Refractory Acute Myeloid Leukemia", "url": "https://ClinicalTrials.gov/show/NCT04835519", "enrollment": "25", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04835519", "locations": ["China"], "min_age": "1.0", "outcome_measures": ["Incidence and type of dose-limiting toxicity (DLT); day 21 post intravenous CAR T cell infusion", "Incidence and severity of adverse events (AE); day 28 post intravenous CAR T cell infusion", "Incidence and severity of adverse events (AE); day 28 post intravenous CAR T cell infusion", "Incidence and type of dose-limiting toxicity (DLT); day 21 post intravenous CAR T cell infusion"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2021-04-08"}
{"study_results": "False", "gender": "ALL", "criteria": "Key Inclusion Criteria:  * Participants must have documented relapsed or refractory (R/R) AML, ALL, or acute leukemias of ambiguous lineage (ALAL) including MPAL and acute undifferentiated leukemia (AUL) harboring KMT2A rearrangement, KMT2A amplification, NPM1c, or NUP98r. * White blood count must be \\<25,000/microliter prior to the first dose of SNDX-5613. Participants may receive cytoreduction per protocol prior to beginning SNDX-5613. * Eastern Cooperative Oncology Group performance status score 0-2 (if aged ≥18 years); Karnofsky Performance Scale of ≥50 (if aged ≥16 years and \\<18 years); Lansky Performance Score of ≥50 (if aged \\<16 years). * Adequate liver, kidney, and cardiac function * Participant must be taking 1 of the following medications for antifungal prophylaxis: itraconazole, ketoconazole, posaconazole, or voriconazole. * A female of childbearing potential must agree to use a highly effective method of contraception or double barrier method from the time of enrollment through 120 days following the last study drug dose.    * A male of childbearing potential must agree to use barrier contraception from the time of enrollment through 120 days following the last study drug dose.  Key Exclusion Criteria:  * Any unresolved ≥Grade 2 reversible toxicity from previous anticancer therapy except alopecia or Grade 2 neuropathy * Graft-Versus-Host Disease (GVHD): Signs or symptoms of acute or chronic GVHD \\>Grade 0 within 4 weeks of enrollment. All transplant participants must have discontinued all systemic immunosuppressive therapy for at least 2 weeks and calcineurin inhibitors for at least 4 weeks prior to enrollment. Participants may be on physiological doses of steroids. * Concurrent malignancy in the previous 2 years, with the exception of basal cell carcinoma of the skin, squamous cell carcinoma of the skin, or carcinoma in situ (for example, breast carcinoma, cervical cancer in situ, melanoma in situ) treated with potentially curative therapy. Concurrent malignancy must be in complete remission or no evidence of disease during this timeframe. For participants with therapy-related leukemia, primary disease must be in remission for 1-year following completion of therapy. * If the participant is known to be human immunodeficiency virus (HIV)-positive, the participant must have undetectable HIV viral load within the previous 6 months. * Hepatitis B * Hepatitis C * Cardiac Disease:    * Any of the following within the 6 months prior to study entry: myocardial infarction, uncontrolled/unstable angina, congestive heart failure (New York Heart Association Classification Class ≥II), life-threatening uncontrolled arrhythmia, cerebrovascular accident, or transient ischemic attack.   * QTcF interval \\>450 milliseconds * Any gastrointestinal (GI) issue of the upper GI tract that might affect oral drug absorption or ingestion (for example, gastric bypass, gastroparesis). * Cirrhosis with a Child-Pugh score of B or C * Down Syndrome * Genetic syndromes: Bloom syndrome, ataxia-telangiectasia, Fanconi anemia, Kostmann syndrome, Shwachman syndrome, or any other known bone marrow failure syndrome. * Participation in another therapeutic interventional clinical study within 28 days of starting SNDX-5613. * Radiation Therapy: within 60 days from prior total body irradiation, craniospinal radiation and/or ≥50% radiation of the pelvis, or within 14 days from local palliative radiation therapy (small port). * Stem Cell Infusion or Donor Lymphocyte Infusion: within 60 days from hematopoietic stem cell transplantation and within 28 days from donor lymphocyte infusion without conditioning. * Biologics (for example, monoclonal antibody therapy, bispecific antibodies, and antibody-drug conjugates): within 28 days or 5 half-lives, whichever is longer, since the completion of therapy with a biologic agent. * Immunotherapy: within 42 days since tumor vaccines and checkpoint inhibitors, and within 21 days since receipt of chimeric antigen receptor therapy or other modified T-cell therapy. * Hematopoietic Growth Factors: within 7 days since the completion of therapy with short-acting hematopoietic growth factors and within 14 days with long-acting growth factors.", "description": "The purpose of this study is to determine the safety and tolerability of SNDX-5613 when given in combination with 2 different chemotherapy regimens in participants with relapsed/refractory acute leukemias harboring KMT2A rearrangement, KMT2A amplification, NPM1c, or NUP98r.", "title": "AUGMENT-102: A Phase 1, Open-label, Dose-escalation Study to Evaluate Safety, Tolerability and Preliminary Anti-Leukemic Activity of SNDX-5613 in Combination With Chemotherapy in Patients With Relapsed/Refractory Leukemias Harboring Alterations in KMT2A/MLL, Nucleophosmin 1 (NPM1), and Nucleoporin 98 (NUP98) Genes", "url": "https://ClinicalTrials.gov/show/NCT05326516", "enrollment": "54", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05326516", "locations": ["United States", "Canada"], "outcome_measures": ["Number of Participants With Dose Limiting Toxicities From SNDX-5613; Day 1 through up to 30 days after last dose of study intervention", "Number of Participants With Treatment-emergent Adverse Events; Day 1 through up to 30 days after last dose of study intervention", "Number of Participants With Treatment-emergent Adverse Events; Day 1 through up to 30 days after last dose of study intervention", "Number of Participants With Dose Limiting Toxicities From SNDX-5613; Day 1 through up to 30 days after last dose of study intervention"], "min_age": "0.0821917808219178", "phases": ["PHASE1"], "start_date": "2022-03-09", "status": "RECRUITING"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. Relapsed or refractory B cell derived acute lymphoblastic leukemia(ALL), chronic lymphocytic leukemia(CLL) and non-hodgkin lymphoma. 2. KPS\\>60. 3. Life expectancy\\>3 months. 4. Gender unlimited, age from 4 years to 75 years. 5. Disease progresses but reserves reaction to recent treatments. 6. Patients who have failed at least one line of a standard treatment. 7. No serious mental disorder. 8. Patients must have adequate cardiac function(no cardiac disease, LVEF≥40% ), adequate pulmonary function as indicated by room air oxygen saturation of \\>94%, and adequate renal function(Cr≤133umol/L). 9. No other serious diseases(autoimmune disease, immunodeficiency etc.). 10. No other tumors. 11. Patients volunteer to participate in the research.  Exclusion Criteria:  1. HIV affected. 2. Patients are allergic to cytokines. 3. Central nervous system leukemia within 28 days. 4. Uncontrolled active infection. 5. Acute or chronic GVHD. 6. Treated with T cell inhibitor. 7. Pregnancy and nursing females. 8. Other situations we think improper for the research.", "description": "The main purpose of this research is to verify the safety of CD19 targeted chimeric antigen receptor T cells and to determine the proper dosage of CAR T cells infused.", "title": "A Clinical Research of Chimeric Antigen Receptor (CAR) T Cells Targeting CD19 Positive Malignant B-cell Derived Leukemia and Lymphoma", "url": "https://ClinicalTrials.gov/show/NCT02349698", "enrollment": "45", "max_age": "75.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT02349698", "locations": ["China"], "min_age": "4.0", "outcome_measures": ["Adverse events of each patient.; 3 years", "Adverse events of each patient.; 3 years"], "phases": ["PHASE1", "PHASE2"], "status": "RECRUITING", "start_date": "2014-12"}
{"study_results": "False", "gender": "ALL", "criteria": "Key Inclusion Criteria:  * Age ≥ 18 years. * Individuals with histologically or pathologically confirmed diagnosis of relapsed or refractory AML, ALL, or MPAL with documented FLT3 mutation, and/or Individuals with histologically or pathologically confirmed diagnosis of their malignancy with wild-type FLT3 (including those with MLL1-R and NPM1 mutations). * ECOG performance status of 0-2. * Adequate liver and renal function * Adhere to the CYP3A4 inhibitor concomitant therapy use requirements, as follows: * Arm A: Participants must not have received a moderate or strong CYP3A4 inhibitor for at least 7 days prior to enrollment and are not anticipated to require such agents in the near term (for at least 4 weeks). * Arm B: Participants must have received a necessary azole antifungal(s) that is a moderate or strong CYP3A4 inhibitor (excluding other moderate or strong CYP3A4 inhibitor\\[s\\]) for at least 7 days prior to enrollment and be able to continue such azole antifungal(s) while on BMF-500 treatment for at least 4 weeks.  Key Exclusion Criteria:  * Significant cardiovascular disease including unstable angina pectoris, uncontrolled hypertension or arrhythmia, history of cerebrovascular accident including transient ischemic attack within 6 months prior to the first dose of the trial intervention. * WBC count \\>50,000/µL (uncontrollable with cytoreductive therapy). * Women who are pregnant or lactating or plan to become pregnant.", "description": "A Phase 1 first-in-human dose-escalation and dose-expansion study of BMF-500, an oral FLT3 inhibitor, in adult patients with acute leukemia.", "title": "A Phase 1, Open-label, Dose-escalation, and Dose-expansion Study of BMF-500, an Oral Covalent FLT3 Inhibitor, in Adults With Acute Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05918692", "enrollment": "110", "max_age": "0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05918692", "locations": ["United States"], "min_age": "18.0", "outcome_measures": ["Evaluate the safety and tolerability of BMF-500 monotherapy by incidence of Treatment Emerging Adverse Events (TEAEs).; At the end of each 28 Day cycle for a maximum of 32 cycles", "Evaluate the safety and tolerability of BMF-500 monotherapy by incidence of Serious Adverse Events (SAEs).; At the end of each 28 Day cycle for a maximum of 32 cycles", "Determine the recommended Phase 2 Dose (RP2D) of BMF-500.; At the end of 28 day Dose-Limiting Toxicities (DLT) observation Period", "Determine the recommended Phase 2 Dose (RP2D) of BMF-500.; At the end of 28 day Dose-Limiting Toxicities (DLT) observation Period", "Determine the recommended Phase 2 Dose (RP2D) of BMF-500.; At the end of 28 day Dose-Limiting Toxicities (DLT) observation Period", "Determine the recommended Phase 2 Dose (RP2D) of BMF-500.; At the end of 28 day Dose-Limiting Toxicities (DLT) observation Period", "Determine the recommended Phase 2 Dose (RP2D) of BMF-500.; At the end of 28 day Dose-Limiting Toxicities (DLT) observation Period", "Evaluate the safety and tolerability of BMF-500 monotherapy by incidence of Serious Adverse Events (SAEs).; At the end of each 28 Day cycle for a maximum of 32 cycles", "Evaluate the safety and tolerability of BMF-500 monotherapy by incidence of Treatment Emerging Adverse Events (TEAEs).; At the end of each 28 Day cycle for a maximum of 32 cycles"], "phases": ["PHASE1"], "status": "RECRUITING", "start_date": "2023-07-26"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  1. patients from 6 to 18 years old 2. diagnosis of acute lymphoblastic leukemia during chemotherapy  Exclusion Criteria:  1. patients less then 6, and older then 18 years old 2. patients who cannot perform the study MRI without general anesthesia 3. Refusal to sign informed consent. 4. The presence of absolute contraindications to MRI studies. 5. Extremely serious condition of the patient.", "description": "The study is aimed at assessing changes in the brain of patients from 6 to 18 years old with a diagnosis of acute lymphoblastic leukemia during chemotherapy.", "title": "Clinical Study of the Therapy Neurotoxicity Using Quantitative Assessment of the Brain Structures and Functions by MRI, EEG and Evoked Potentials in Patients With Acute Lymphoblastic Leukemia Over 6 Years Old", "url": "https://ClinicalTrials.gov/show/NCT04767152", "enrollment": "110", "max_age": "18.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT04767152", "locations": ["Russian Federation"], "min_age": "6.0", "outcome_measures": ["percentage of the macromolecular proton fraction (MPF) in brain tissue.; Before the start of therapy", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; 36 ± 3 days after the start of the therapy..", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; ap to 1 week After completing three courses of consolidation chemotherapy.", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; ap to 1 week After confirmation of remission status, optionally provided.", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; Before the start of therapy", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; ap to 1 week After confirmation of remission status, optionally provided.", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; 36 ± 3 days after the start of the therapy..", "percentage of the macromolecular proton fraction (MPF) in brain tissue.; ap to 1 week After completing three courses of consolidation chemotherapy."], "phases": ["NA"], "status": "RECRUITING", "start_date": "2021-02-16"}
{"study_results": "False", "gender": "ALL", "criteria": "Inclusion Criteria:  -  1. Aged 18-70 years, gender is not limited 2. Acute myelogenous leukemia or chronic monocytic leukemia:  1. Subjects diagnosed with acute myelogenous leukemia according to WHO 2016 criteria and according to the \"Chinese Guidelines for the Diagnosis and Treatment of Relapsed and Refractory Acute Myeloid Leukemia (2021 Edition)\" should meet any of the following relapsed and refractory (R/R) acute myelogenous leukemia patients:     1. Patients who have failed two cycles of standard chemotherapy;    2. No remission was achieved after 1 cycle of the standard regimen and could not continue with the standard regimen due to age, comorbidities, physical status, and / or adverse risk factors;    3. Relapse within 12 months after consolidation and intensification therapy after complete remission (CR);    4. Relapse after 12 months but failed to respond to conventional treatment;    5. two or more recurrences;    6. persistent extramedullary leukemia;    7. For age\\> 60 years: standard regimen chemotherapy due to age, comorbidities, physical status, and / or adverse risk factors, and treated with 4 cycles of demethylating drugs (such as decitabine and / or azacitidine) or 2 cycles of low-dose chemotherapy ± demethylating drugs。 Note: Definition of relapse: reoccurrence of leukemic cells in peripheral blood after CR or in bone marrow\\> 5% (except for other causes such as marrow regeneration after consolidation chemotherapy) or extramedullary infiltration of leukemic cells. 2. Chronic granule-monocytic leukemia (CMML) type 2 was diagnosed according to the World Health Organization (WHO) 2016 Hematopoietic and Lymphoid Tissue tumors and the Chinese Guidelines for the Diagnosis and Treatment of Chronic Grain-Monocytic Leukemia (2021 edition), and did not achieve remission after at least one treatment or relapsed after remission。 3. Eastern Cooperative Oncology Group physical status level is 0 to 2; 4. Bone marrow sample must be LILRB4 positive； 5. Major organs must meet the following criteria:     1. Liver function: Total bilirubin≤1.5 times the upper limit of normal,glutamic-pyruvic transaminase and glutamic oxalacetic transaminase≤3 times the upper limit of normal,    2. Renal function:Creatinine≤1.5 times the upper limit of normal (ULN) or creatinine clearance rate ≥60ml/min,    3. Cardiac function:LVEF≥50%，    4. Lung function:Defined as ≤grade 1 dyspnea and blood oxygen saturation \\>92%; 6. Female subjects of reproductive age or male subjects whose partners are women of reproductive age agree to use an effective method of contraception throughout the trial and for 12 months after cell infusion; 7. The subjects voluntarily joined the study, signed the informed consent form, had good compliance, and cooperated with the follow-up.  Exclusion Criteria:  1. Patients who have used chimeric antigen receptor T-cell immunotherapy therapy or any other gene transduction product within 3 months of signing the informed consent, except without detectable chimeric antigen receptor T-cell ratio or chimeric antigen receptor T-cell ratio below the lower test limit; or patients who have participated in other interventional clinical studies within 4 weeks prior to signing the informed consent； 2. Any of the following cardiovascular and cerebrovascular diseases occurred within 6 months before screening:     1. congestive heart failure(NYHA stage III),myocardial infarction,unstable angina pectoris,congenital long QT syndrome,Anterior left block,coronary angioplasty,stent implantation,Coronary/peripheral artery bypass grafting,cerebrovascular accident,Transient ischemic attack or pulmonary embolism,Asymptomatic right bundle branch block was allowed;    2. Serious arrhythmias requiring treatment (eg, sustained ventricular tachycardia, ventricular fibrillation, torsades de pointes, etc.);    3. uncontrolled hypertension (systolic blood pressure greater than 160 mmHg and/or diastolic blood pressure greater than 100 mmHg), a history of hypertensive crisis or hypertensive encephalopathy; 3. Subjects with positive hepatitis B surface antigen (HBsAg) or positive hepatitis B core antibody (HBcAb) and hepatitis B virus DNA copy number above the detection limit; subjects with positive hepatitis C virus (HCV) antibody and positive HCV RNA copy number above the detection limit; positive pallidum antibody test； 4. Patients with known systemic lupus erythematosus, combined active or uncontrolled autoimmune diseases (such as Crohns disease, rheumatoid arthritis, autoimmune hemolytic anemia, etc.), primary or secondary immune deficiency (such as HIV infection or severe infectious diseases, etc.)； 5. Previous or concurrent other incurable malignancies with unstable control,Affect the long-term survival of subjects, except for cured cervical carcinoma in situ, non-invasive basal cell or squamous cell skin cancer or other local prostate cancer after radical treatment, ductal carcinoma in situ after radical resection and at least 5 Years without recurrence of malignant tumor; 6. Patients with current disease or a previous history of central nervous system disease, such as seizures, stroke, severe brain injury, aphasia, paralysis, dementia, Parkinson's disease, mental illness, etc； 7. Patients living with an active central nervous system leukemia (CNSL)； 8. Patients who had prior solid organ transplantation or allogeneic hematopoietic stem cell transplantation (allo-HSCT) 6 months before screening； 9. Subjects with aGVHD and cGVHD at screening； 10. Subjects who have had any of the following drugs or treatments within the specified time period prior to apheresis:      1. Administered any immunosuppressant within 2 weeks prior to apheresis;     2. Received any chemotherapy within 2 weeks or 3 half-lives, whichever is shorter, prior to apheresis;     3. Received any macromolecule or small molecule targeted therapy such as monoclonal antibody, antibody-drug conjugate (ADC), double antibody, etc. within 4 weeks before apheresis or within 3 half-lives (whichever is shorter); 11. Those with mental illness or history of drug abuse; 12. Pregnant or breastfeeding subjects; 13. The investigator believes that there are other factors that are not suitable for inclusion or that affect subjects participating in or completing the study.", "description": "This is a single-center,single-arm,open-label phase I clinical study to determine the safety and efficacy of LILRB4 STAR-T cells in Monocytic Leukemia subjects.", "title": "An Exploratory Clinical Study on the Safety and Efficacy of LILRB4 STAR-T Cells in the Treatment of Monocytic Leukemia", "url": "https://ClinicalTrials.gov/show/NCT05739409", "enrollment": "10", "max_age": "70.0", "study_type": "INTERVENTIONAL", "sampling_method": "", "healthy_volunteers": "False", "name": "NCT05739409", "locations": ["China"], "min_age": "18.0", "outcome_measures": ["Evaluate safety and tolerability; 12 months", "Evaluate safety and tolerability; 12 months"], "phases": ["NA"], "status": "NOT_YET_RECRUITING", "start_date": "2023-02"}
